; ModuleID = 'src/test/fibers_link.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nk_virtual_console = type opaque
%struct.shell_cmd_impl = type { i8*, i8*, i32 (i8*, i8*)* }
%struct.naut_info = type { %struct.sys_info, %struct.cmdline_state*, %struct.nk_test_harness* }
%struct.sys_info = type { [256 x %struct.cpu*], [16 x %struct.ioapic*], i32, i32, i64, %struct.nk_barrier*, %struct.nk_mem_info, i32, i8, %struct.pci_info*, %struct.hpet_dev*, %struct.multiboot_info*, %struct.nk_int_info, %struct.nk_locality_info, %struct.pmc_info*, %struct.nk_link_info*, %struct.nk_prog_info* }
%struct.cpu = type { %struct.nk_thread*, i16, i16, i64, i64, %struct.nk_fiber_percpu_state*, i32, i32, i8, i8, i32, i32, i8, %struct.apic_dev*, %struct.sys_info*, i32, %struct.nk_sched_percpu_state*, %struct.nk_queue*, %struct.nk_xcall, i64, %struct.nk_topo_params*, %struct.nk_cpu_coords*, %struct.numa_domain*, %struct.nk_queue_entry, %struct.nk_rand_info* }
%struct.nk_thread = type { i64, i8*, i16, i16, i64, i64, i32, %struct.nk_thread*, %struct.list_head, %struct.list_head, i64, %struct.nk_wait_queue*, i32, %struct.nk_timer*, i32, i32, i32, i32, i8, i8**, i8*, i8*, void (i8*, i8**)*, %struct.nk_sched_thread_state*, %struct.nk_virtual_console*, [32 x i8], [256 x i8*], [32 x i8], [4096 x i8] }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "vc", scope: !2, file: !3, line: 43, type: !47, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 8.0.0 (tags/RELEASE_800/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !23, globals: !129, nameTableKind: None)
!3 = !DIFile(filename: "src/test/fibers.c", directory: "/home/sgi9754/nautilus-cs446")
!4 = !{!5, !15}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "include/nautilus/fiber.h", directory: "/home/sgi9754/nautilus-cs446")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "INIT", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "READY", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "YIELD", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "WAIT", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "EXIT", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "RUN", value: 5, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 166, baseType: !7, size: 32, elements: !17)
!16 = !DIFile(filename: "include/nautilus/thread.h", directory: "/home/sgi9754/nautilus-cs446")
!17 = !{!18, !19, !20, !21, !22}
!18 = !DIEnumerator(name: "NK_THR_INIT", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "NK_THR_RUNNING", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "NK_THR_WAITING", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "NK_THR_SUSPENDED", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "NK_THR_EXITED", value: 4, isUnsigned: true)
!23 = !{!24, !29, !72, !86}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_fiber_t", file: !6, line: 104, baseType: !26)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_fiber", file: !6, line: 70, size: 1216, elements: !27)
!27 = !{!28, !32, !34, !37, !39, !40, !44, !46, !49, !51, !58, !59, !60, !61, !67, !68, !69}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "rsp", scope: !26, file: !6, line: 71, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !30, line: 50, baseType: !31)
!30 = !DIFile(filename: "include/nautilus/naut_types.h", directory: "/home/sgi9754/nautilus-cs446")
!31 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !26, file: !6, line: 72, baseType: !33, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_state_offset", scope: !26, file: !6, line: 73, baseType: !35, size: 16, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !30, line: 58, baseType: !36)
!36 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !26, file: !6, line: 75, baseType: !38, size: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_stack_size_t", file: !6, line: 43, baseType: !29)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !26, file: !6, line: 76, baseType: !31, size: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !26, file: !6, line: 78, baseType: !41, size: 32, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !42, line: 39, baseType: !43)
!42 = !DIFile(filename: "include/nautilus/spinlock.h", directory: "/home/sgi9754/nautilus-cs446")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !30, line: 54, baseType: !7)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "f_status", scope: !26, file: !6, line: 79, baseType: !45, size: 32, offset: 352)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_fiber_status", file: !6, line: 66, baseType: !5)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "vc", scope: !26, file: !6, line: 82, baseType: !47, size: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_virtual_console", file: !6, line: 82, flags: DIFlagFwdDecl)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "is_idle", scope: !26, file: !6, line: 83, baseType: !50, size: 32, offset: 448)
!50 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "wait_queue", scope: !26, file: !6, line: 91, baseType: !52, size: 128, offset: 512)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !53, line: 64, size: 128, elements: !54)
!53 = !DIFile(filename: "include/nautilus/list.h", directory: "/home/sgi9754/nautilus-cs446")
!54 = !{!55, !57}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !52, file: !53, line: 65, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !52, file: !53, line: 65, baseType: !56, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "wait_node", scope: !26, file: !6, line: 92, baseType: !52, size: 128, offset: 640)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "num_wait", scope: !26, file: !6, line: 93, baseType: !50, size: 32, offset: 768)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "sched_node", scope: !26, file: !6, line: 97, baseType: !52, size: 128, offset: 832)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !26, file: !6, line: 99, baseType: !62, size: 64, offset: 960)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_fiber_fun_t", file: !6, line: 56, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !33, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !26, file: !6, line: 100, baseType: !33, size: 64, offset: 1024)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !26, file: !6, line: 101, baseType: !66, size: 64, offset: 1088)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "is_done", scope: !26, file: !6, line: 103, baseType: !70, size: 8, offset: 1152)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !30, line: 61, baseType: !71)
!71 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_thread_t", file: !16, line: 233, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_thread", file: !16, line: 178, size: 51200, elements: !75)
!75 = !{!76, !77, !78, !79, !82, !83, !84, !85, !87, !88, !89, !90, !94, !95, !98, !100, !101, !102, !103, !104, !105, !106, !107, !109, !113, !114, !119, !125}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "rsp", scope: !74, file: !16, line: 179, baseType: !29, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !74, file: !16, line: 180, baseType: !33, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_state_offset", scope: !74, file: !16, line: 181, baseType: !35, size: 16, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "cache_part_state", scope: !74, file: !16, line: 183, baseType: !80, size: 16, offset: 144)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_cache_part_thread_state_t", file: !81, line: 32, baseType: !35)
!81 = !DIFile(filename: "include/nautilus/cachepart.h", directory: "/home/sgi9754/nautilus-cs446")
!82 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !74, file: !16, line: 185, baseType: !38, size: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !74, file: !16, line: 186, baseType: !31, size: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !74, file: !16, line: 188, baseType: !50, size: 32, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !74, file: !16, line: 191, baseType: !86, size: 64, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !74, file: !16, line: 192, baseType: !52, size: 128, offset: 448)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "child_node", scope: !74, file: !16, line: 193, baseType: !52, size: 128, offset: 576)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !74, file: !16, line: 194, baseType: !31, size: 64, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !74, file: !16, line: 196, baseType: !91, size: 64, offset: 768)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_wait_queue_t", file: !16, line: 175, baseType: !93)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_wait_queue", file: !16, line: 175, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "num_wait", scope: !74, file: !16, line: 198, baseType: !50, size: 32, offset: 832)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !74, file: !16, line: 201, baseType: !96, size: 64, offset: 896)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_timer", file: !16, line: 201, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !74, file: !16, line: 204, baseType: !99, size: 32, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_thread_status_t", file: !16, line: 172, baseType: !15)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "bound_cpu", scope: !74, file: !16, line: 206, baseType: !50, size: 32, offset: 992)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "placement_cpu", scope: !74, file: !16, line: 207, baseType: !50, size: 32, offset: 1024)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "current_cpu", scope: !74, file: !16, line: 208, baseType: !50, size: 32, offset: 1056)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "is_idle", scope: !74, file: !16, line: 210, baseType: !70, size: 8, offset: 1088)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "output_loc", scope: !74, file: !16, line: 212, baseType: !66, size: 64, offset: 1152)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !74, file: !16, line: 213, baseType: !33, size: 64, offset: 1216)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !74, file: !16, line: 214, baseType: !33, size: 64, offset: 1280)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !74, file: !16, line: 215, baseType: !108, size: 64, offset: 1344)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_thread_fun_t", file: !16, line: 61, baseType: !63)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "sched_state", scope: !74, file: !16, line: 217, baseType: !110, size: 64, offset: 1408)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_sched_thread_state", file: !112, line: 99, flags: DIFlagFwdDecl)
!112 = !DIFile(filename: "include/nautilus/scheduler.h", directory: "/home/sgi9754/nautilus-cs446")
!113 = !DIDerivedType(tag: DW_TAG_member, name: "vc", scope: !74, file: !16, line: 219, baseType: !47, size: 64, offset: 1472)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !74, file: !16, line: 225, baseType: !115, size: 256, offset: 1536)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 256, elements: !117)
!116 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!117 = !{!118}
!118 = !DISubrange(count: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !74, file: !16, line: 227, baseType: !120, size: 16384, offset: 1792)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 16384, elements: !123)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!123 = !{!124}
!124 = !DISubrange(count: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_state", scope: !74, file: !16, line: 229, baseType: !126, size: 32768, align: 512, offset: 18432)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 32768, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 4096)
!129 = !{!130, !143, !145, !147, !149, !151, !153, !155, !157, !159, !161, !0, !163, !165, !167, !169, !171, !173, !175, !177, !179, !181, !183}
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl", scope: !2, file: !3, line: 703, type: !132, isLocal: true, isDefinition: true, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "shell_cmd_impl", file: !134, line: 43, size: 192, elements: !135)
!134 = !DIFile(filename: "include/nautilus/shell.h", directory: "/home/sgi9754/nautilus-cs446")
!135 = !{!136, !138, !139}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !133, file: !134, line: 44, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "help_str", scope: !133, file: !134, line: 45, baseType: !137, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !133, file: !134, line: 46, baseType: !140, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!50, !137, !33}
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl2", scope: !2, file: !3, line: 704, type: !132, isLocal: true, isDefinition: true, align: 64)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl3", scope: !2, file: !3, line: 705, type: !132, isLocal: true, isDefinition: true, align: 64)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl4", scope: !2, file: !3, line: 706, type: !132, isLocal: true, isDefinition: true, align: 64)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl5", scope: !2, file: !3, line: 707, type: !132, isLocal: true, isDefinition: true, align: 64)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl6", scope: !2, file: !3, line: 708, type: !132, isLocal: true, isDefinition: true, align: 64)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl7", scope: !2, file: !3, line: 709, type: !132, isLocal: true, isDefinition: true, align: 64)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl8", scope: !2, file: !3, line: 710, type: !132, isLocal: true, isDefinition: true, align: 64)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl9", scope: !2, file: !3, line: 711, type: !132, isLocal: true, isDefinition: true, align: 64)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl10", scope: !2, file: !3, line: 712, type: !132, isLocal: true, isDefinition: true, align: 64)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl11", scope: !2, file: !3, line: 713, type: !132, isLocal: true, isDefinition: true, align: 64)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "fibers_impl", scope: !2, file: !3, line: 633, type: !133, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "fibers_impl2", scope: !2, file: !3, line: 639, type: !133, isLocal: true, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "fibers_impl3", scope: !2, file: !3, line: 645, type: !133, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "fibers_impl4", scope: !2, file: !3, line: 651, type: !133, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "fibers_impl5", scope: !2, file: !3, line: 657, type: !133, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "fibers_impl6", scope: !2, file: !3, line: 663, type: !133, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "fibers_impl7", scope: !2, file: !3, line: 669, type: !133, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "fibers_impl8", scope: !2, file: !3, line: 675, type: !133, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "fibers_impl9", scope: !2, file: !3, line: 681, type: !133, isLocal: true, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "fibers_impl10", scope: !2, file: !3, line: 687, type: !133, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "fibers_impl11", scope: !2, file: !3, line: 694, type: !133, isLocal: true, isDefinition: true)
!185 = distinct !DICompileUnit(language: DW_LANG_C99, file: !186, producer: "clang version 8.0.0 (tags/RELEASE_800/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !187, retainedTypes: !298, nameTableKind: None)
!186 = !DIFile(filename: "src/nautilus/fiber.c", directory: "/home/sgi9754/nautilus-cs446")
!187 = !{!188, !15, !5, !267, !274, !281, !287, !293}
!188 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !190, file: !189, line: 40, baseType: !7, size: 32, elements: !263)
!189 = !DIFile(filename: "include/nautilus/timer.h", directory: "/home/sgi9754/nautilus-cs446")
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_timer", file: !189, line: 38, size: 960, elements: !191)
!191 = !{!192, !193, !195, !196, !197, !255, !256, !260, !261, !262}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !190, file: !189, line: 39, baseType: !115, size: 256)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !190, file: !189, line: 42, baseType: !194, size: 32, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !188)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !190, file: !189, line: 43, baseType: !29, size: 64, offset: 320)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "time_ns", scope: !190, file: !189, line: 44, baseType: !29, size: 64, offset: 384)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !190, file: !189, line: 45, baseType: !198, size: 64, offset: 448)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_wait_queue_t", file: !189, line: 33, baseType: !200)
!200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_wait_queue", file: !201, line: 85, size: 197248, elements: !202)
!201 = !DIFile(filename: "include/nautilus/waitqueue.h", directory: "/home/sgi9754/nautilus-cs446")
!202 = !{!203, !204, !205, !211, !212, !213}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !200, file: !201, line: 86, baseType: !115, size: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !200, file: !201, line: 87, baseType: !41, size: 32, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !200, file: !201, line: 88, baseType: !206, size: 128, offset: 320)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !53, line: 64, size: 128, elements: !207)
!207 = !{!208, !210}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !206, file: !53, line: 65, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !206, file: !53, line: 65, baseType: !209, size: 64, offset: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "num_wait", scope: !200, file: !201, line: 89, baseType: !29, size: 64, offset: 448)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !200, file: !201, line: 90, baseType: !206, size: 128, offset: 512)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !200, file: !201, line: 91, baseType: !214, size: 196608, offset: 640)
!214 = !DICompositeType(tag: DW_TAG_array_type, baseType: !215, size: 196608, elements: !253)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_wait_queue_entry", file: !201, line: 70, size: 192, elements: !216)
!216 = !{!217, !218}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !215, file: !201, line: 71, baseType: !206, size: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !215, file: !201, line: 72, baseType: !219, size: 64, offset: 128)
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_thread", file: !16, line: 178, size: 51200, elements: !221)
!221 = !{!222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !236, !237, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "rsp", scope: !220, file: !16, line: 179, baseType: !29, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !220, file: !16, line: 180, baseType: !33, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_state_offset", scope: !220, file: !16, line: 181, baseType: !35, size: 16, offset: 128)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "cache_part_state", scope: !220, file: !16, line: 183, baseType: !80, size: 16, offset: 144)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !220, file: !16, line: 185, baseType: !38, size: 64, offset: 192)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !220, file: !16, line: 186, baseType: !31, size: 64, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !220, file: !16, line: 188, baseType: !50, size: 32, offset: 320)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !220, file: !16, line: 191, baseType: !219, size: 64, offset: 384)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !220, file: !16, line: 192, baseType: !206, size: 128, offset: 448)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "child_node", scope: !220, file: !16, line: 193, baseType: !206, size: 128, offset: 576)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !220, file: !16, line: 194, baseType: !31, size: 64, offset: 704)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !220, file: !16, line: 196, baseType: !234, size: 64, offset: 768)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_wait_queue_t", file: !16, line: 175, baseType: !200)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "num_wait", scope: !220, file: !16, line: 198, baseType: !50, size: 32, offset: 832)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !220, file: !16, line: 201, baseType: !238, size: 64, offset: 896)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !220, file: !16, line: 204, baseType: !99, size: 32, offset: 960)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "bound_cpu", scope: !220, file: !16, line: 206, baseType: !50, size: 32, offset: 992)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "placement_cpu", scope: !220, file: !16, line: 207, baseType: !50, size: 32, offset: 1024)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "current_cpu", scope: !220, file: !16, line: 208, baseType: !50, size: 32, offset: 1056)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "is_idle", scope: !220, file: !16, line: 210, baseType: !70, size: 8, offset: 1088)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "output_loc", scope: !220, file: !16, line: 212, baseType: !66, size: 64, offset: 1152)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !220, file: !16, line: 213, baseType: !33, size: 64, offset: 1216)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !220, file: !16, line: 214, baseType: !33, size: 64, offset: 1280)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !220, file: !16, line: 215, baseType: !108, size: 64, offset: 1344)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "sched_state", scope: !220, file: !16, line: 217, baseType: !110, size: 64, offset: 1408)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "vc", scope: !220, file: !16, line: 219, baseType: !47, size: 64, offset: 1472)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !220, file: !16, line: 225, baseType: !115, size: 256, offset: 1536)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !220, file: !16, line: 227, baseType: !120, size: 16384, offset: 1792)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_state", scope: !220, file: !16, line: 229, baseType: !126, size: 32768, align: 512, offset: 18432)
!253 = !{!254}
!254 = !DISubrange(count: 1024)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !190, file: !189, line: 46, baseType: !43, size: 32, offset: 512)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !190, file: !189, line: 47, baseType: !257, size: 64, offset: 576)
!257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !258, size: 64)
!258 = !DISubroutineType(types: !259)
!259 = !{null, !33}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !190, file: !189, line: 48, baseType: !33, size: 64, offset: 640)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !190, file: !189, line: 49, baseType: !206, size: 128, offset: 704)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "active_node", scope: !190, file: !189, line: 50, baseType: !206, size: 128, offset: 832)
!263 = !{!264, !265, !266}
!264 = !DIEnumerator(name: "NK_TIMER_INACTIVE", value: 0, isUnsigned: true)
!265 = !DIEnumerator(name: "NK_TIMER_ACTIVE", value: 1, isUnsigned: true)
!266 = !DIEnumerator(name: "NK_TIMER_SIGNALLED", value: 2, isUnsigned: true)
!267 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !268, line: 225, baseType: !7, size: 32, elements: !269)
!268 = !DIFile(filename: "include/dev/apic.h", directory: "/home/sgi9754/nautilus-cs446")
!269 = !{!270, !271, !272, !273}
!270 = !DIEnumerator(name: "APIC_INVALID", value: 0, isUnsigned: true)
!271 = !DIEnumerator(name: "APIC_DISABLED", value: 1, isUnsigned: true)
!272 = !DIEnumerator(name: "APIC_XAPIC", value: 2, isUnsigned: true)
!273 = !DIEnumerator(name: "APIC_X2APIC", value: 3, isUnsigned: true)
!274 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !275, line: 41, baseType: !7, size: 32, elements: !276)
!275 = !DIFile(filename: "include/nautilus/irq.h", directory: "/home/sgi9754/nautilus-cs446")
!276 = !{!277, !278, !279, !280}
!277 = !DIEnumerator(name: "INT_TRIG_BUS", value: 0, isUnsigned: true)
!278 = !DIEnumerator(name: "INT_TRIG_EDGE", value: 1, isUnsigned: true)
!279 = !DIEnumerator(name: "INT_TRIG_RSVD", value: 2, isUnsigned: true)
!280 = !DIEnumerator(name: "INT_TRIG_LEVEL", value: 3, isUnsigned: true)
!281 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !275, line: 40, baseType: !7, size: 32, elements: !282)
!282 = !{!283, !284, !285, !286}
!283 = !DIEnumerator(name: "INT_POL_BUS", value: 0, isUnsigned: true)
!284 = !DIEnumerator(name: "INT_POL_ACTHI", value: 1, isUnsigned: true)
!285 = !DIEnumerator(name: "INT_POL_RSVD", value: 2, isUnsigned: true)
!286 = !DIEnumerator(name: "INT_POL_ACTLO", value: 3, isUnsigned: true)
!287 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !275, line: 39, baseType: !7, size: 32, elements: !288)
!288 = !{!289, !290, !291, !292}
!289 = !DIEnumerator(name: "INT_TYPE_INT", value: 0, isUnsigned: true)
!290 = !DIEnumerator(name: "INT_TYPE_NMI", value: 1, isUnsigned: true)
!291 = !DIEnumerator(name: "INT_TYPE_SMI", value: 2, isUnsigned: true)
!292 = !DIEnumerator(name: "INT_TYPE_EXT", value: 3, isUnsigned: true)
!293 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !112, line: 66, baseType: !7, size: 32, elements: !294)
!294 = !{!295, !296, !297}
!295 = !DIEnumerator(name: "APERIODIC", value: 0, isUnsigned: true)
!296 = !DIEnumerator(name: "SPORADIC", value: 1, isUnsigned: true)
!297 = !DIEnumerator(name: "PERIODIC", value: 2, isUnsigned: true)
!298 = !{!299, !300, !137, !321, !29, !322, !349, !33, !66, !328, !50, !537, !338, !551, !343, !219}
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_fiber_t", file: !6, line: 104, baseType: !302)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_fiber", file: !6, line: 70, size: 1216, elements: !303)
!303 = !{!304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "rsp", scope: !302, file: !6, line: 71, baseType: !29, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !302, file: !6, line: 72, baseType: !33, size: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_state_offset", scope: !302, file: !6, line: 73, baseType: !35, size: 16, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !302, file: !6, line: 75, baseType: !38, size: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !302, file: !6, line: 76, baseType: !31, size: 64, offset: 256)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !302, file: !6, line: 78, baseType: !41, size: 32, offset: 320)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "f_status", scope: !302, file: !6, line: 79, baseType: !45, size: 32, offset: 352)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "vc", scope: !302, file: !6, line: 82, baseType: !47, size: 64, offset: 384)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "is_idle", scope: !302, file: !6, line: 83, baseType: !50, size: 32, offset: 448)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "wait_queue", scope: !302, file: !6, line: 91, baseType: !206, size: 128, offset: 512)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "wait_node", scope: !302, file: !6, line: 92, baseType: !206, size: 128, offset: 640)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "num_wait", scope: !302, file: !6, line: 93, baseType: !50, size: 32, offset: 768)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "sched_node", scope: !302, file: !6, line: 97, baseType: !206, size: 128, offset: 832)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !302, file: !6, line: 99, baseType: !62, size: 64, offset: 960)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !302, file: !6, line: 100, baseType: !33, size: 64, offset: 1024)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !302, file: !6, line: 101, baseType: !66, size: 64, offset: 1088)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "is_done", scope: !302, file: !6, line: 103, baseType: !70, size: 8, offset: 1152)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !30, line: 45, baseType: !31)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_info", file: !324, line: 183, size: 59840, elements: !325)
!324 = !DIFile(filename: "include/nautilus/nautilus.h", directory: "/home/sgi9754/nautilus-cs446")
!325 = !{!326, !443, !479, !480, !481, !482, !498, !509, !510, !511, !514, !517, !520, !532, !542, !545, !548}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "cpus", scope: !323, file: !324, line: 185, baseType: !327, size: 16384)
!327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 16384, elements: !123)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpu", file: !330, line: 74, size: 1600, elements: !331)
!330 = !DIFile(filename: "include/nautilus/smp.h", directory: "/home/sgi9754/nautilus-cs446")
!331 = !{!332, !333, !334, !335, !336, !337, !348, !350, !351, !352, !353, !354, !355, !357, !379, !380, !381, !384, !392, !405, !406, !413, !420, !429, !434}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "cur_thread", scope: !329, file: !330, line: 75, baseType: !219, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_nesting_level", scope: !329, file: !330, line: 78, baseType: !35, size: 16, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_disable_level", scope: !329, file: !330, line: 81, baseType: !35, size: 16, offset: 80)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_count", scope: !329, file: !330, line: 85, baseType: !29, size: 64, offset: 128)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "exception_count", scope: !329, file: !330, line: 86, baseType: !29, size: 64, offset: 192)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "f_state", scope: !329, file: !330, line: 88, baseType: !338, size: 64, offset: 256)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_fiber_percpu_state", file: !186, line: 60, size: 384, elements: !340)
!340 = !{!341, !342, !345, !346, !347}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !339, file: !186, line: 61, baseType: !41, size: 32)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "fiber_thread", scope: !339, file: !186, line: 62, baseType: !343, size: 64, offset: 64)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_thread_t", file: !16, line: 233, baseType: !220)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "curr_fiber", scope: !339, file: !186, line: 63, baseType: !300, size: 64, offset: 128)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "idle_fiber", scope: !339, file: !186, line: 64, baseType: !300, size: 64, offset: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "f_sched_queue", scope: !339, file: !186, line: 65, baseType: !206, size: 128, offset: 256)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !329, file: !330, line: 89, baseType: !349, size: 32, offset: 320)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpu_id_t", file: !330, line: 58, baseType: !43)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "lapic_id", scope: !329, file: !330, line: 90, baseType: !43, size: 32, offset: 352)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !329, file: !330, line: 91, baseType: !70, size: 8, offset: 384)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "is_bsp", scope: !329, file: !330, line: 92, baseType: !70, size: 8, offset: 392)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_sig", scope: !329, file: !330, line: 93, baseType: !43, size: 32, offset: 416)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "feat_flags", scope: !329, file: !330, line: 94, baseType: !43, size: 32, offset: 448)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "booted", scope: !329, file: !330, line: 96, baseType: !356, size: 8, offset: 480)
!356 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !70)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "apic", scope: !329, file: !330, line: 98, baseType: !358, size: 64, offset: 512)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apic_dev", file: !268, line: 227, size: 768, elements: !360)
!360 = !{!361, !363, !365, !366, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !359, file: !268, line: 228, baseType: !362, size: 32)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "apic_mode_t", file: !268, line: 225, baseType: !267)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !359, file: !268, line: 229, baseType: !364, size: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "ulong_t", file: !30, line: 43, baseType: !31)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !359, file: !268, line: 230, baseType: !70, size: 8, offset: 128)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !359, file: !268, line: 231, baseType: !367, size: 32, offset: 160)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_t", file: !30, line: 37, baseType: !7)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "spur_int_cnt", scope: !359, file: !268, line: 232, baseType: !29, size: 64, offset: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "err_int_cnt", scope: !359, file: !268, line: 233, baseType: !29, size: 64, offset: 256)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "bus_freq_hz", scope: !359, file: !268, line: 234, baseType: !29, size: 64, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "ps_per_tick", scope: !359, file: !268, line: 235, baseType: !29, size: 64, offset: 384)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "cycles_per_us", scope: !359, file: !268, line: 236, baseType: !29, size: 64, offset: 448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "cycles_per_tick", scope: !359, file: !268, line: 237, baseType: !29, size: 64, offset: 512)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !359, file: !268, line: 238, baseType: !70, size: 8, offset: 576)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "current_ticks", scope: !359, file: !268, line: 239, baseType: !43, size: 32, offset: 608)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "timer_count", scope: !359, file: !268, line: 240, baseType: !29, size: 64, offset: 640)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "in_timer_interrupt", scope: !359, file: !268, line: 241, baseType: !50, size: 32, offset: 704)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "in_kick_interrupt", scope: !359, file: !268, line: 242, baseType: !50, size: 32, offset: 736)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "system", scope: !329, file: !330, line: 100, baseType: !322, size: 64, offset: 576)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !329, file: !330, line: 102, baseType: !41, size: 32, offset: 640)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "sched_state", scope: !329, file: !330, line: 104, baseType: !382, size: 64, offset: 704)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_sched_percpu_state", file: !330, line: 104, flags: DIFlagFwdDecl)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "xcall_q", scope: !329, file: !330, line: 106, baseType: !385, size: 64, offset: 768)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_queue_t", file: !387, line: 42, baseType: !388)
!387 = !DIFile(filename: "include/nautilus/queue.h", directory: "/home/sgi9754/nautilus-cs446")
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_queue", file: !387, line: 33, size: 192, elements: !389)
!389 = !{!390, !391}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !388, file: !387, line: 34, baseType: !206, size: 128)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !388, file: !387, line: 35, baseType: !41, size: 32, offset: 128)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "xcall_nowait_info", scope: !329, file: !330, line: 107, baseType: !393, size: 320, offset: 832)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_xcall", file: !330, line: 61, size: 320, elements: !394)
!394 = !{!395, !400, !401, !403, !404}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "xcall_node", scope: !393, file: !330, line: 62, baseType: !396, size: 128)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_queue_entry_t", file: !387, line: 43, baseType: !397)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_queue_entry", file: !387, line: 38, size: 128, elements: !398)
!398 = !{!399}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !397, file: !387, line: 39, baseType: !206, size: 128)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !393, file: !330, line: 63, baseType: !33, size: 64, offset: 128)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !393, file: !330, line: 64, baseType: !402, size: 64, offset: 192)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_xcall_func_t", file: !330, line: 57, baseType: !257)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "xcall_done", scope: !393, file: !330, line: 65, baseType: !70, size: 8, offset: 256)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "has_waiter", scope: !393, file: !330, line: 66, baseType: !70, size: 8, offset: 264)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_khz", scope: !329, file: !330, line: 109, baseType: !364, size: 64, offset: 1152)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "tp", scope: !329, file: !330, line: 112, baseType: !407, size: 64, offset: 1216)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_topo_params", file: !409, line: 94, size: 64, elements: !410)
!409 = !DIFile(filename: "include/nautilus/numa.h", directory: "/home/sgi9754/nautilus-cs446")
!410 = !{!411, !412}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "smt_bits", scope: !408, file: !409, line: 95, baseType: !43, size: 32)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "core_bits", scope: !408, file: !409, line: 96, baseType: !43, size: 32, offset: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "coord", scope: !329, file: !330, line: 113, baseType: !414, size: 64, offset: 1280)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_cpu_coords", file: !409, line: 99, size: 96, elements: !416)
!416 = !{!417, !418, !419}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "smt_id", scope: !415, file: !409, line: 100, baseType: !43, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "core_id", scope: !415, file: !409, line: 101, baseType: !43, size: 32, offset: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_id", scope: !415, file: !409, line: 102, baseType: !43, size: 32, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !329, file: !330, line: 114, baseType: !421, size: 64, offset: 1344)
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "numa_domain", file: !409, line: 34, size: 448, elements: !423)
!423 = !{!424, !425, !426, !427, !428}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !422, file: !409, line: 35, baseType: !43, size: 32)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "addr_space_size", scope: !422, file: !409, line: 36, baseType: !29, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !422, file: !409, line: 37, baseType: !43, size: 32, offset: 128)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "regions", scope: !422, file: !409, line: 39, baseType: !206, size: 128, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !422, file: !409, line: 42, baseType: !206, size: 128, offset: 320)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "kmem", scope: !329, file: !330, line: 116, baseType: !430, size: 128, offset: 1408)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kmem_data", file: !431, line: 84, size: 128, elements: !432)
!431 = !DIFile(filename: "include/nautilus/mm.h", directory: "/home/sgi9754/nautilus-cs446")
!432 = !{!433}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "ordered_regions", scope: !430, file: !431, line: 85, baseType: !206, size: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "rand", scope: !329, file: !330, line: 119, baseType: !435, size: 64, offset: 1536)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_rand_info", file: !437, line: 33, size: 256, elements: !438)
!437 = !DIFile(filename: "include/nautilus/random.h", directory: "/home/sgi9754/nautilus-cs446")
!438 = !{!439, !440, !441, !442}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !436, file: !437, line: 34, baseType: !41, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !436, file: !437, line: 35, baseType: !29, size: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !436, file: !437, line: 36, baseType: !29, size: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !436, file: !437, line: 37, baseType: !29, size: 64, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "ioapics", scope: !323, file: !324, line: 186, baseType: !444, size: 1024, offset: 16384)
!444 = !DICompositeType(tag: DW_TAG_array_type, baseType: !445, size: 1024, elements: !477)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ioapic", file: !447, line: 113, size: 320, elements: !448)
!447 = !DIFile(filename: "include/dev/ioapic.h", directory: "/home/sgi9754/nautilus-cs446")
!448 = !{!449, !450, !451, !452, !454, !455, !476}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !446, file: !447, line: 114, baseType: !70, size: 8)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !446, file: !447, line: 115, baseType: !70, size: 8, offset: 8)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "usable", scope: !446, file: !447, line: 116, baseType: !70, size: 8, offset: 16)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !446, file: !447, line: 117, baseType: !453, size: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_t", file: !30, line: 64, baseType: !364)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "num_entries", scope: !446, file: !447, line: 119, baseType: !70, size: 8, offset: 128)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !446, file: !447, line: 120, baseType: !456, size: 64, offset: 192)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iored_entry", file: !447, line: 101, size: 192, elements: !458)
!458 = !{!459, !460, !475}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !457, file: !447, line: 103, baseType: !70, size: 8)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "boot_info", scope: !457, file: !447, line: 106, baseType: !461, size: 64, offset: 64)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_int_entry", file: !275, line: 43, size: 256, elements: !463)
!463 = !{!464, !466, !468, !470, !471, !472, !473, !474}
!464 = !DIDerivedType(tag: DW_TAG_member, name: "trig_mode", scope: !462, file: !275, line: 44, baseType: !465, size: 32)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_trig_t", file: !275, line: 41, baseType: !274)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "polarity", scope: !462, file: !275, line: 45, baseType: !467, size: 32, offset: 32)
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_pol_t", file: !275, line: 40, baseType: !281)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !462, file: !275, line: 46, baseType: !469, size: 32, offset: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_type_t", file: !275, line: 39, baseType: !287)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "src_bus_id", scope: !462, file: !275, line: 47, baseType: !70, size: 8, offset: 96)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "src_bus_irq", scope: !462, file: !275, line: 48, baseType: !70, size: 8, offset: 104)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ioapic_intin", scope: !462, file: !275, line: 49, baseType: !70, size: 8, offset: 112)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ioapic_id", scope: !462, file: !275, line: 50, baseType: !70, size: 8, offset: 120)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "elm", scope: !462, file: !275, line: 52, baseType: !206, size: 128, offset: 128)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "actual_irq", scope: !457, file: !447, line: 109, baseType: !70, size: 8, offset: 128)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "first_hrt_entry", scope: !446, file: !447, line: 122, baseType: !7, size: 32, offset: 256)
!477 = !{!478}
!478 = !DISubrange(count: 16)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "num_cpus", scope: !323, file: !324, line: 188, baseType: !43, size: 32, offset: 17408)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "num_ioapics", scope: !323, file: !324, line: 189, baseType: !43, size: 32, offset: 17440)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !323, file: !324, line: 191, baseType: !29, size: 64, offset: 17472)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "core_barrier", scope: !323, file: !324, line: 194, baseType: !483, size: 64, offset: 17536)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_barrier_t", file: !485, line: 34, baseType: !486)
!485 = !DIFile(filename: "include/nautilus/barrier.h", directory: "/home/sgi9754/nautilus-cs446")
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_barrier", file: !485, line: 36, size: 1024, align: 512, elements: !487)
!487 = !{!488, !489, !490, !491, !492, !496}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !486, file: !485, line: 37, baseType: !41, size: 32)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "remaining", scope: !486, file: !485, line: 39, baseType: !7, size: 32, offset: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "init_count", scope: !486, file: !485, line: 40, baseType: !7, size: 32, offset: 64)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !486, file: !485, line: 42, baseType: !70, size: 8, offset: 96)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !486, file: !485, line: 44, baseType: !493, size: 416, offset: 104)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 416, elements: !494)
!494 = !{!495}
!495 = !DISubrange(count: 52)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !486, file: !485, line: 47, baseType: !497, size: 32, offset: 520)
!497 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !323, file: !324, line: 196, baseType: !499, size: 448, offset: 17600)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_mem_info", file: !500, line: 83, size: 448, elements: !501)
!500 = !DIFile(filename: "include/nautilus/paging.h", directory: "/home/sgi9754/nautilus-cs446")
!501 = !{!502, !504, !505, !506, !507, !508}
!502 = !DIDerivedType(tag: DW_TAG_member, name: "page_map", scope: !499, file: !500, line: 84, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "pm_start", scope: !499, file: !500, line: 85, baseType: !453, size: 64, offset: 64)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "pm_end", scope: !499, file: !500, line: 86, baseType: !453, size: 64, offset: 128)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "phys_mem_avail", scope: !499, file: !500, line: 87, baseType: !364, size: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "npages", scope: !499, file: !500, line: 88, baseType: !364, size: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "mem_zone_list", scope: !499, file: !500, line: 90, baseType: !206, size: 128, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_id", scope: !323, file: !324, line: 198, baseType: !43, size: 32, offset: 18048)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "pic_mode_enabled", scope: !323, file: !324, line: 200, baseType: !70, size: 8, offset: 18080)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "pci", scope: !323, file: !324, line: 202, baseType: !512, size: 64, offset: 18112)
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "pci_info", file: !324, line: 202, flags: DIFlagFwdDecl)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "hpet", scope: !323, file: !324, line: 203, baseType: !515, size: 64, offset: 18176)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !516, size: 64)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "hpet_dev", file: !324, line: 178, flags: DIFlagFwdDecl)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "mb_info", scope: !323, file: !324, line: 205, baseType: !518, size: 64, offset: 18240)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !519, size: 64)
!519 = !DICompositeType(tag: DW_TAG_structure_type, name: "multiboot_info", file: !324, line: 205, flags: DIFlagFwdDecl)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "int_info", scope: !323, file: !324, line: 207, baseType: !521, size: 33024, offset: 18304)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_int_info", file: !324, line: 171, size: 33024, elements: !522)
!522 = !{!523, !524, !525}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "int_list", scope: !521, file: !324, line: 172, baseType: !206, size: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "bus_list", scope: !521, file: !324, line: 173, baseType: !206, size: 128, offset: 128)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "irq_map", scope: !521, file: !324, line: 175, baseType: !526, size: 32768, offset: 256)
!526 = !DICompositeType(tag: DW_TAG_array_type, baseType: !527, size: 32768, elements: !123)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "irq_mapping", file: !324, line: 164, size: 128, elements: !528)
!528 = !{!529, !530, !531}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ioapic", scope: !527, file: !324, line: 165, baseType: !445, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !527, file: !324, line: 166, baseType: !70, size: 8, offset: 64)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "assigned", scope: !527, file: !324, line: 167, baseType: !70, size: 8, offset: 72)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "locality_info", scope: !323, file: !324, line: 209, baseType: !533, size: 8320, offset: 51328)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_locality_info", file: !409, line: 75, size: 8320, elements: !534)
!534 = !{!535, !536, !538}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "num_domains", scope: !533, file: !409, line: 76, baseType: !43, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "numa_matrix", scope: !533, file: !409, line: 77, baseType: !537, size: 64, offset: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "domains", scope: !533, file: !409, line: 79, baseType: !539, size: 8192, offset: 128)
!539 = !DICompositeType(tag: DW_TAG_array_type, baseType: !421, size: 8192, elements: !540)
!540 = !{!541}
!541 = !DISubrange(count: 128)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "pmc_info", scope: !323, file: !324, line: 211, baseType: !543, size: 64, offset: 59648)
!543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !544, size: 64)
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "pmc_info", file: !324, line: 180, flags: DIFlagFwdDecl)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "linker_info", scope: !323, file: !324, line: 213, baseType: !546, size: 64, offset: 59712)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_link_info", file: !324, line: 181, flags: DIFlagFwdDecl)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "prog_info", scope: !323, file: !324, line: 215, baseType: !549, size: 64, offset: 59776)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_prog_info", file: !324, line: 182, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!552 = !{!"clang version 8.0.0 (tags/RELEASE_800/final)"}
!553 = !{i32 2, !"Dwarf Version", i32 4}
!554 = !{i32 2, !"Debug Info Version", i32 3}
!555 = !{i32 1, !"wchar_size", i32 4}
!556 = !{i32 1, !"Code Model", i32 4}
!557 = distinct !DISubprogram(name: "handle_fibers9", scope: !3, file: !3, line: 609, type: !141, scopeLine: 610, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !558)
!558 = !{!559, !560}
!559 = !DILocalVariable(name: "buf", arg: 1, scope: !557, file: !3, line: 609, type: !137)
!560 = !DILocalVariable(name: "priv", arg: 2, scope: !557, file: !3, line: 609, type: !33)
!561 = !DILocation(line: 609, column: 24, scope: !557)
!562 = !DILocation(line: 609, column: 36, scope: !557)
!563 = !DILocation(line: 527, column: 3, scope: !564, inlinedAt: !569)
!564 = distinct !DISubprogram(name: "test_fiber_routine_2", scope: !3, file: !3, line: 525, type: !565, scopeLine: 526, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !567)
!565 = !DISubroutineType(types: !566)
!566 = !{!50}
!567 = !{!568}
!568 = !DILocalVariable(name: "f_orig", scope: !564, file: !3, line: 527, type: !24)
!569 = distinct !DILocation(line: 611, column: 3, scope: !557)
!570 = !DILocation(line: 258, column: 26, scope: !571, inlinedAt: !579)
!571 = distinct !DILexicalBlock(scope: !572, file: !16, line: 258, column: 26)
!572 = distinct !DILexicalBlock(scope: !573, file: !16, line: 258, column: 26)
!573 = distinct !DISubprogram(name: "get_cur_thread", scope: !16, file: !16, line: 256, type: !574, scopeLine: 257, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !576)
!574 = !DISubroutineType(types: !575)
!575 = !{!72}
!576 = !{!577, !578}
!577 = !DILocalVariable(name: "__r", scope: !572, file: !16, line: 258, type: !86)
!578 = !DILocalVariable(name: "__r", scope: !571, file: !16, line: 258, type: !86)
!579 = distinct !DILocation(line: 528, column: 8, scope: !564, inlinedAt: !569)
!580 = !{i32 -2147273830}
!581 = !DILocation(line: 258, column: 26, scope: !572, inlinedAt: !579)
!582 = !DILocation(line: 528, column: 26, scope: !564, inlinedAt: !569)
!583 = !DILocation(line: 528, column: 6, scope: !564, inlinedAt: !569)
!584 = !DILocation(line: 529, column: 3, scope: !564, inlinedAt: !569)
!585 = !DILocation(line: 527, column: 15, scope: !564, inlinedAt: !569)
!586 = !DILocation(line: 530, column: 3, scope: !564, inlinedAt: !569)
!587 = !DILocation(line: 532, column: 1, scope: !564, inlinedAt: !569)
!588 = !DILocation(line: 612, column: 3, scope: !557)
!589 = distinct !DISubprogram(name: "fiber_routine3", scope: !3, file: !3, line: 310, type: !64, scopeLine: 311, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !590)
!590 = !{!591, !592, !593, !594, !595}
!591 = !DILocalVariable(name: "i", arg: 1, scope: !589, file: !3, line: 310, type: !33)
!592 = !DILocalVariable(name: "o", arg: 2, scope: !589, file: !3, line: 310, type: !66)
!593 = !DILocalVariable(name: "a", scope: !589, file: !3, line: 313, type: !50)
!594 = !DILocalVariable(name: "f_new", scope: !589, file: !3, line: 314, type: !24)
!595 = !DILocalVariable(name: "curr", scope: !596, file: !3, line: 318, type: !24)
!596 = distinct !DILexicalBlock(scope: !589, file: !3, line: 315, column: 15)
!597 = !DILocation(line: 310, column: 27, scope: !589)
!598 = !DILocation(line: 310, column: 37, scope: !589)
!599 = !DILocation(line: 312, column: 19, scope: !589)
!600 = !DILocation(line: 312, column: 3, scope: !589)
!601 = !DILocation(line: 313, column: 7, scope: !589)
!602 = !DILocation(line: 316, column: 13, scope: !596)
!603 = !DILocation(line: 314, column: 15, scope: !589)
!604 = !DILocation(line: 318, column: 17, scope: !596)
!605 = !DILocation(line: 319, column: 5, scope: !596)
!606 = !DILocation(line: 322, column: 3, scope: !589)
!607 = !DILocation(line: 323, column: 1, scope: !589)
!608 = distinct !DISubprogram(name: "handle_fibers8", scope: !3, file: !3, line: 602, type: !141, scopeLine: 603, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !609)
!609 = !{!610, !611}
!610 = !DILocalVariable(name: "buf", arg: 1, scope: !608, file: !3, line: 602, type: !137)
!611 = !DILocalVariable(name: "priv", arg: 2, scope: !608, file: !3, line: 602, type: !33)
!612 = !DILocation(line: 602, column: 24, scope: !608)
!613 = !DILocation(line: 602, column: 36, scope: !608)
!614 = !DILocation(line: 518, column: 3, scope: !615, inlinedAt: !618)
!615 = distinct !DISubprogram(name: "test_fiber_routine", scope: !3, file: !3, line: 516, type: !565, scopeLine: 517, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !616)
!616 = !{!617}
!617 = !DILocalVariable(name: "f_orig", scope: !615, file: !3, line: 518, type: !24)
!618 = distinct !DILocation(line: 604, column: 3, scope: !608)
!619 = !DILocation(line: 258, column: 26, scope: !571, inlinedAt: !620)
!620 = distinct !DILocation(line: 519, column: 8, scope: !615, inlinedAt: !618)
!621 = !DILocation(line: 258, column: 26, scope: !572, inlinedAt: !620)
!622 = !DILocation(line: 519, column: 26, scope: !615, inlinedAt: !618)
!623 = !DILocation(line: 519, column: 6, scope: !615, inlinedAt: !618)
!624 = !DILocation(line: 520, column: 3, scope: !615, inlinedAt: !618)
!625 = !DILocation(line: 518, column: 15, scope: !615, inlinedAt: !618)
!626 = !DILocation(line: 521, column: 3, scope: !615, inlinedAt: !618)
!627 = !DILocation(line: 523, column: 1, scope: !615, inlinedAt: !618)
!628 = !DILocation(line: 605, column: 3, scope: !608)
!629 = distinct !DISubprogram(name: "fiber_routine1", scope: !3, file: !3, line: 290, type: !64, scopeLine: 291, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !630)
!630 = !{!631, !632, !633, !634, !635, !637}
!631 = !DILocalVariable(name: "i", arg: 1, scope: !629, file: !3, line: 290, type: !33)
!632 = !DILocalVariable(name: "o", arg: 2, scope: !629, file: !3, line: 290, type: !66)
!633 = !DILocalVariable(name: "a", scope: !629, file: !3, line: 293, type: !50)
!634 = !DILocalVariable(name: "f_new", scope: !629, file: !3, line: 294, type: !24)
!635 = !DILocalVariable(name: "curr", scope: !636, file: !3, line: 298, type: !24)
!636 = distinct !DILexicalBlock(scope: !629, file: !3, line: 295, column: 15)
!637 = !DILocalVariable(name: "new", scope: !638, file: !3, line: 300, type: !24)
!638 = distinct !DILexicalBlock(scope: !639, file: !3, line: 299, column: 14)
!639 = distinct !DILexicalBlock(scope: !636, file: !3, line: 299, column: 8)
!640 = !DILocation(line: 290, column: 27, scope: !629)
!641 = !DILocation(line: 290, column: 37, scope: !629)
!642 = !DILocation(line: 292, column: 19, scope: !629)
!643 = !DILocation(line: 292, column: 3, scope: !629)
!644 = !DILocation(line: 293, column: 7, scope: !629)
!645 = !DILocation(line: 296, column: 13, scope: !636)
!646 = !DILocation(line: 294, column: 15, scope: !629)
!647 = !DILocation(line: 298, column: 17, scope: !636)
!648 = !DILocation(line: 299, column: 8, scope: !639)
!649 = !DILocation(line: 299, column: 8, scope: !636)
!650 = !DILocation(line: 300, column: 7, scope: !638)
!651 = !DILocation(line: 300, column: 19, scope: !638)
!652 = !DILocation(line: 301, column: 7, scope: !638)
!653 = !DILocation(line: 303, column: 5, scope: !639)
!654 = !DILocation(line: 304, column: 5, scope: !636)
!655 = !DILocation(line: 307, column: 3, scope: !629)
!656 = !DILocation(line: 308, column: 1, scope: !629)
!657 = distinct !DISubprogram(name: "fiber_routine2", scope: !3, file: !3, line: 282, type: !64, scopeLine: 283, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !658)
!658 = !{!659, !660}
!659 = !DILocalVariable(name: "i", arg: 1, scope: !657, file: !3, line: 282, type: !33)
!660 = !DILocalVariable(name: "o", arg: 2, scope: !657, file: !3, line: 282, type: !66)
!661 = !DILocation(line: 282, column: 27, scope: !657)
!662 = !DILocation(line: 282, column: 37, scope: !657)
!663 = !DILocation(line: 284, column: 19, scope: !657)
!664 = !DILocation(line: 284, column: 3, scope: !657)
!665 = !DILocation(line: 286, column: 3, scope: !657)
!666 = !DILocation(line: 287, column: 1, scope: !657)
!667 = distinct !DISubprogram(name: "handle_fibers7", scope: !3, file: !3, line: 595, type: !141, scopeLine: 596, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !668)
!668 = !{!669, !670}
!669 = !DILocalVariable(name: "buf", arg: 1, scope: !667, file: !3, line: 595, type: !137)
!670 = !DILocalVariable(name: "priv", arg: 2, scope: !667, file: !3, line: 595, type: !33)
!671 = !DILocation(line: 595, column: 24, scope: !667)
!672 = !DILocation(line: 595, column: 36, scope: !667)
!673 = !DILocation(line: 509, column: 3, scope: !674, inlinedAt: !677)
!674 = distinct !DISubprogram(name: "test_fiber_fork_join", scope: !3, file: !3, line: 507, type: !565, scopeLine: 508, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !675)
!675 = !{!676}
!676 = !DILocalVariable(name: "f_orig", scope: !674, file: !3, line: 509, type: !24)
!677 = distinct !DILocation(line: 597, column: 3, scope: !667)
!678 = !DILocation(line: 258, column: 26, scope: !571, inlinedAt: !679)
!679 = distinct !DILocation(line: 510, column: 8, scope: !674, inlinedAt: !677)
!680 = !DILocation(line: 258, column: 26, scope: !572, inlinedAt: !679)
!681 = !DILocation(line: 510, column: 26, scope: !674, inlinedAt: !677)
!682 = !DILocation(line: 510, column: 6, scope: !674, inlinedAt: !677)
!683 = !DILocation(line: 511, column: 3, scope: !674, inlinedAt: !677)
!684 = !DILocation(line: 509, column: 15, scope: !674, inlinedAt: !677)
!685 = !DILocation(line: 512, column: 3, scope: !674, inlinedAt: !677)
!686 = !DILocation(line: 514, column: 1, scope: !674, inlinedAt: !677)
!687 = !DILocation(line: 598, column: 3, scope: !667)
!688 = distinct !DISubprogram(name: "fiber_fork_join", scope: !3, file: !3, line: 263, type: !64, scopeLine: 264, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !689)
!689 = !{!690, !691, !692, !693, !694}
!690 = !DILocalVariable(name: "i", arg: 1, scope: !688, file: !3, line: 263, type: !33)
!691 = !DILocalVariable(name: "o", arg: 2, scope: !688, file: !3, line: 263, type: !66)
!692 = !DILocalVariable(name: "a", scope: !688, file: !3, line: 266, type: !50)
!693 = !DILocalVariable(name: "f_new", scope: !688, file: !3, line: 267, type: !24)
!694 = !DILocalVariable(name: "f_curr", scope: !688, file: !3, line: 274, type: !24)
!695 = !DILocation(line: 263, column: 28, scope: !688)
!696 = !DILocation(line: 263, column: 38, scope: !688)
!697 = !DILocation(line: 265, column: 19, scope: !688)
!698 = !DILocation(line: 265, column: 3, scope: !688)
!699 = !DILocation(line: 266, column: 7, scope: !688)
!700 = !DILocation(line: 268, column: 11, scope: !688)
!701 = !DILocation(line: 267, column: 15, scope: !688)
!702 = !DILocation(line: 269, column: 6, scope: !703)
!703 = distinct !DILexicalBlock(scope: !688, file: !3, line: 269, column: 6)
!704 = !DILocation(line: 269, column: 6, scope: !688)
!705 = !DILocation(line: 270, column: 5, scope: !706)
!706 = distinct !DILexicalBlock(scope: !703, file: !3, line: 269, column: 12)
!707 = !DILocation(line: 271, column: 3, scope: !706)
!708 = !DILocation(line: 274, column: 15, scope: !688)
!709 = !DILocation(line: 276, column: 5, scope: !710)
!710 = distinct !DILexicalBlock(scope: !688, file: !3, line: 275, column: 15)
!711 = !DILocation(line: 279, column: 3, scope: !688)
!712 = !DILocation(line: 280, column: 1, scope: !688)
!713 = distinct !DISubprogram(name: "handle_fibers6", scope: !3, file: !3, line: 588, type: !141, scopeLine: 589, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !714)
!714 = !{!715, !716}
!715 = !DILocalVariable(name: "buf", arg: 1, scope: !713, file: !3, line: 588, type: !137)
!716 = !DILocalVariable(name: "priv", arg: 2, scope: !713, file: !3, line: 588, type: !33)
!717 = !DILocation(line: 588, column: 24, scope: !713)
!718 = !DILocation(line: 588, column: 36, scope: !713)
!719 = !DILocation(line: 500, column: 3, scope: !720, inlinedAt: !723)
!720 = distinct !DISubprogram(name: "test_fiber_fork", scope: !3, file: !3, line: 498, type: !565, scopeLine: 499, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !721)
!721 = !{!722}
!722 = !DILocalVariable(name: "f_orig", scope: !720, file: !3, line: 500, type: !24)
!723 = distinct !DILocation(line: 590, column: 3, scope: !713)
!724 = !DILocation(line: 258, column: 26, scope: !571, inlinedAt: !725)
!725 = distinct !DILocation(line: 501, column: 8, scope: !720, inlinedAt: !723)
!726 = !DILocation(line: 258, column: 26, scope: !572, inlinedAt: !725)
!727 = !DILocation(line: 501, column: 26, scope: !720, inlinedAt: !723)
!728 = !DILocation(line: 501, column: 6, scope: !720, inlinedAt: !723)
!729 = !DILocation(line: 502, column: 3, scope: !720, inlinedAt: !723)
!730 = !DILocation(line: 500, column: 15, scope: !720, inlinedAt: !723)
!731 = !DILocation(line: 503, column: 3, scope: !720, inlinedAt: !723)
!732 = !DILocation(line: 505, column: 1, scope: !720, inlinedAt: !723)
!733 = !DILocation(line: 591, column: 3, scope: !713)
!734 = distinct !DISubprogram(name: "fiber_fork", scope: !3, file: !3, line: 249, type: !64, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !735)
!735 = !{!736, !737, !738, !739}
!736 = !DILocalVariable(name: "i", arg: 1, scope: !734, file: !3, line: 249, type: !33)
!737 = !DILocalVariable(name: "o", arg: 2, scope: !734, file: !3, line: 249, type: !66)
!738 = !DILocalVariable(name: "a", scope: !734, file: !3, line: 252, type: !50)
!739 = !DILocalVariable(name: "f_new", scope: !734, file: !3, line: 253, type: !24)
!740 = !DILocation(line: 249, column: 23, scope: !734)
!741 = !DILocation(line: 249, column: 33, scope: !734)
!742 = !DILocation(line: 251, column: 19, scope: !734)
!743 = !DILocation(line: 251, column: 3, scope: !734)
!744 = !DILocation(line: 252, column: 7, scope: !734)
!745 = !DILocation(line: 254, column: 11, scope: !734)
!746 = !DILocation(line: 253, column: 15, scope: !734)
!747 = !DILocation(line: 257, column: 5, scope: !748)
!748 = distinct !DILexicalBlock(scope: !734, file: !3, line: 255, column: 15)
!749 = !DILocation(line: 260, column: 3, scope: !734)
!750 = !DILocation(line: 261, column: 1, scope: !734)
!751 = distinct !DISubprogram(name: "handle_fibers5", scope: !3, file: !3, line: 581, type: !141, scopeLine: 582, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !752)
!752 = !{!753, !754}
!753 = !DILocalVariable(name: "buf", arg: 1, scope: !751, file: !3, line: 581, type: !137)
!754 = !DILocalVariable(name: "priv", arg: 2, scope: !751, file: !3, line: 581, type: !33)
!755 = !DILocation(line: 581, column: 24, scope: !751)
!756 = !DILocation(line: 581, column: 36, scope: !751)
!757 = !DILocation(line: 491, column: 3, scope: !758, inlinedAt: !761)
!758 = distinct !DISubprogram(name: "test_fiber_join", scope: !3, file: !3, line: 489, type: !565, scopeLine: 490, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !759)
!759 = !{!760}
!760 = !DILocalVariable(name: "f_outer_join", scope: !758, file: !3, line: 491, type: !24)
!761 = distinct !DILocation(line: 583, column: 3, scope: !751)
!762 = !DILocation(line: 258, column: 26, scope: !571, inlinedAt: !763)
!763 = distinct !DILocation(line: 492, column: 8, scope: !758, inlinedAt: !761)
!764 = !DILocation(line: 258, column: 26, scope: !572, inlinedAt: !763)
!765 = !DILocation(line: 492, column: 26, scope: !758, inlinedAt: !761)
!766 = !DILocation(line: 492, column: 6, scope: !758, inlinedAt: !761)
!767 = !DILocation(line: 493, column: 3, scope: !758, inlinedAt: !761)
!768 = !DILocation(line: 491, column: 15, scope: !758, inlinedAt: !761)
!769 = !DILocation(line: 494, column: 3, scope: !758, inlinedAt: !761)
!770 = !DILocation(line: 496, column: 1, scope: !758, inlinedAt: !761)
!771 = !DILocation(line: 584, column: 3, scope: !751)
!772 = distinct !DISubprogram(name: "fiber_outer_join", scope: !3, file: !3, line: 103, type: !64, scopeLine: 104, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !773)
!773 = !{!774, !775, !776, !777}
!774 = !DILocalVariable(name: "i", arg: 1, scope: !772, file: !3, line: 103, type: !33)
!775 = !DILocalVariable(name: "o", arg: 2, scope: !772, file: !3, line: 103, type: !66)
!776 = !DILocalVariable(name: "a", scope: !772, file: !3, line: 106, type: !50)
!777 = !DILocalVariable(name: "f_inner_join", scope: !778, file: !3, line: 109, type: !24)
!778 = distinct !DILexicalBlock(scope: !772, file: !3, line: 107, column: 15)
!779 = !DILocation(line: 103, column: 29, scope: !772)
!780 = !DILocation(line: 103, column: 39, scope: !772)
!781 = !DILocation(line: 105, column: 19, scope: !772)
!782 = !DILocation(line: 105, column: 3, scope: !772)
!783 = !DILocation(line: 106, column: 7, scope: !772)
!784 = !DILocation(line: 108, column: 5, scope: !778)
!785 = !DILocation(line: 109, column: 5, scope: !778)
!786 = !DILocation(line: 109, column: 17, scope: !778)
!787 = !DILocation(line: 110, column: 5, scope: !778)
!788 = !DILocation(line: 111, column: 19, scope: !778)
!789 = !DILocation(line: 111, column: 5, scope: !778)
!790 = !DILocation(line: 113, column: 3, scope: !772)
!791 = !DILocation(line: 114, column: 3, scope: !772)
!792 = !DILocation(line: 115, column: 1, scope: !772)
!793 = distinct !DISubprogram(name: "fiber_inner_join", scope: !3, file: !3, line: 92, type: !64, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !794)
!794 = !{!795, !796, !797}
!795 = !DILocalVariable(name: "i", arg: 1, scope: !793, file: !3, line: 92, type: !33)
!796 = !DILocalVariable(name: "o", arg: 2, scope: !793, file: !3, line: 92, type: !66)
!797 = !DILocalVariable(name: "a", scope: !793, file: !3, line: 95, type: !50)
!798 = !DILocation(line: 92, column: 29, scope: !793)
!799 = !DILocation(line: 92, column: 39, scope: !793)
!800 = !DILocation(line: 94, column: 19, scope: !793)
!801 = !DILocation(line: 94, column: 3, scope: !793)
!802 = !DILocation(line: 95, column: 7, scope: !793)
!803 = !DILocation(line: 97, column: 5, scope: !804)
!804 = distinct !DILexicalBlock(scope: !793, file: !3, line: 96, column: 16)
!805 = !DILocation(line: 100, column: 3, scope: !793)
!806 = !DILocation(line: 101, column: 1, scope: !793)
!807 = distinct !DISubprogram(name: "handle_fibers4", scope: !3, file: !3, line: 573, type: !141, scopeLine: 574, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !808)
!808 = !{!809, !810}
!809 = !DILocalVariable(name: "buf", arg: 1, scope: !807, file: !3, line: 573, type: !137)
!810 = !DILocalVariable(name: "priv", arg: 2, scope: !807, file: !3, line: 573, type: !33)
!811 = !DILocation(line: 573, column: 24, scope: !807)
!812 = !DILocation(line: 573, column: 36, scope: !807)
!813 = !DILocation(line: 575, column: 3, scope: !807)
!814 = !DILocation(line: 577, column: 3, scope: !807)
!815 = distinct !DISubprogram(name: "test_yield_to", scope: !3, file: !3, line: 465, type: !565, scopeLine: 466, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !816)
!816 = !{!817, !818, !819, !820}
!817 = !DILocalVariable(name: "f_first", scope: !815, file: !3, line: 467, type: !24)
!818 = !DILocalVariable(name: "f_second", scope: !815, file: !3, line: 468, type: !24)
!819 = !DILocalVariable(name: "f_third", scope: !815, file: !3, line: 469, type: !24)
!820 = !DILocalVariable(name: "f_fourth", scope: !815, file: !3, line: 470, type: !24)
!821 = !DILocation(line: 467, column: 3, scope: !815)
!822 = !DILocation(line: 468, column: 3, scope: !815)
!823 = !DILocation(line: 469, column: 3, scope: !815)
!824 = !DILocation(line: 470, column: 3, scope: !815)
!825 = !DILocation(line: 258, column: 26, scope: !571, inlinedAt: !826)
!826 = distinct !DILocation(line: 471, column: 8, scope: !815)
!827 = !DILocation(line: 258, column: 26, scope: !572, inlinedAt: !826)
!828 = !DILocation(line: 471, column: 26, scope: !815)
!829 = !DILocation(line: 471, column: 6, scope: !815)
!830 = !DILocation(line: 472, column: 3, scope: !815)
!831 = !DILocation(line: 470, column: 15, scope: !815)
!832 = !DILocation(line: 473, column: 3, scope: !815)
!833 = !DILocation(line: 467, column: 15, scope: !815)
!834 = !DILocation(line: 474, column: 3, scope: !815)
!835 = !DILocation(line: 469, column: 15, scope: !815)
!836 = !DILocation(line: 475, column: 3, scope: !815)
!837 = !DILocation(line: 468, column: 15, scope: !815)
!838 = !DILocation(line: 476, column: 3, scope: !815)
!839 = !DILocation(line: 478, column: 20, scope: !815)
!840 = !DILocation(line: 478, column: 3, scope: !815)
!841 = !DILocation(line: 478, column: 12, scope: !815)
!842 = !DILocation(line: 478, column: 18, scope: !815)
!843 = !DILocation(line: 479, column: 21, scope: !815)
!844 = !DILocation(line: 479, column: 3, scope: !815)
!845 = !DILocation(line: 479, column: 13, scope: !815)
!846 = !DILocation(line: 479, column: 19, scope: !815)
!847 = !DILocation(line: 480, column: 20, scope: !815)
!848 = !DILocation(line: 480, column: 3, scope: !815)
!849 = !DILocation(line: 480, column: 12, scope: !815)
!850 = !DILocation(line: 480, column: 18, scope: !815)
!851 = !DILocation(line: 481, column: 21, scope: !815)
!852 = !DILocation(line: 481, column: 3, scope: !815)
!853 = !DILocation(line: 481, column: 13, scope: !815)
!854 = !DILocation(line: 481, column: 19, scope: !815)
!855 = !DILocation(line: 482, column: 3, scope: !815)
!856 = !DILocation(line: 483, column: 16, scope: !815)
!857 = !DILocation(line: 483, column: 3, scope: !815)
!858 = !DILocation(line: 484, column: 16, scope: !815)
!859 = !DILocation(line: 484, column: 3, scope: !815)
!860 = !DILocation(line: 485, column: 16, scope: !815)
!861 = !DILocation(line: 485, column: 3, scope: !815)
!862 = !DILocation(line: 487, column: 1, scope: !815)
!863 = !DILocation(line: 486, column: 3, scope: !815)
!864 = distinct !DISubprogram(name: "fiber_fourth", scope: !3, file: !3, line: 236, type: !64, scopeLine: 237, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !865)
!865 = !{!866, !867, !868, !869}
!866 = !DILocalVariable(name: "i", arg: 1, scope: !864, file: !3, line: 236, type: !33)
!867 = !DILocalVariable(name: "o", arg: 2, scope: !864, file: !3, line: 236, type: !66)
!868 = !DILocalVariable(name: "a", scope: !864, file: !3, line: 239, type: !50)
!869 = !DILocalVariable(name: "f_to", scope: !864, file: !3, line: 241, type: !24)
!870 = !DILocation(line: 236, column: 25, scope: !864)
!871 = !DILocation(line: 236, column: 35, scope: !864)
!872 = !DILocation(line: 238, column: 19, scope: !864)
!873 = !DILocation(line: 238, column: 3, scope: !864)
!874 = !DILocation(line: 239, column: 7, scope: !864)
!875 = !DILocation(line: 241, column: 22, scope: !864)
!876 = !DILocation(line: 241, column: 15, scope: !864)
!877 = !DILocation(line: 243, column: 5, scope: !878)
!878 = distinct !DILexicalBlock(scope: !864, file: !3, line: 242, column: 15)
!879 = !DILocation(line: 244, column: 5, scope: !878)
!880 = !DILocation(line: 246, column: 3, scope: !864)
!881 = !DILocation(line: 247, column: 1, scope: !864)
!882 = distinct !DISubprogram(name: "fiber_first", scope: !3, file: !3, line: 198, type: !64, scopeLine: 199, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !883)
!883 = !{!884, !885, !886, !887}
!884 = !DILocalVariable(name: "i", arg: 1, scope: !882, file: !3, line: 198, type: !33)
!885 = !DILocalVariable(name: "o", arg: 2, scope: !882, file: !3, line: 198, type: !66)
!886 = !DILocalVariable(name: "a", scope: !882, file: !3, line: 201, type: !50)
!887 = !DILocalVariable(name: "f_to", scope: !882, file: !3, line: 202, type: !24)
!888 = !DILocation(line: 198, column: 24, scope: !882)
!889 = !DILocation(line: 198, column: 34, scope: !882)
!890 = !DILocation(line: 200, column: 19, scope: !882)
!891 = !DILocation(line: 200, column: 3, scope: !882)
!892 = !DILocation(line: 201, column: 7, scope: !882)
!893 = !DILocation(line: 202, column: 22, scope: !882)
!894 = !DILocation(line: 202, column: 15, scope: !882)
!895 = !DILocation(line: 204, column: 5, scope: !896)
!896 = distinct !DILexicalBlock(scope: !882, file: !3, line: 203, column: 15)
!897 = !DILocation(line: 205, column: 5, scope: !896)
!898 = !DILocation(line: 207, column: 3, scope: !882)
!899 = !DILocation(line: 208, column: 1, scope: !882)
!900 = distinct !DISubprogram(name: "fiber_third", scope: !3, file: !3, line: 223, type: !64, scopeLine: 224, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !901)
!901 = !{!902, !903, !904, !905}
!902 = !DILocalVariable(name: "i", arg: 1, scope: !900, file: !3, line: 223, type: !33)
!903 = !DILocalVariable(name: "o", arg: 2, scope: !900, file: !3, line: 223, type: !66)
!904 = !DILocalVariable(name: "a", scope: !900, file: !3, line: 226, type: !50)
!905 = !DILocalVariable(name: "f_to", scope: !900, file: !3, line: 228, type: !24)
!906 = !DILocation(line: 223, column: 24, scope: !900)
!907 = !DILocation(line: 223, column: 34, scope: !900)
!908 = !DILocation(line: 225, column: 19, scope: !900)
!909 = !DILocation(line: 225, column: 3, scope: !900)
!910 = !DILocation(line: 226, column: 7, scope: !900)
!911 = !DILocation(line: 228, column: 22, scope: !900)
!912 = !DILocation(line: 228, column: 15, scope: !900)
!913 = !DILocation(line: 230, column: 5, scope: !914)
!914 = distinct !DILexicalBlock(scope: !900, file: !3, line: 229, column: 15)
!915 = !DILocation(line: 231, column: 5, scope: !914)
!916 = !DILocation(line: 233, column: 3, scope: !900)
!917 = !DILocation(line: 234, column: 1, scope: !900)
!918 = distinct !DISubprogram(name: "fiber_second", scope: !3, file: !3, line: 211, type: !64, scopeLine: 212, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !919)
!919 = !{!920, !921, !922, !923}
!920 = !DILocalVariable(name: "i", arg: 1, scope: !918, file: !3, line: 211, type: !33)
!921 = !DILocalVariable(name: "o", arg: 2, scope: !918, file: !3, line: 211, type: !66)
!922 = !DILocalVariable(name: "a", scope: !918, file: !3, line: 214, type: !50)
!923 = !DILocalVariable(name: "f_to", scope: !918, file: !3, line: 215, type: !24)
!924 = !DILocation(line: 211, column: 25, scope: !918)
!925 = !DILocation(line: 211, column: 35, scope: !918)
!926 = !DILocation(line: 213, column: 19, scope: !918)
!927 = !DILocation(line: 213, column: 3, scope: !918)
!928 = !DILocation(line: 214, column: 7, scope: !918)
!929 = !DILocation(line: 215, column: 22, scope: !918)
!930 = !DILocation(line: 215, column: 15, scope: !918)
!931 = !DILocation(line: 217, column: 5, scope: !932)
!932 = distinct !DILexicalBlock(scope: !918, file: !3, line: 216, column: 15)
!933 = !DILocation(line: 218, column: 5, scope: !932)
!934 = !DILocation(line: 220, column: 3, scope: !918)
!935 = !DILocation(line: 221, column: 1, scope: !918)
!936 = distinct !DISubprogram(name: "handle_fibers3", scope: !3, file: !3, line: 565, type: !141, scopeLine: 566, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !937)
!937 = !{!938, !939}
!938 = !DILocalVariable(name: "buf", arg: 1, scope: !936, file: !3, line: 565, type: !137)
!939 = !DILocalVariable(name: "priv", arg: 2, scope: !936, file: !3, line: 565, type: !33)
!940 = !DILocation(line: 565, column: 24, scope: !936)
!941 = !DILocation(line: 565, column: 36, scope: !936)
!942 = !DILocation(line: 434, column: 3, scope: !943, inlinedAt: !947)
!943 = distinct !DISubprogram(name: "test_fibers_counter", scope: !3, file: !3, line: 433, type: !565, scopeLine: 433, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !944)
!944 = !{!945, !946}
!945 = !DILocalVariable(name: "even", scope: !943, file: !3, line: 434, type: !24)
!946 = !DILocalVariable(name: "odd", scope: !943, file: !3, line: 435, type: !24)
!947 = distinct !DILocation(line: 567, column: 3, scope: !936)
!948 = !DILocation(line: 435, column: 3, scope: !943, inlinedAt: !947)
!949 = !DILocation(line: 258, column: 26, scope: !571, inlinedAt: !950)
!950 = distinct !DILocation(line: 436, column: 8, scope: !943, inlinedAt: !947)
!951 = !DILocation(line: 258, column: 26, scope: !572, inlinedAt: !950)
!952 = !DILocation(line: 436, column: 26, scope: !943, inlinedAt: !947)
!953 = !DILocation(line: 436, column: 6, scope: !943, inlinedAt: !947)
!954 = !DILocation(line: 434, column: 15, scope: !943, inlinedAt: !947)
!955 = !DILocation(line: 437, column: 3, scope: !943, inlinedAt: !947)
!956 = !DILocation(line: 435, column: 15, scope: !943, inlinedAt: !947)
!957 = !DILocation(line: 438, column: 3, scope: !943, inlinedAt: !947)
!958 = !DILocation(line: 441, column: 1, scope: !943, inlinedAt: !947)
!959 = !DILocation(line: 569, column: 3, scope: !936)
!960 = distinct !DISubprogram(name: "print_even", scope: !3, file: !3, line: 172, type: !64, scopeLine: 172, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !961)
!961 = !{!962, !963, !964}
!962 = !DILocalVariable(name: "i", arg: 1, scope: !960, file: !3, line: 172, type: !33)
!963 = !DILocalVariable(name: "o", arg: 2, scope: !960, file: !3, line: 172, type: !66)
!964 = !DILocalVariable(name: "i", scope: !965, file: !3, line: 174, type: !50)
!965 = distinct !DILexicalBlock(scope: !960, file: !3, line: 174, column: 3)
!966 = !DILocation(line: 172, column: 23, scope: !960)
!967 = !DILocation(line: 172, column: 33, scope: !960)
!968 = !DILocation(line: 173, column: 19, scope: !960)
!969 = !DILocation(line: 173, column: 3, scope: !960)
!970 = !DILocation(line: 174, column: 12, scope: !965)
!971 = !DILocation(line: 176, column: 7, scope: !972)
!972 = distinct !DILexicalBlock(scope: !973, file: !3, line: 175, column: 22)
!973 = distinct !DILexicalBlock(scope: !974, file: !3, line: 175, column: 9)
!974 = distinct !DILexicalBlock(scope: !975, file: !3, line: 174, column: 31)
!975 = distinct !DILexicalBlock(scope: !965, file: !3, line: 174, column: 3)
!976 = !DILocation(line: 180, column: 3, scope: !960)
!977 = !DILocation(line: 182, column: 3, scope: !960)
!978 = distinct !DISubprogram(name: "print_odd", scope: !3, file: !3, line: 185, type: !64, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !979)
!979 = !{!980, !981, !982}
!980 = !DILocalVariable(name: "i", arg: 1, scope: !978, file: !3, line: 185, type: !33)
!981 = !DILocalVariable(name: "o", arg: 2, scope: !978, file: !3, line: 185, type: !66)
!982 = !DILocalVariable(name: "i", scope: !983, file: !3, line: 187, type: !50)
!983 = distinct !DILexicalBlock(scope: !978, file: !3, line: 187, column: 3)
!984 = !DILocation(line: 185, column: 22, scope: !978)
!985 = !DILocation(line: 185, column: 32, scope: !978)
!986 = !DILocation(line: 186, column: 19, scope: !978)
!987 = !DILocation(line: 186, column: 3, scope: !978)
!988 = !DILocation(line: 187, column: 12, scope: !983)
!989 = !DILocation(line: 189, column: 7, scope: !990)
!990 = distinct !DILexicalBlock(scope: !991, file: !3, line: 188, column: 22)
!991 = distinct !DILexicalBlock(scope: !992, file: !3, line: 188, column: 9)
!992 = distinct !DILexicalBlock(scope: !993, file: !3, line: 187, column: 31)
!993 = distinct !DILexicalBlock(scope: !983, file: !3, line: 187, column: 3)
!994 = !DILocation(line: 193, column: 3, scope: !978)
!995 = !DILocation(line: 195, column: 3, scope: !978)
!996 = distinct !DISubprogram(name: "handle_fibers2", scope: !3, file: !3, line: 557, type: !141, scopeLine: 558, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !997)
!997 = !{!998, !999}
!998 = !DILocalVariable(name: "buf", arg: 1, scope: !996, file: !3, line: 557, type: !137)
!999 = !DILocalVariable(name: "priv", arg: 2, scope: !996, file: !3, line: 557, type: !33)
!1000 = !DILocation(line: 557, column: 24, scope: !996)
!1001 = !DILocation(line: 557, column: 36, scope: !996)
!1002 = !DILocation(line: 445, column: 3, scope: !1003, inlinedAt: !1006)
!1003 = distinct !DISubprogram(name: "test_nested_fibers", scope: !3, file: !3, line: 443, type: !565, scopeLine: 444, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1004)
!1004 = !{!1005}
!1005 = !DILocalVariable(name: "f_outer", scope: !1003, file: !3, line: 445, type: !24)
!1006 = distinct !DILocation(line: 559, column: 3, scope: !996)
!1007 = !DILocation(line: 258, column: 26, scope: !571, inlinedAt: !1008)
!1008 = distinct !DILocation(line: 446, column: 8, scope: !1003, inlinedAt: !1006)
!1009 = !DILocation(line: 258, column: 26, scope: !572, inlinedAt: !1008)
!1010 = !DILocation(line: 446, column: 26, scope: !1003, inlinedAt: !1006)
!1011 = !DILocation(line: 446, column: 6, scope: !1003, inlinedAt: !1006)
!1012 = !DILocation(line: 447, column: 3, scope: !1003, inlinedAt: !1006)
!1013 = !DILocation(line: 445, column: 15, scope: !1003, inlinedAt: !1006)
!1014 = !DILocation(line: 448, column: 3, scope: !1003, inlinedAt: !1006)
!1015 = !DILocation(line: 450, column: 1, scope: !1003, inlinedAt: !1006)
!1016 = !DILocation(line: 561, column: 3, scope: !996)
!1017 = distinct !DISubprogram(name: "fiber_outer", scope: !3, file: !3, line: 79, type: !64, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1018)
!1018 = !{!1019, !1020, !1021, !1022}
!1019 = !DILocalVariable(name: "i", arg: 1, scope: !1017, file: !3, line: 79, type: !33)
!1020 = !DILocalVariable(name: "o", arg: 2, scope: !1017, file: !3, line: 79, type: !66)
!1021 = !DILocalVariable(name: "a", scope: !1017, file: !3, line: 82, type: !50)
!1022 = !DILocalVariable(name: "f_inner", scope: !1023, file: !3, line: 85, type: !24)
!1023 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 83, column: 15)
!1024 = !DILocation(line: 79, column: 24, scope: !1017)
!1025 = !DILocation(line: 79, column: 34, scope: !1017)
!1026 = !DILocation(line: 81, column: 19, scope: !1017)
!1027 = !DILocation(line: 81, column: 3, scope: !1017)
!1028 = !DILocation(line: 82, column: 7, scope: !1017)
!1029 = !DILocation(line: 84, column: 5, scope: !1023)
!1030 = !DILocation(line: 85, column: 5, scope: !1023)
!1031 = !DILocation(line: 85, column: 17, scope: !1023)
!1032 = !DILocation(line: 86, column: 5, scope: !1023)
!1033 = !DILocation(line: 88, column: 3, scope: !1017)
!1034 = !DILocation(line: 89, column: 3, scope: !1017)
!1035 = !DILocation(line: 90, column: 1, scope: !1017)
!1036 = distinct !DISubprogram(name: "fiber_inner", scope: !3, file: !3, line: 68, type: !64, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1037)
!1037 = !{!1038, !1039, !1040}
!1038 = !DILocalVariable(name: "i", arg: 1, scope: !1036, file: !3, line: 68, type: !33)
!1039 = !DILocalVariable(name: "o", arg: 2, scope: !1036, file: !3, line: 68, type: !66)
!1040 = !DILocalVariable(name: "a", scope: !1036, file: !3, line: 71, type: !50)
!1041 = !DILocation(line: 68, column: 24, scope: !1036)
!1042 = !DILocation(line: 68, column: 34, scope: !1036)
!1043 = !DILocation(line: 70, column: 19, scope: !1036)
!1044 = !DILocation(line: 70, column: 3, scope: !1036)
!1045 = !DILocation(line: 71, column: 7, scope: !1036)
!1046 = !DILocation(line: 73, column: 5, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1036, file: !3, line: 72, column: 16)
!1048 = !DILocation(line: 76, column: 3, scope: !1036)
!1049 = !DILocation(line: 77, column: 1, scope: !1036)
!1050 = distinct !DISubprogram(name: "handle_fibers11", scope: !3, file: !3, line: 624, type: !141, scopeLine: 625, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1051)
!1051 = !{!1052, !1053}
!1052 = !DILocalVariable(name: "buf", arg: 1, scope: !1050, file: !3, line: 624, type: !137)
!1053 = !DILocalVariable(name: "priv", arg: 2, scope: !1050, file: !3, line: 624, type: !33)
!1054 = !DILocation(line: 624, column: 25, scope: !1050)
!1055 = !DILocation(line: 624, column: 37, scope: !1050)
!1056 = !DILocation(line: 422, column: 3, scope: !1057, inlinedAt: !1061)
!1057 = distinct !DISubprogram(name: "test_fiber_benchmark1", scope: !3, file: !3, line: 421, type: !565, scopeLine: 421, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1058)
!1058 = !{!1059, !1060}
!1059 = !DILocalVariable(name: "first", scope: !1057, file: !3, line: 422, type: !24)
!1060 = !DILocalVariable(name: "second", scope: !1057, file: !3, line: 423, type: !24)
!1061 = distinct !DILocation(line: 626, column: 3, scope: !1050)
!1062 = !DILocation(line: 423, column: 3, scope: !1057, inlinedAt: !1061)
!1063 = !DILocation(line: 258, column: 26, scope: !571, inlinedAt: !1064)
!1064 = distinct !DILocation(line: 424, column: 8, scope: !1057, inlinedAt: !1061)
!1065 = !DILocation(line: 258, column: 26, scope: !572, inlinedAt: !1064)
!1066 = !DILocation(line: 424, column: 26, scope: !1057, inlinedAt: !1061)
!1067 = !DILocation(line: 424, column: 6, scope: !1057, inlinedAt: !1061)
!1068 = !DILocation(line: 422, column: 15, scope: !1057, inlinedAt: !1061)
!1069 = !DILocation(line: 426, column: 3, scope: !1057, inlinedAt: !1061)
!1070 = !DILocation(line: 423, column: 15, scope: !1057, inlinedAt: !1061)
!1071 = !DILocation(line: 427, column: 3, scope: !1057, inlinedAt: !1061)
!1072 = !DILocation(line: 430, column: 1, scope: !1057, inlinedAt: !1061)
!1073 = !DILocation(line: 627, column: 3, scope: !1050)
!1074 = distinct !DISubprogram(name: "benchmark_timer1", scope: !3, file: !3, line: 381, type: !64, scopeLine: 382, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1075)
!1075 = !{!1076, !1077, !1078, !1079, !1080, !1084}
!1076 = !DILocalVariable(name: "i", arg: 1, scope: !1074, file: !3, line: 381, type: !33)
!1077 = !DILocalVariable(name: "o", arg: 2, scope: !1074, file: !3, line: 381, type: !66)
!1078 = !DILocalVariable(name: "a", scope: !1074, file: !3, line: 385, type: !50)
!1079 = !DILocalVariable(name: "start", scope: !1074, file: !3, line: 386, type: !29)
!1080 = !DILocalVariable(name: "times", scope: !1074, file: !3, line: 387, type: !1081)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 128000, elements: !1082)
!1082 = !{!1083}
!1083 = !DISubrange(count: 2000)
!1084 = !DILocalVariable(name: "j", scope: !1074, file: !3, line: 396, type: !50)
!1085 = !DILocation(line: 381, column: 29, scope: !1074)
!1086 = !DILocation(line: 381, column: 39, scope: !1074)
!1087 = !DILocation(line: 383, column: 19, scope: !1074)
!1088 = !DILocation(line: 383, column: 3, scope: !1074)
!1089 = !DILocation(line: 385, column: 7, scope: !1074)
!1090 = !DILocation(line: 386, column: 12, scope: !1074)
!1091 = !DILocation(line: 387, column: 3, scope: !1074)
!1092 = !DILocation(line: 387, column: 12, scope: !1074)
!1093 = !DILocation(line: 389, column: 3, scope: !1074)
!1094 = !DILocation(line: 390, column: 5, scope: !1095)
!1095 = distinct !DILexicalBlock(scope: !1074, file: !3, line: 389, column: 21)
!1096 = !DILocation(line: 268, column: 5, scope: !1097, inlinedAt: !1104)
!1097 = distinct !DISubprogram(name: "rdtsc", scope: !1098, file: !1098, line: 265, type: !1099, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1101)
!1098 = !DIFile(filename: "include/nautilus/cpu.h", directory: "/home/sgi9754/nautilus-cs446")
!1099 = !DISubroutineType(types: !1100)
