; ModuleID = 'src/test/fibers_optimized.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nk_virtual_console = type opaque
%struct.shell_cmd_impl = type { i8*, i8*, i32 (i8*, i8*)* }
%struct.naut_info = type { %struct.sys_info, %struct.cmdline_state*, %struct.nk_test_harness* }
%struct.sys_info = type { [256 x %struct.cpu*], [16 x %struct.ioapic*], i32, i32, i64, %struct.nk_barrier*, %struct.nk_mem_info, i32, i8, %struct.pci_info*, %struct.hpet_dev*, %struct.multiboot_info*, %struct.nk_int_info, %struct.nk_locality_info, %struct.pmc_info*, %struct.nk_link_info*, %struct.nk_prog_info* }
%struct.cpu = type { %struct.nk_thread*, i16, i16, i64, i64, %struct.nk_fiber_percpu_state*, i32, i32, i8, i8, i32, i32, i8, %struct.apic_dev*, %struct.sys_info*, i32, %struct.nk_sched_percpu_state*, %struct.nk_queue*, %struct.nk_xcall, i64, %struct.nk_topo_params*, %struct.nk_cpu_coords*, %struct.numa_domain*, %struct.nk_queue_entry, %struct.nk_rand_info* }
%struct.nk_thread = type { i64, i8*, i16, i16, i64, i64, i32, %struct.nk_thread*, %struct.list_head, %struct.list_head, i64, %struct.nk_wait_queue*, i32, %struct.nk_timer*, i32, i32, i32, i32, i8, i8**, i8*, i8*, void (i8*, i8**)*, %struct.nk_sched_thread_state*, %struct.nk_virtual_console*, [32 x i8], [256 x i8*], [32 x i8], [4096 x i8] }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "vc", scope: !2, file: !3, line: 43, type: !47, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 8.0.0 (tags/RELEASE_800/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !23, globals: !129, nameTableKind: None)
!3 = !DIFile(filename: "src/test/fibers.c", directory: "/home/sgi9754/nautilus-cs446")
!4 = !{!5, !15}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "include/nautilus/fiber.h", directory: "/home/sgi9754/nautilus-cs446")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "INIT", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "READY", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "YIELD", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "WAIT", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "EXIT", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "RUN", value: 5, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 166, baseType: !7, size: 32, elements: !17)
!16 = !DIFile(filename: "include/nautilus/thread.h", directory: "/home/sgi9754/nautilus-cs446")
!17 = !{!18, !19, !20, !21, !22}
!18 = !DIEnumerator(name: "NK_THR_INIT", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "NK_THR_RUNNING", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "NK_THR_WAITING", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "NK_THR_SUSPENDED", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "NK_THR_EXITED", value: 4, isUnsigned: true)
!23 = !{!24, !29, !72, !86}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_fiber_t", file: !6, line: 104, baseType: !26)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_fiber", file: !6, line: 70, size: 1216, elements: !27)
!27 = !{!28, !32, !34, !37, !39, !40, !44, !46, !49, !51, !58, !59, !60, !61, !67, !68, !69}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "rsp", scope: !26, file: !6, line: 71, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !30, line: 50, baseType: !31)
!30 = !DIFile(filename: "include/nautilus/naut_types.h", directory: "/home/sgi9754/nautilus-cs446")
!31 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !26, file: !6, line: 72, baseType: !33, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_state_offset", scope: !26, file: !6, line: 73, baseType: !35, size: 16, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !30, line: 58, baseType: !36)
!36 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !26, file: !6, line: 75, baseType: !38, size: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_stack_size_t", file: !6, line: 43, baseType: !29)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !26, file: !6, line: 76, baseType: !31, size: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !26, file: !6, line: 78, baseType: !41, size: 32, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !42, line: 39, baseType: !43)
!42 = !DIFile(filename: "include/nautilus/spinlock.h", directory: "/home/sgi9754/nautilus-cs446")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !30, line: 54, baseType: !7)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "f_status", scope: !26, file: !6, line: 79, baseType: !45, size: 32, offset: 352)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_fiber_status", file: !6, line: 66, baseType: !5)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "vc", scope: !26, file: !6, line: 82, baseType: !47, size: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_virtual_console", file: !6, line: 82, flags: DIFlagFwdDecl)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "is_idle", scope: !26, file: !6, line: 83, baseType: !50, size: 32, offset: 448)
!50 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "wait_queue", scope: !26, file: !6, line: 91, baseType: !52, size: 128, offset: 512)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !53, line: 64, size: 128, elements: !54)
!53 = !DIFile(filename: "include/nautilus/list.h", directory: "/home/sgi9754/nautilus-cs446")
!54 = !{!55, !57}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !52, file: !53, line: 65, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !52, file: !53, line: 65, baseType: !56, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "wait_node", scope: !26, file: !6, line: 92, baseType: !52, size: 128, offset: 640)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "num_wait", scope: !26, file: !6, line: 93, baseType: !50, size: 32, offset: 768)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "sched_node", scope: !26, file: !6, line: 97, baseType: !52, size: 128, offset: 832)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !26, file: !6, line: 99, baseType: !62, size: 64, offset: 960)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_fiber_fun_t", file: !6, line: 56, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !33, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !26, file: !6, line: 100, baseType: !33, size: 64, offset: 1024)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !26, file: !6, line: 101, baseType: !66, size: 64, offset: 1088)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "is_done", scope: !26, file: !6, line: 103, baseType: !70, size: 8, offset: 1152)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !30, line: 61, baseType: !71)
!71 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_thread_t", file: !16, line: 233, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_thread", file: !16, line: 178, size: 51200, elements: !75)
!75 = !{!76, !77, !78, !79, !82, !83, !84, !85, !87, !88, !89, !90, !94, !95, !98, !100, !101, !102, !103, !104, !105, !106, !107, !109, !113, !114, !119, !125}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "rsp", scope: !74, file: !16, line: 179, baseType: !29, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !74, file: !16, line: 180, baseType: !33, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_state_offset", scope: !74, file: !16, line: 181, baseType: !35, size: 16, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "cache_part_state", scope: !74, file: !16, line: 183, baseType: !80, size: 16, offset: 144)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_cache_part_thread_state_t", file: !81, line: 32, baseType: !35)
!81 = !DIFile(filename: "include/nautilus/cachepart.h", directory: "/home/sgi9754/nautilus-cs446")
!82 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !74, file: !16, line: 185, baseType: !38, size: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !74, file: !16, line: 186, baseType: !31, size: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !74, file: !16, line: 188, baseType: !50, size: 32, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !74, file: !16, line: 191, baseType: !86, size: 64, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !74, file: !16, line: 192, baseType: !52, size: 128, offset: 448)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "child_node", scope: !74, file: !16, line: 193, baseType: !52, size: 128, offset: 576)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !74, file: !16, line: 194, baseType: !31, size: 64, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !74, file: !16, line: 196, baseType: !91, size: 64, offset: 768)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_wait_queue_t", file: !16, line: 175, baseType: !93)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_wait_queue", file: !16, line: 175, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "num_wait", scope: !74, file: !16, line: 198, baseType: !50, size: 32, offset: 832)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !74, file: !16, line: 201, baseType: !96, size: 64, offset: 896)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_timer", file: !16, line: 201, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !74, file: !16, line: 204, baseType: !99, size: 32, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_thread_status_t", file: !16, line: 172, baseType: !15)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "bound_cpu", scope: !74, file: !16, line: 206, baseType: !50, size: 32, offset: 992)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "placement_cpu", scope: !74, file: !16, line: 207, baseType: !50, size: 32, offset: 1024)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "current_cpu", scope: !74, file: !16, line: 208, baseType: !50, size: 32, offset: 1056)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "is_idle", scope: !74, file: !16, line: 210, baseType: !70, size: 8, offset: 1088)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "output_loc", scope: !74, file: !16, line: 212, baseType: !66, size: 64, offset: 1152)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !74, file: !16, line: 213, baseType: !33, size: 64, offset: 1216)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !74, file: !16, line: 214, baseType: !33, size: 64, offset: 1280)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !74, file: !16, line: 215, baseType: !108, size: 64, offset: 1344)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_thread_fun_t", file: !16, line: 61, baseType: !63)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "sched_state", scope: !74, file: !16, line: 217, baseType: !110, size: 64, offset: 1408)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_sched_thread_state", file: !112, line: 99, flags: DIFlagFwdDecl)
!112 = !DIFile(filename: "include/nautilus/scheduler.h", directory: "/home/sgi9754/nautilus-cs446")
!113 = !DIDerivedType(tag: DW_TAG_member, name: "vc", scope: !74, file: !16, line: 219, baseType: !47, size: 64, offset: 1472)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !74, file: !16, line: 225, baseType: !115, size: 256, offset: 1536)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 256, elements: !117)
!116 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!117 = !{!118}
!118 = !DISubrange(count: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !74, file: !16, line: 227, baseType: !120, size: 16384, offset: 1792)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 16384, elements: !123)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!123 = !{!124}
!124 = !DISubrange(count: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_state", scope: !74, file: !16, line: 229, baseType: !126, size: 32768, align: 512, offset: 18432)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 32768, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 4096)
!129 = !{!130, !143, !145, !147, !149, !151, !153, !155, !157, !159, !0, !161, !163, !165, !167, !169, !171, !173, !175, !177, !179}
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl", scope: !2, file: !3, line: 612, type: !132, isLocal: true, isDefinition: true, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "shell_cmd_impl", file: !134, line: 43, size: 192, elements: !135)
!134 = !DIFile(filename: "include/nautilus/shell.h", directory: "/home/sgi9754/nautilus-cs446")
!135 = !{!136, !138, !139}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !133, file: !134, line: 44, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "help_str", scope: !133, file: !134, line: 45, baseType: !137, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !133, file: !134, line: 46, baseType: !140, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!50, !137, !33}
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl2", scope: !2, file: !3, line: 613, type: !132, isLocal: true, isDefinition: true, align: 64)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl3", scope: !2, file: !3, line: 614, type: !132, isLocal: true, isDefinition: true, align: 64)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl4", scope: !2, file: !3, line: 615, type: !132, isLocal: true, isDefinition: true, align: 64)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl5", scope: !2, file: !3, line: 616, type: !132, isLocal: true, isDefinition: true, align: 64)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl6", scope: !2, file: !3, line: 617, type: !132, isLocal: true, isDefinition: true, align: 64)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl7", scope: !2, file: !3, line: 618, type: !132, isLocal: true, isDefinition: true, align: 64)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl8", scope: !2, file: !3, line: 619, type: !132, isLocal: true, isDefinition: true, align: 64)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl9", scope: !2, file: !3, line: 620, type: !132, isLocal: true, isDefinition: true, align: 64)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl10", scope: !2, file: !3, line: 621, type: !132, isLocal: true, isDefinition: true, align: 64)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "fibers_impl", scope: !2, file: !3, line: 549, type: !133, isLocal: true, isDefinition: true)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "fibers_impl2", scope: !2, file: !3, line: 555, type: !133, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "fibers_impl3", scope: !2, file: !3, line: 561, type: !133, isLocal: true, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "fibers_impl4", scope: !2, file: !3, line: 567, type: !133, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "fibers_impl5", scope: !2, file: !3, line: 573, type: !133, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "fibers_impl6", scope: !2, file: !3, line: 579, type: !133, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "fibers_impl7", scope: !2, file: !3, line: 585, type: !133, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "fibers_impl8", scope: !2, file: !3, line: 591, type: !133, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "fibers_impl9", scope: !2, file: !3, line: 597, type: !133, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "fibers_impl10", scope: !2, file: !3, line: 603, type: !133, isLocal: true, isDefinition: true)
!181 = distinct !DICompileUnit(language: DW_LANG_C99, file: !182, producer: "clang version 8.0.0 (tags/RELEASE_800/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, retainedTypes: !294, nameTableKind: None)
!182 = !DIFile(filename: "src/nautilus/fiber.c", directory: "/home/sgi9754/nautilus-cs446")
!183 = !{!184, !15, !5, !263, !270, !277, !283, !289}
!184 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !186, file: !185, line: 40, baseType: !7, size: 32, elements: !259)
!185 = !DIFile(filename: "include/nautilus/timer.h", directory: "/home/sgi9754/nautilus-cs446")
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_timer", file: !185, line: 38, size: 960, elements: !187)
!187 = !{!188, !189, !191, !192, !193, !251, !252, !256, !257, !258}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !186, file: !185, line: 39, baseType: !115, size: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !186, file: !185, line: 42, baseType: !190, size: 32, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !184)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !186, file: !185, line: 43, baseType: !29, size: 64, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "time_ns", scope: !186, file: !185, line: 44, baseType: !29, size: 64, offset: 384)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !186, file: !185, line: 45, baseType: !194, size: 64, offset: 448)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_wait_queue_t", file: !185, line: 33, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_wait_queue", file: !197, line: 85, size: 197248, elements: !198)
!197 = !DIFile(filename: "include/nautilus/waitqueue.h", directory: "/home/sgi9754/nautilus-cs446")
!198 = !{!199, !200, !201, !207, !208, !209}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !196, file: !197, line: 86, baseType: !115, size: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !196, file: !197, line: 87, baseType: !41, size: 32, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !196, file: !197, line: 88, baseType: !202, size: 128, offset: 320)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !53, line: 64, size: 128, elements: !203)
!203 = !{!204, !206}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !202, file: !53, line: 65, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !202, file: !53, line: 65, baseType: !205, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "num_wait", scope: !196, file: !197, line: 89, baseType: !29, size: 64, offset: 448)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !196, file: !197, line: 90, baseType: !202, size: 128, offset: 512)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !196, file: !197, line: 91, baseType: !210, size: 196608, offset: 640)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 196608, elements: !249)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_wait_queue_entry", file: !197, line: 70, size: 192, elements: !212)
!212 = !{!213, !214}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !211, file: !197, line: 71, baseType: !202, size: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !211, file: !197, line: 72, baseType: !215, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_thread", file: !16, line: 178, size: 51200, elements: !217)
!217 = !{!218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !232, !233, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "rsp", scope: !216, file: !16, line: 179, baseType: !29, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !216, file: !16, line: 180, baseType: !33, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_state_offset", scope: !216, file: !16, line: 181, baseType: !35, size: 16, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "cache_part_state", scope: !216, file: !16, line: 183, baseType: !80, size: 16, offset: 144)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !216, file: !16, line: 185, baseType: !38, size: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !216, file: !16, line: 186, baseType: !31, size: 64, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !216, file: !16, line: 188, baseType: !50, size: 32, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !216, file: !16, line: 191, baseType: !215, size: 64, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !216, file: !16, line: 192, baseType: !202, size: 128, offset: 448)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "child_node", scope: !216, file: !16, line: 193, baseType: !202, size: 128, offset: 576)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !216, file: !16, line: 194, baseType: !31, size: 64, offset: 704)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !216, file: !16, line: 196, baseType: !230, size: 64, offset: 768)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_wait_queue_t", file: !16, line: 175, baseType: !196)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "num_wait", scope: !216, file: !16, line: 198, baseType: !50, size: 32, offset: 832)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !216, file: !16, line: 201, baseType: !234, size: 64, offset: 896)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !216, file: !16, line: 204, baseType: !99, size: 32, offset: 960)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "bound_cpu", scope: !216, file: !16, line: 206, baseType: !50, size: 32, offset: 992)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "placement_cpu", scope: !216, file: !16, line: 207, baseType: !50, size: 32, offset: 1024)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "current_cpu", scope: !216, file: !16, line: 208, baseType: !50, size: 32, offset: 1056)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "is_idle", scope: !216, file: !16, line: 210, baseType: !70, size: 8, offset: 1088)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "output_loc", scope: !216, file: !16, line: 212, baseType: !66, size: 64, offset: 1152)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !216, file: !16, line: 213, baseType: !33, size: 64, offset: 1216)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !216, file: !16, line: 214, baseType: !33, size: 64, offset: 1280)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !216, file: !16, line: 215, baseType: !108, size: 64, offset: 1344)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "sched_state", scope: !216, file: !16, line: 217, baseType: !110, size: 64, offset: 1408)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "vc", scope: !216, file: !16, line: 219, baseType: !47, size: 64, offset: 1472)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !216, file: !16, line: 225, baseType: !115, size: 256, offset: 1536)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !216, file: !16, line: 227, baseType: !120, size: 16384, offset: 1792)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_state", scope: !216, file: !16, line: 229, baseType: !126, size: 32768, align: 512, offset: 18432)
!249 = !{!250}
!250 = !DISubrange(count: 1024)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !186, file: !185, line: 46, baseType: !43, size: 32, offset: 512)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !186, file: !185, line: 47, baseType: !253, size: 64, offset: 576)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !33}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !186, file: !185, line: 48, baseType: !33, size: 64, offset: 640)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !186, file: !185, line: 49, baseType: !202, size: 128, offset: 704)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "active_node", scope: !186, file: !185, line: 50, baseType: !202, size: 128, offset: 832)
!259 = !{!260, !261, !262}
!260 = !DIEnumerator(name: "NK_TIMER_INACTIVE", value: 0, isUnsigned: true)
!261 = !DIEnumerator(name: "NK_TIMER_ACTIVE", value: 1, isUnsigned: true)
!262 = !DIEnumerator(name: "NK_TIMER_SIGNALLED", value: 2, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !264, line: 225, baseType: !7, size: 32, elements: !265)
!264 = !DIFile(filename: "include/dev/apic.h", directory: "/home/sgi9754/nautilus-cs446")
!265 = !{!266, !267, !268, !269}
!266 = !DIEnumerator(name: "APIC_INVALID", value: 0, isUnsigned: true)
!267 = !DIEnumerator(name: "APIC_DISABLED", value: 1, isUnsigned: true)
!268 = !DIEnumerator(name: "APIC_XAPIC", value: 2, isUnsigned: true)
!269 = !DIEnumerator(name: "APIC_X2APIC", value: 3, isUnsigned: true)
!270 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !271, line: 41, baseType: !7, size: 32, elements: !272)
!271 = !DIFile(filename: "include/nautilus/irq.h", directory: "/home/sgi9754/nautilus-cs446")
!272 = !{!273, !274, !275, !276}
!273 = !DIEnumerator(name: "INT_TRIG_BUS", value: 0, isUnsigned: true)
!274 = !DIEnumerator(name: "INT_TRIG_EDGE", value: 1, isUnsigned: true)
!275 = !DIEnumerator(name: "INT_TRIG_RSVD", value: 2, isUnsigned: true)
!276 = !DIEnumerator(name: "INT_TRIG_LEVEL", value: 3, isUnsigned: true)
!277 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !271, line: 40, baseType: !7, size: 32, elements: !278)
!278 = !{!279, !280, !281, !282}
!279 = !DIEnumerator(name: "INT_POL_BUS", value: 0, isUnsigned: true)
!280 = !DIEnumerator(name: "INT_POL_ACTHI", value: 1, isUnsigned: true)
!281 = !DIEnumerator(name: "INT_POL_RSVD", value: 2, isUnsigned: true)
!282 = !DIEnumerator(name: "INT_POL_ACTLO", value: 3, isUnsigned: true)
!283 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !271, line: 39, baseType: !7, size: 32, elements: !284)
!284 = !{!285, !286, !287, !288}
!285 = !DIEnumerator(name: "INT_TYPE_INT", value: 0, isUnsigned: true)
!286 = !DIEnumerator(name: "INT_TYPE_NMI", value: 1, isUnsigned: true)
!287 = !DIEnumerator(name: "INT_TYPE_SMI", value: 2, isUnsigned: true)
!288 = !DIEnumerator(name: "INT_TYPE_EXT", value: 3, isUnsigned: true)
!289 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !112, line: 66, baseType: !7, size: 32, elements: !290)
!290 = !{!291, !292, !293}
!291 = !DIEnumerator(name: "APERIODIC", value: 0, isUnsigned: true)
!292 = !DIEnumerator(name: "SPORADIC", value: 1, isUnsigned: true)
!293 = !DIEnumerator(name: "PERIODIC", value: 2, isUnsigned: true)
!294 = !{!295, !296, !137, !317, !29, !318, !345, !33, !66, !324, !50, !533, !334, !547, !339, !215}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_fiber_t", file: !6, line: 104, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_fiber", file: !6, line: 70, size: 1216, elements: !299)
!299 = !{!300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "rsp", scope: !298, file: !6, line: 71, baseType: !29, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !298, file: !6, line: 72, baseType: !33, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_state_offset", scope: !298, file: !6, line: 73, baseType: !35, size: 16, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !298, file: !6, line: 75, baseType: !38, size: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !298, file: !6, line: 76, baseType: !31, size: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !298, file: !6, line: 78, baseType: !41, size: 32, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "f_status", scope: !298, file: !6, line: 79, baseType: !45, size: 32, offset: 352)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "vc", scope: !298, file: !6, line: 82, baseType: !47, size: 64, offset: 384)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "is_idle", scope: !298, file: !6, line: 83, baseType: !50, size: 32, offset: 448)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "wait_queue", scope: !298, file: !6, line: 91, baseType: !202, size: 128, offset: 512)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "wait_node", scope: !298, file: !6, line: 92, baseType: !202, size: 128, offset: 640)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "num_wait", scope: !298, file: !6, line: 93, baseType: !50, size: 32, offset: 768)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "sched_node", scope: !298, file: !6, line: 97, baseType: !202, size: 128, offset: 832)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !298, file: !6, line: 99, baseType: !62, size: 64, offset: 960)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !298, file: !6, line: 100, baseType: !33, size: 64, offset: 1024)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !298, file: !6, line: 101, baseType: !66, size: 64, offset: 1088)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "is_done", scope: !298, file: !6, line: 103, baseType: !70, size: 8, offset: 1152)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !30, line: 45, baseType: !31)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_info", file: !320, line: 183, size: 59840, elements: !321)
!320 = !DIFile(filename: "include/nautilus/nautilus.h", directory: "/home/sgi9754/nautilus-cs446")
!321 = !{!322, !439, !475, !476, !477, !478, !494, !505, !506, !507, !510, !513, !516, !528, !538, !541, !544}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "cpus", scope: !319, file: !320, line: 185, baseType: !323, size: 16384)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 16384, elements: !123)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpu", file: !326, line: 74, size: 1600, elements: !327)
!326 = !DIFile(filename: "include/nautilus/smp.h", directory: "/home/sgi9754/nautilus-cs446")
!327 = !{!328, !329, !330, !331, !332, !333, !344, !346, !347, !348, !349, !350, !351, !353, !375, !376, !377, !380, !388, !401, !402, !409, !416, !425, !430}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "cur_thread", scope: !325, file: !326, line: 75, baseType: !215, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_nesting_level", scope: !325, file: !326, line: 78, baseType: !35, size: 16, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_disable_level", scope: !325, file: !326, line: 81, baseType: !35, size: 16, offset: 80)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_count", scope: !325, file: !326, line: 85, baseType: !29, size: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "exception_count", scope: !325, file: !326, line: 86, baseType: !29, size: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "f_state", scope: !325, file: !326, line: 88, baseType: !334, size: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_fiber_percpu_state", file: !182, line: 60, size: 384, elements: !336)
!336 = !{!337, !338, !341, !342, !343}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !335, file: !182, line: 61, baseType: !41, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "fiber_thread", scope: !335, file: !182, line: 62, baseType: !339, size: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_thread_t", file: !16, line: 233, baseType: !216)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "curr_fiber", scope: !335, file: !182, line: 63, baseType: !296, size: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "idle_fiber", scope: !335, file: !182, line: 64, baseType: !296, size: 64, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "f_sched_queue", scope: !335, file: !182, line: 65, baseType: !202, size: 128, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !325, file: !326, line: 89, baseType: !345, size: 32, offset: 320)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpu_id_t", file: !326, line: 58, baseType: !43)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "lapic_id", scope: !325, file: !326, line: 90, baseType: !43, size: 32, offset: 352)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !325, file: !326, line: 91, baseType: !70, size: 8, offset: 384)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "is_bsp", scope: !325, file: !326, line: 92, baseType: !70, size: 8, offset: 392)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_sig", scope: !325, file: !326, line: 93, baseType: !43, size: 32, offset: 416)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "feat_flags", scope: !325, file: !326, line: 94, baseType: !43, size: 32, offset: 448)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "booted", scope: !325, file: !326, line: 96, baseType: !352, size: 8, offset: 480)
!352 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !70)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "apic", scope: !325, file: !326, line: 98, baseType: !354, size: 64, offset: 512)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apic_dev", file: !264, line: 227, size: 768, elements: !356)
!356 = !{!357, !359, !361, !362, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !355, file: !264, line: 228, baseType: !358, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "apic_mode_t", file: !264, line: 225, baseType: !263)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !355, file: !264, line: 229, baseType: !360, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "ulong_t", file: !30, line: 43, baseType: !31)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !355, file: !264, line: 230, baseType: !70, size: 8, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !355, file: !264, line: 231, baseType: !363, size: 32, offset: 160)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_t", file: !30, line: 37, baseType: !7)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "spur_int_cnt", scope: !355, file: !264, line: 232, baseType: !29, size: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "err_int_cnt", scope: !355, file: !264, line: 233, baseType: !29, size: 64, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "bus_freq_hz", scope: !355, file: !264, line: 234, baseType: !29, size: 64, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ps_per_tick", scope: !355, file: !264, line: 235, baseType: !29, size: 64, offset: 384)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "cycles_per_us", scope: !355, file: !264, line: 236, baseType: !29, size: 64, offset: 448)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "cycles_per_tick", scope: !355, file: !264, line: 237, baseType: !29, size: 64, offset: 512)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !355, file: !264, line: 238, baseType: !70, size: 8, offset: 576)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "current_ticks", scope: !355, file: !264, line: 239, baseType: !43, size: 32, offset: 608)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "timer_count", scope: !355, file: !264, line: 240, baseType: !29, size: 64, offset: 640)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "in_timer_interrupt", scope: !355, file: !264, line: 241, baseType: !50, size: 32, offset: 704)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "in_kick_interrupt", scope: !355, file: !264, line: 242, baseType: !50, size: 32, offset: 736)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "system", scope: !325, file: !326, line: 100, baseType: !318, size: 64, offset: 576)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !325, file: !326, line: 102, baseType: !41, size: 32, offset: 640)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "sched_state", scope: !325, file: !326, line: 104, baseType: !378, size: 64, offset: 704)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_sched_percpu_state", file: !326, line: 104, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "xcall_q", scope: !325, file: !326, line: 106, baseType: !381, size: 64, offset: 768)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_queue_t", file: !383, line: 42, baseType: !384)
!383 = !DIFile(filename: "include/nautilus/queue.h", directory: "/home/sgi9754/nautilus-cs446")
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_queue", file: !383, line: 33, size: 192, elements: !385)
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !384, file: !383, line: 34, baseType: !202, size: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !384, file: !383, line: 35, baseType: !41, size: 32, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "xcall_nowait_info", scope: !325, file: !326, line: 107, baseType: !389, size: 320, offset: 832)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_xcall", file: !326, line: 61, size: 320, elements: !390)
!390 = !{!391, !396, !397, !399, !400}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "xcall_node", scope: !389, file: !326, line: 62, baseType: !392, size: 128)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_queue_entry_t", file: !383, line: 43, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_queue_entry", file: !383, line: 38, size: 128, elements: !394)
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !393, file: !383, line: 39, baseType: !202, size: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !389, file: !326, line: 63, baseType: !33, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !389, file: !326, line: 64, baseType: !398, size: 64, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_xcall_func_t", file: !326, line: 57, baseType: !253)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "xcall_done", scope: !389, file: !326, line: 65, baseType: !70, size: 8, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "has_waiter", scope: !389, file: !326, line: 66, baseType: !70, size: 8, offset: 264)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_khz", scope: !325, file: !326, line: 109, baseType: !360, size: 64, offset: 1152)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tp", scope: !325, file: !326, line: 112, baseType: !403, size: 64, offset: 1216)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_topo_params", file: !405, line: 94, size: 64, elements: !406)
!405 = !DIFile(filename: "include/nautilus/numa.h", directory: "/home/sgi9754/nautilus-cs446")
!406 = !{!407, !408}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "smt_bits", scope: !404, file: !405, line: 95, baseType: !43, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "core_bits", scope: !404, file: !405, line: 96, baseType: !43, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "coord", scope: !325, file: !326, line: 113, baseType: !410, size: 64, offset: 1280)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_cpu_coords", file: !405, line: 99, size: 96, elements: !412)
!412 = !{!413, !414, !415}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "smt_id", scope: !411, file: !405, line: 100, baseType: !43, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "core_id", scope: !411, file: !405, line: 101, baseType: !43, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_id", scope: !411, file: !405, line: 102, baseType: !43, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !325, file: !326, line: 114, baseType: !417, size: 64, offset: 1344)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "numa_domain", file: !405, line: 34, size: 448, elements: !419)
!419 = !{!420, !421, !422, !423, !424}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !418, file: !405, line: 35, baseType: !43, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "addr_space_size", scope: !418, file: !405, line: 36, baseType: !29, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !418, file: !405, line: 37, baseType: !43, size: 32, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "regions", scope: !418, file: !405, line: 39, baseType: !202, size: 128, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !418, file: !405, line: 42, baseType: !202, size: 128, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "kmem", scope: !325, file: !326, line: 116, baseType: !426, size: 128, offset: 1408)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kmem_data", file: !427, line: 84, size: 128, elements: !428)
!427 = !DIFile(filename: "include/nautilus/mm.h", directory: "/home/sgi9754/nautilus-cs446")
!428 = !{!429}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ordered_regions", scope: !426, file: !427, line: 85, baseType: !202, size: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "rand", scope: !325, file: !326, line: 119, baseType: !431, size: 64, offset: 1536)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_rand_info", file: !433, line: 33, size: 256, elements: !434)
!433 = !DIFile(filename: "include/nautilus/random.h", directory: "/home/sgi9754/nautilus-cs446")
!434 = !{!435, !436, !437, !438}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !432, file: !433, line: 34, baseType: !41, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !432, file: !433, line: 35, baseType: !29, size: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !432, file: !433, line: 36, baseType: !29, size: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !432, file: !433, line: 37, baseType: !29, size: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ioapics", scope: !319, file: !320, line: 186, baseType: !440, size: 1024, offset: 16384)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 1024, elements: !473)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ioapic", file: !443, line: 113, size: 320, elements: !444)
!443 = !DIFile(filename: "include/dev/ioapic.h", directory: "/home/sgi9754/nautilus-cs446")
!444 = !{!445, !446, !447, !448, !450, !451, !472}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !442, file: !443, line: 114, baseType: !70, size: 8)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !442, file: !443, line: 115, baseType: !70, size: 8, offset: 8)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "usable", scope: !442, file: !443, line: 116, baseType: !70, size: 8, offset: 16)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !442, file: !443, line: 117, baseType: !449, size: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_t", file: !30, line: 64, baseType: !360)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "num_entries", scope: !442, file: !443, line: 119, baseType: !70, size: 8, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !442, file: !443, line: 120, baseType: !452, size: 64, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iored_entry", file: !443, line: 101, size: 192, elements: !454)
!454 = !{!455, !456, !471}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !453, file: !443, line: 103, baseType: !70, size: 8)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "boot_info", scope: !453, file: !443, line: 106, baseType: !457, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_int_entry", file: !271, line: 43, size: 256, elements: !459)
!459 = !{!460, !462, !464, !466, !467, !468, !469, !470}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "trig_mode", scope: !458, file: !271, line: 44, baseType: !461, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_trig_t", file: !271, line: 41, baseType: !270)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "polarity", scope: !458, file: !271, line: 45, baseType: !463, size: 32, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_pol_t", file: !271, line: 40, baseType: !277)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !458, file: !271, line: 46, baseType: !465, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_type_t", file: !271, line: 39, baseType: !283)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "src_bus_id", scope: !458, file: !271, line: 47, baseType: !70, size: 8, offset: 96)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "src_bus_irq", scope: !458, file: !271, line: 48, baseType: !70, size: 8, offset: 104)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ioapic_intin", scope: !458, file: !271, line: 49, baseType: !70, size: 8, offset: 112)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ioapic_id", scope: !458, file: !271, line: 50, baseType: !70, size: 8, offset: 120)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "elm", scope: !458, file: !271, line: 52, baseType: !202, size: 128, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "actual_irq", scope: !453, file: !443, line: 109, baseType: !70, size: 8, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "first_hrt_entry", scope: !442, file: !443, line: 122, baseType: !7, size: 32, offset: 256)
!473 = !{!474}
!474 = !DISubrange(count: 16)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "num_cpus", scope: !319, file: !320, line: 188, baseType: !43, size: 32, offset: 17408)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "num_ioapics", scope: !319, file: !320, line: 189, baseType: !43, size: 32, offset: 17440)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !319, file: !320, line: 191, baseType: !29, size: 64, offset: 17472)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "core_barrier", scope: !319, file: !320, line: 194, baseType: !479, size: 64, offset: 17536)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_barrier_t", file: !481, line: 34, baseType: !482)
!481 = !DIFile(filename: "include/nautilus/barrier.h", directory: "/home/sgi9754/nautilus-cs446")
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_barrier", file: !481, line: 36, size: 1024, align: 512, elements: !483)
!483 = !{!484, !485, !486, !487, !488, !492}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !482, file: !481, line: 37, baseType: !41, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "remaining", scope: !482, file: !481, line: 39, baseType: !7, size: 32, offset: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "init_count", scope: !482, file: !481, line: 40, baseType: !7, size: 32, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !482, file: !481, line: 42, baseType: !70, size: 8, offset: 96)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !482, file: !481, line: 44, baseType: !489, size: 416, offset: 104)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 416, elements: !490)
!490 = !{!491}
!491 = !DISubrange(count: 52)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !482, file: !481, line: 47, baseType: !493, size: 32, offset: 520)
!493 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !319, file: !320, line: 196, baseType: !495, size: 448, offset: 17600)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_mem_info", file: !496, line: 83, size: 448, elements: !497)
!496 = !DIFile(filename: "include/nautilus/paging.h", directory: "/home/sgi9754/nautilus-cs446")
!497 = !{!498, !500, !501, !502, !503, !504}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "page_map", scope: !495, file: !496, line: 84, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pm_start", scope: !495, file: !496, line: 85, baseType: !449, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pm_end", scope: !495, file: !496, line: 86, baseType: !449, size: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "phys_mem_avail", scope: !495, file: !496, line: 87, baseType: !360, size: 64, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "npages", scope: !495, file: !496, line: 88, baseType: !360, size: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "mem_zone_list", scope: !495, file: !496, line: 90, baseType: !202, size: 128, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_id", scope: !319, file: !320, line: 198, baseType: !43, size: 32, offset: 18048)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pic_mode_enabled", scope: !319, file: !320, line: 200, baseType: !70, size: 8, offset: 18080)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pci", scope: !319, file: !320, line: 202, baseType: !508, size: 64, offset: 18112)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "pci_info", file: !320, line: 202, flags: DIFlagFwdDecl)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "hpet", scope: !319, file: !320, line: 203, baseType: !511, size: 64, offset: 18176)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "hpet_dev", file: !320, line: 178, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mb_info", scope: !319, file: !320, line: 205, baseType: !514, size: 64, offset: 18240)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "multiboot_info", file: !320, line: 205, flags: DIFlagFwdDecl)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "int_info", scope: !319, file: !320, line: 207, baseType: !517, size: 33024, offset: 18304)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_int_info", file: !320, line: 171, size: 33024, elements: !518)
!518 = !{!519, !520, !521}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "int_list", scope: !517, file: !320, line: 172, baseType: !202, size: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "bus_list", scope: !517, file: !320, line: 173, baseType: !202, size: 128, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "irq_map", scope: !517, file: !320, line: 175, baseType: !522, size: 32768, offset: 256)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 32768, elements: !123)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "irq_mapping", file: !320, line: 164, size: 128, elements: !524)
!524 = !{!525, !526, !527}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ioapic", scope: !523, file: !320, line: 165, baseType: !441, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !523, file: !320, line: 166, baseType: !70, size: 8, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "assigned", scope: !523, file: !320, line: 167, baseType: !70, size: 8, offset: 72)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "locality_info", scope: !319, file: !320, line: 209, baseType: !529, size: 8320, offset: 51328)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_locality_info", file: !405, line: 75, size: 8320, elements: !530)
!530 = !{!531, !532, !534}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "num_domains", scope: !529, file: !405, line: 76, baseType: !43, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "numa_matrix", scope: !529, file: !405, line: 77, baseType: !533, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "domains", scope: !529, file: !405, line: 79, baseType: !535, size: 8192, offset: 128)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 8192, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "pmc_info", scope: !319, file: !320, line: 211, baseType: !539, size: 64, offset: 59648)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "pmc_info", file: !320, line: 180, flags: DIFlagFwdDecl)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "linker_info", scope: !319, file: !320, line: 213, baseType: !542, size: 64, offset: 59712)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_link_info", file: !320, line: 181, flags: DIFlagFwdDecl)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "prog_info", scope: !319, file: !320, line: 215, baseType: !545, size: 64, offset: 59776)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_prog_info", file: !320, line: 182, flags: DIFlagFwdDecl)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!548 = !{!"clang version 8.0.0 (tags/RELEASE_800/final)"}
!549 = !{i32 2, !"Dwarf Version", i32 4}
!550 = !{i32 2, !"Debug Info Version", i32 3}
!551 = !{i32 1, !"wchar_size", i32 4}
!552 = !{i32 1, !"Code Model", i32 4}
!553 = distinct !DISubprogram(name: "handle_fibers9", scope: !3, file: !3, line: 533, type: !141, scopeLine: 534, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !554)
!554 = !{!555, !556}
!555 = !DILocalVariable(name: "buf", arg: 1, scope: !553, file: !3, line: 533, type: !137)
!556 = !DILocalVariable(name: "priv", arg: 2, scope: !553, file: !3, line: 533, type: !33)
!557 = !DILocation(line: 533, column: 24, scope: !553)
!558 = !DILocation(line: 533, column: 36, scope: !553)
!559 = !DILocation(line: 451, column: 3, scope: !560, inlinedAt: !565)
!560 = distinct !DISubprogram(name: "test_fiber_routine_2", scope: !3, file: !3, line: 449, type: !561, scopeLine: 450, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !563)
!561 = !DISubroutineType(types: !562)
!562 = !{!50}
!563 = !{!564}
!564 = !DILocalVariable(name: "f_orig", scope: !560, file: !3, line: 451, type: !24)
!565 = distinct !DILocation(line: 535, column: 3, scope: !553)
!566 = !DILocation(line: 258, column: 26, scope: !567, inlinedAt: !575)
!567 = distinct !DILexicalBlock(scope: !568, file: !16, line: 258, column: 26)
!568 = distinct !DILexicalBlock(scope: !569, file: !16, line: 258, column: 26)
!569 = distinct !DISubprogram(name: "get_cur_thread", scope: !16, file: !16, line: 256, type: !570, scopeLine: 257, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !572)
!570 = !DISubroutineType(types: !571)
!571 = !{!72}
!572 = !{!573, !574}
!573 = !DILocalVariable(name: "__r", scope: !568, file: !16, line: 258, type: !86)
!574 = !DILocalVariable(name: "__r", scope: !567, file: !16, line: 258, type: !86)
!575 = distinct !DILocation(line: 452, column: 8, scope: !560, inlinedAt: !565)
!576 = !{i32 -2147275506}
!577 = !DILocation(line: 258, column: 26, scope: !568, inlinedAt: !575)
!578 = !DILocation(line: 452, column: 26, scope: !560, inlinedAt: !565)
!579 = !DILocation(line: 452, column: 6, scope: !560, inlinedAt: !565)
!580 = !DILocation(line: 453, column: 3, scope: !560, inlinedAt: !565)
!581 = !DILocation(line: 451, column: 15, scope: !560, inlinedAt: !565)
!582 = !DILocalVariable(name: "fun", arg: 1, scope: !583, file: !182, line: 693, type: !62)
!583 = distinct !DISubprogram(name: "nk_fiber_start", scope: !182, file: !182, line: 693, type: !584, scopeLine: 693, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !181, retainedNodes: !587)
!584 = !DISubroutineType(types: !585)
!585 = !{!50, !62, !33, !66, !38, !70, !586}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!587 = !{!582, !588, !589, !590, !591, !592}
!588 = !DILocalVariable(name: "input", arg: 2, scope: !583, file: !182, line: 693, type: !33)
!589 = !DILocalVariable(name: "output", arg: 3, scope: !583, file: !182, line: 693, type: !66)
!590 = !DILocalVariable(name: "stack_size", arg: 4, scope: !583, file: !182, line: 693, type: !38)
!591 = !DILocalVariable(name: "random_cpu_flag", arg: 5, scope: !583, file: !182, line: 693, type: !70)
!592 = !DILocalVariable(name: "fiber_output", arg: 6, scope: !583, file: !182, line: 693, type: !586)
!593 = !DILocation(line: 693, column: 35, scope: !583, inlinedAt: !594)
!594 = distinct !DILocation(line: 454, column: 3, scope: !560, inlinedAt: !565)
!595 = !DILocation(line: 693, column: 46, scope: !583, inlinedAt: !594)
!596 = !DILocation(line: 693, column: 60, scope: !583, inlinedAt: !594)
!597 = !DILocation(line: 693, column: 84, scope: !583, inlinedAt: !594)
!598 = !DILocation(line: 693, column: 104, scope: !583, inlinedAt: !594)
!599 = !DILocation(line: 693, column: 134, scope: !583, inlinedAt: !594)
!600 = !DILocalVariable(name: "fun", arg: 1, scope: !601, file: !182, line: 602, type: !62)
!601 = distinct !DISubprogram(name: "nk_fiber_create", scope: !182, file: !182, line: 602, type: !602, scopeLine: 603, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !181, retainedNodes: !604)
!602 = !DISubroutineType(types: !603)
!603 = !{!50, !62, !33, !66, !38, !586}
!604 = !{!600, !605, !606, !607, !608, !609, !610, !611, !613}
!605 = !DILocalVariable(name: "input", arg: 2, scope: !601, file: !182, line: 602, type: !33)
!606 = !DILocalVariable(name: "output", arg: 3, scope: !601, file: !182, line: 602, type: !66)
!607 = !DILocalVariable(name: "stack_size", arg: 4, scope: !601, file: !182, line: 602, type: !38)
!608 = !DILocalVariable(name: "fiber_output", arg: 5, scope: !601, file: !182, line: 602, type: !586)
!609 = !DILocalVariable(name: "fiber", scope: !601, file: !182, line: 605, type: !296)
!610 = !DILocalVariable(name: "required_stack_size", scope: !601, file: !182, line: 608, type: !38)
!611 = !DILocalVariable(name: "p", scope: !612, file: !182, line: 611, type: !33)
!612 = distinct !DILexicalBlock(scope: !601, file: !182, line: 611, column: 11)
!613 = !DILocalVariable(name: "p", scope: !614, file: !182, line: 628, type: !33)
!614 = distinct !DILexicalBlock(scope: !601, file: !182, line: 628, column: 26)
!615 = !DILocation(line: 602, column: 36, scope: !601, inlinedAt: !616)
!616 = distinct !DILocation(line: 695, column: 3, scope: !583, inlinedAt: !594)
!617 = !DILocation(line: 602, column: 47, scope: !601, inlinedAt: !616)
!618 = !DILocation(line: 602, column: 61, scope: !601, inlinedAt: !616)
!619 = !DILocation(line: 602, column: 85, scope: !601, inlinedAt: !616)
!620 = !DILocation(line: 602, column: 110, scope: !601, inlinedAt: !616)
!621 = !DILocation(line: 605, column: 15, scope: !601, inlinedAt: !616)
!622 = !DILocation(line: 608, column: 19, scope: !601, inlinedAt: !616)
!623 = !DILocation(line: 611, column: 11, scope: !612, inlinedAt: !616)
!624 = !DILocation(line: 614, column: 8, scope: !625, inlinedAt: !616)
!625 = distinct !DILexicalBlock(scope: !601, file: !182, line: 614, column: 7)
!626 = !DILocation(line: 614, column: 7, scope: !601, inlinedAt: !616)
!627 = !DILocation(line: 620, column: 3, scope: !601, inlinedAt: !616)
!628 = !DILocation(line: 623, column: 10, scope: !601, inlinedAt: !616)
!629 = !DILocation(line: 623, column: 19, scope: !601, inlinedAt: !616)
!630 = !DILocation(line: 625, column: 10, scope: !601, inlinedAt: !616)
!631 = !DILocation(line: 625, column: 21, scope: !601, inlinedAt: !616)
!632 = !DILocation(line: 628, column: 26, scope: !614, inlinedAt: !616)
!633 = !DILocation(line: 628, column: 10, scope: !601, inlinedAt: !616)
!634 = !DILocation(line: 628, column: 16, scope: !601, inlinedAt: !616)
!635 = !DILocation(line: 631, column: 8, scope: !636, inlinedAt: !616)
!636 = distinct !DILexicalBlock(scope: !601, file: !182, line: 631, column: 7)
!637 = !DILocation(line: 631, column: 7, scope: !601, inlinedAt: !616)
!638 = !DILocation(line: 634, column: 5, scope: !639, inlinedAt: !616)
!639 = distinct !DILexicalBlock(scope: !636, file: !182, line: 631, column: 21)
!640 = !DILocation(line: 635, column: 5, scope: !639, inlinedAt: !616)
!641 = !DILocation(line: 639, column: 10, scope: !601, inlinedAt: !616)
!642 = !DILocation(line: 639, column: 14, scope: !601, inlinedAt: !616)
!643 = !DILocation(line: 640, column: 10, scope: !601, inlinedAt: !616)
!644 = !DILocation(line: 640, column: 16, scope: !601, inlinedAt: !616)
!645 = !DILocation(line: 641, column: 10, scope: !601, inlinedAt: !616)
!646 = !DILocation(line: 641, column: 17, scope: !601, inlinedAt: !616)
!647 = !DILocalVariable(name: "f", arg: 1, scope: !648, file: !182, line: 274, type: !296)
!648 = distinct !DISubprogram(name: "_nk_fiber_init", scope: !182, file: !182, line: 274, type: !649, scopeLine: 275, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !181, retainedNodes: !651)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !296}
!651 = !{!647}
!652 = !DILocation(line: 274, column: 33, scope: !648, inlinedAt: !653)
!653 = distinct !DILocation(line: 644, column: 3, scope: !601, inlinedAt: !616)
!654 = !DILocation(line: 276, column: 37, scope: !648, inlinedAt: !653)
!655 = !DILocation(line: 276, column: 6, scope: !648, inlinedAt: !653)
!656 = !DILocalVariable(name: "f", arg: 1, scope: !657, file: !182, line: 113, type: !296)
!657 = distinct !DISubprogram(name: "_fiber_push", scope: !182, file: !182, line: 113, type: !658, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !181, retainedNodes: !660)
!658 = !DISubroutineType(types: !659)
!659 = !{null, !296, !29}
!660 = !{!656, !661}
!661 = !DILocalVariable(name: "x", arg: 2, scope: !657, file: !182, line: 113, type: !29)
!662 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !663)
!663 = distinct !DILocation(line: 277, column: 3, scope: !648, inlinedAt: !653)
!664 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !663)
!665 = !DILocation(line: 276, column: 32, scope: !648, inlinedAt: !653)
!666 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !663)
!667 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !663)
!668 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !663)
!669 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !670)
!670 = distinct !DILocation(line: 278, column: 3, scope: !648, inlinedAt: !653)
!671 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !670)
!672 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !670)
!673 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !670)
!674 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !670)
!675 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !676)
!676 = distinct !DILocation(line: 279, column: 3, scope: !648, inlinedAt: !653)
!677 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !676)
!678 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !676)
!679 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !676)
!680 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !676)
!681 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !682)
!682 = distinct !DILocation(line: 280, column: 3, scope: !648, inlinedAt: !653)
!683 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !682)
!684 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !682)
!685 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !682)
!686 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !682)
!687 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !688)
!688 = distinct !DILocation(line: 281, column: 3, scope: !648, inlinedAt: !653)
!689 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !688)
!690 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !688)
!691 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !688)
!692 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !688)
!693 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !694)
!694 = distinct !DILocation(line: 282, column: 3, scope: !648, inlinedAt: !653)
!695 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !694)
!696 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !694)
!697 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !694)
!698 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !694)
!699 = !DILocation(line: 283, column: 18, scope: !648, inlinedAt: !653)
!700 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !701)
!701 = distinct !DILocation(line: 283, column: 3, scope: !648, inlinedAt: !653)
!702 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !701)
!703 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !701)
!704 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !701)
!705 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !701)
!706 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !707)
!707 = distinct !DILocation(line: 284, column: 3, scope: !648, inlinedAt: !653)
!708 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !707)
!709 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !707)
!710 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !707)
!711 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !707)
!712 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !713)
!713 = distinct !DILocation(line: 285, column: 3, scope: !648, inlinedAt: !653)
!714 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !713)
!715 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !713)
!716 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !713)
!717 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !713)
!718 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !719)
!719 = distinct !DILocation(line: 286, column: 3, scope: !648, inlinedAt: !653)
!720 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !719)
!721 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !719)
!722 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !719)
!723 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !719)
!724 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !725)
!725 = distinct !DILocation(line: 287, column: 3, scope: !648, inlinedAt: !653)
!726 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !725)
!727 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !725)
!728 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !725)
!729 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !725)
!730 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !731)
!731 = distinct !DILocation(line: 288, column: 3, scope: !648, inlinedAt: !653)
!732 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !731)
!733 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !731)
!734 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !731)
!735 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !731)
!736 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !737)
!737 = distinct !DILocation(line: 289, column: 3, scope: !648, inlinedAt: !653)
!738 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !737)
!739 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !737)
!740 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !737)
!741 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !737)
!742 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !743)
!743 = distinct !DILocation(line: 290, column: 3, scope: !648, inlinedAt: !653)
!744 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !743)
!745 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !743)
!746 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !743)
!747 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !743)
!748 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !749)
!749 = distinct !DILocation(line: 291, column: 3, scope: !648, inlinedAt: !653)
!750 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !749)
!751 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !749)
!752 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !749)
!753 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !749)
!754 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !755)
!755 = distinct !DILocation(line: 292, column: 3, scope: !648, inlinedAt: !653)
!756 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !755)
!757 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !755)
!758 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !755)
!759 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !755)
!760 = !DILocation(line: 648, column: 19, scope: !761, inlinedAt: !616)
!761 = distinct !DILexicalBlock(scope: !762, file: !182, line: 647, column: 20)
!762 = distinct !DILexicalBlock(scope: !601, file: !182, line: 647, column: 7)
!763 = !DILocation(line: 258, column: 26, scope: !764, inlinedAt: !772)
!764 = distinct !DILexicalBlock(scope: !765, file: !16, line: 258, column: 26)
!765 = distinct !DILexicalBlock(scope: !766, file: !16, line: 258, column: 26)
!766 = distinct !DISubprogram(name: "get_cur_thread", scope: !16, file: !16, line: 256, type: !767, scopeLine: 257, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !181, retainedNodes: !769)
!767 = !DISubroutineType(types: !768)
!768 = !{!339}
!769 = !{!770, !771}
!770 = !DILocalVariable(name: "__r", scope: !765, file: !16, line: 258, type: !215)
!771 = !DILocalVariable(name: "__r", scope: !764, file: !16, line: 258, type: !215)
!772 = distinct !DILocation(line: 650, column: 15, scope: !601, inlinedAt: !616)
!773 = !{i32 -2147260791}
!774 = !DILocation(line: 258, column: 26, scope: !765, inlinedAt: !772)
!775 = !DILocation(line: 650, column: 33, scope: !601, inlinedAt: !616)
!776 = !DILocation(line: 650, column: 10, scope: !601, inlinedAt: !616)
!777 = !DILocation(line: 650, column: 13, scope: !601, inlinedAt: !616)
!778 = !DILocation(line: 653, column: 27, scope: !601, inlinedAt: !616)
!779 = !DILocalVariable(name: "list", arg: 1, scope: !780, file: !53, line: 73, type: !205)
!780 = distinct !DISubprogram(name: "INIT_LIST_HEAD", scope: !53, file: !53, line: 73, type: !781, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !181, retainedNodes: !783)
!781 = !DISubroutineType(types: !782)
!782 = !{null, !205}
!783 = !{!779}
!784 = !DILocation(line: 73, column: 53, scope: !780, inlinedAt: !785)
!785 = distinct !DILocation(line: 653, column: 3, scope: !601, inlinedAt: !616)
!786 = !DILocation(line: 75, column: 13, scope: !780, inlinedAt: !785)
!787 = !DILocation(line: 76, column: 8, scope: !780, inlinedAt: !785)
!788 = !DILocation(line: 76, column: 13, scope: !780, inlinedAt: !785)
!789 = !DILocation(line: 656, column: 10, scope: !601, inlinedAt: !616)
!790 = !DILocation(line: 656, column: 19, scope: !601, inlinedAt: !616)
!791 = !DILocation(line: 657, column: 27, scope: !601, inlinedAt: !616)
!792 = !DILocation(line: 73, column: 53, scope: !780, inlinedAt: !793)
!793 = distinct !DILocation(line: 657, column: 3, scope: !601, inlinedAt: !616)
!794 = !DILocation(line: 75, column: 13, scope: !780, inlinedAt: !793)
!795 = !DILocation(line: 76, column: 8, scope: !780, inlinedAt: !793)
!796 = !DILocation(line: 76, column: 13, scope: !780, inlinedAt: !793)
!797 = !DILocation(line: 658, column: 27, scope: !601, inlinedAt: !616)
!798 = !DILocation(line: 73, column: 53, scope: !780, inlinedAt: !799)
!799 = distinct !DILocation(line: 658, column: 3, scope: !601, inlinedAt: !616)
!800 = !DILocation(line: 75, column: 13, scope: !780, inlinedAt: !799)
!801 = !DILocation(line: 76, column: 8, scope: !780, inlinedAt: !799)
!802 = !DILocation(line: 76, column: 13, scope: !780, inlinedAt: !799)
!803 = !DILocation(line: 660, column: 3, scope: !601, inlinedAt: !616)
!804 = !DILocation(line: 0, scope: !601, inlinedAt: !616)
!805 = !DILocation(line: 696, column: 16, scope: !583, inlinedAt: !594)
!806 = !DILocation(line: 696, column: 3, scope: !583, inlinedAt: !594)
!807 = !DILocation(line: 456, column: 1, scope: !560, inlinedAt: !565)
!808 = !DILocation(line: 536, column: 3, scope: !553)
!809 = distinct !DISubprogram(name: "fiber_routine3", scope: !3, file: !3, line: 310, type: !64, scopeLine: 311, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !810)
!810 = !{!811, !812, !813, !814, !815}
!811 = !DILocalVariable(name: "i", arg: 1, scope: !809, file: !3, line: 310, type: !33)
!812 = !DILocalVariable(name: "o", arg: 2, scope: !809, file: !3, line: 310, type: !66)
!813 = !DILocalVariable(name: "a", scope: !809, file: !3, line: 313, type: !50)
!814 = !DILocalVariable(name: "f_new", scope: !809, file: !3, line: 314, type: !24)
!815 = !DILocalVariable(name: "curr", scope: !816, file: !3, line: 318, type: !24)
!816 = distinct !DILexicalBlock(scope: !809, file: !3, line: 315, column: 15)
!817 = !DILocation(line: 310, column: 27, scope: !809)
!818 = !DILocation(line: 310, column: 37, scope: !809)
!819 = !DILocation(line: 312, column: 19, scope: !809)
!820 = !DILocation(line: 312, column: 3, scope: !809)
!821 = !DILocation(line: 313, column: 7, scope: !809)
!822 = !DILocation(line: 316, column: 13, scope: !816)
!823 = !DILocation(line: 314, column: 15, scope: !809)
!824 = !DILocation(line: 318, column: 17, scope: !816)
!825 = !DILocation(line: 319, column: 5, scope: !816)
!826 = !DILocation(line: 732, column: 3, scope: !827, inlinedAt: !829)
!827 = distinct !DISubprogram(name: "wrapper_nk_fiber_yield", scope: !182, file: !182, line: 730, type: !561, scopeLine: 731, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !181, retainedNodes: !828)
!828 = !{}
!829 = distinct !DILocation(line: 314, column: 15, scope: !809)
!830 = !DILocation(line: 129, column: 25, scope: !831, inlinedAt: !835)
!831 = distinct !DISubprogram(name: "get_cpu", scope: !832, file: !832, line: 127, type: !833, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !181, retainedNodes: !828)
!832 = !DIFile(filename: "include/nautilus/percpu.h", directory: "/home/sgi9754/nautilus-cs446")
!833 = !DISubroutineType(types: !834)
!834 = !{!324}
!835 = distinct !DILocation(line: 78, column: 10, scope: !836, inlinedAt: !841)
!836 = distinct !DISubprogram(name: "_get_fiber_state", scope: !182, file: !182, line: 76, type: !837, scopeLine: 77, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !181, retainedNodes: !828)
!837 = !DISubroutineType(types: !838)
!838 = !{!839}
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "fiber_state", file: !182, line: 66, baseType: !335)
!841 = distinct !DILocation(line: 98, column: 10, scope: !842, inlinedAt: !843)
!842 = distinct !DISubprogram(name: "_get_fiber_thread", scope: !182, file: !182, line: 96, type: !767, scopeLine: 97, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !181, retainedNodes: !828)
!843 = distinct !DILocation(line: 704, column: 7, scope: !844, inlinedAt: !848)
!844 = distinct !DILexicalBlock(scope: !845, file: !182, line: 704, column: 7)
!845 = distinct !DISubprogram(name: "nk_fiber_yield", scope: !182, file: !182, line: 702, type: !561, scopeLine: 703, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !181, retainedNodes: !846)
!846 = !{!847}
!847 = !DILocalVariable(name: "f_to", scope: !845, file: !182, line: 708, type: !296)
!848 = distinct !DILocation(line: 733, column: 10, scope: !827, inlinedAt: !829)
!849 = !DILocation(line: 129, column: 12, scope: !831, inlinedAt: !835)
!850 = !DILocation(line: 78, column: 21, scope: !836, inlinedAt: !841)
!851 = !DILocation(line: 98, column: 30, scope: !842, inlinedAt: !843)
!852 = !DILocation(line: 258, column: 26, scope: !764, inlinedAt: !853)
!853 = distinct !DILocation(line: 704, column: 30, scope: !844, inlinedAt: !848)
!854 = !DILocation(line: 258, column: 26, scope: !765, inlinedAt: !853)
!855 = !DILocation(line: 704, column: 27, scope: !844, inlinedAt: !848)
!856 = !DILocation(line: 704, column: 7, scope: !845, inlinedAt: !848)
!857 = !DILocation(line: 129, column: 25, scope: !831, inlinedAt: !858)
!858 = distinct !DILocation(line: 78, column: 10, scope: !836, inlinedAt: !859)
!859 = distinct !DILocation(line: 105, column: 12, scope: !860, inlinedAt: !863)
!860 = distinct !DISubprogram(name: "_get_sched_head", scope: !182, file: !182, line: 103, type: !861, scopeLine: 104, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !181, retainedNodes: !828)
!861 = !DISubroutineType(types: !862)
!862 = !{!205}
!863 = distinct !DILocation(line: 122, column: 41, scope: !864, inlinedAt: !880)
!864 = distinct !DISubprogram(name: "_rr_policy", scope: !182, file: !182, line: 119, type: !865, scopeLine: 120, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !181, retainedNodes: !867)
!865 = !DISubroutineType(types: !866)
!866 = !{!296}
!867 = !{!868, !869, !870, !874}
!868 = !DILocalVariable(name: "fiber_sched_queue", scope: !864, file: !182, line: 122, type: !205)
!869 = !DILocalVariable(name: "fiber_to_schedule", scope: !864, file: !182, line: 125, type: !296)
!870 = !DILocalVariable(name: "first", scope: !871, file: !182, line: 128, type: !296)
!871 = distinct !DILexicalBlock(scope: !872, file: !182, line: 128, column: 25)
!872 = distinct !DILexicalBlock(scope: !873, file: !182, line: 126, column: 40)
!873 = distinct !DILexicalBlock(scope: !864, file: !182, line: 126, column: 7)
!874 = !DILocalVariable(name: "__mptr", scope: !875, file: !182, line: 128, type: !878)
!875 = distinct !DILexicalBlock(scope: !876, file: !182, line: 128, column: 25)
!876 = distinct !DILexicalBlock(scope: !877, file: !182, line: 128, column: 25)
!877 = distinct !DILexicalBlock(scope: !871, file: !182, line: 128, column: 25)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !202)
!880 = distinct !DILocation(line: 708, column: 22, scope: !845, inlinedAt: !848)
!881 = !DILocation(line: 129, column: 12, scope: !831, inlinedAt: !858)
!882 = !DILocation(line: 78, column: 21, scope: !836, inlinedAt: !859)
!883 = !DILocation(line: 105, column: 32, scope: !860, inlinedAt: !863)
!884 = !DILocation(line: 122, column: 21, scope: !864, inlinedAt: !880)
!885 = !DILocation(line: 125, column: 15, scope: !864, inlinedAt: !880)
!886 = !DILocalVariable(name: "head", arg: 1, scope: !887, file: !53, line: 184, type: !878)
!887 = distinct !DISubprogram(name: "list_empty", scope: !53, file: !53, line: 184, type: !888, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !181, retainedNodes: !890)
!888 = !DISubroutineType(types: !889)
!889 = !{!50, !878}
!890 = !{!886}
!891 = !DILocation(line: 184, column: 54, scope: !887, inlinedAt: !892)
!892 = distinct !DILocation(line: 126, column: 9, scope: !873, inlinedAt: !880)
!893 = !DILocation(line: 186, column: 15, scope: !887, inlinedAt: !892)
!894 = !DILocation(line: 186, column: 20, scope: !887, inlinedAt: !892)
!895 = !DILocation(line: 126, column: 7, scope: !864, inlinedAt: !880)
!896 = !DILocation(line: 128, column: 25, scope: !871, inlinedAt: !880)
!897 = !DILocation(line: 131, column: 40, scope: !872, inlinedAt: !880)
!898 = !DILocalVariable(name: "entry", arg: 1, scope: !899, file: !53, line: 151, type: !205)
!899 = distinct !DISubprogram(name: "list_del_init", scope: !53, file: !53, line: 151, type: !781, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !181, retainedNodes: !900)
!900 = !{!898}
!901 = !DILocation(line: 151, column: 52, scope: !899, inlinedAt: !902)
!902 = distinct !DILocation(line: 131, column: 5, scope: !872, inlinedAt: !880)
!903 = !DILocation(line: 153, column: 20, scope: !899, inlinedAt: !902)
!904 = !DILocation(line: 153, column: 33, scope: !899, inlinedAt: !902)
!905 = !DILocalVariable(name: "prev", arg: 1, scope: !906, file: !53, line: 128, type: !205)
!906 = distinct !DISubprogram(name: "__list_del", scope: !53, file: !53, line: 128, type: !907, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !181, retainedNodes: !909)
!907 = !DISubroutineType(types: !908)
!908 = !{null, !205, !205}
!909 = !{!905, !910}
!910 = !DILocalVariable(name: "next", arg: 2, scope: !906, file: !53, line: 128, type: !205)
!911 = !DILocation(line: 128, column: 50, scope: !906, inlinedAt: !912)
!912 = distinct !DILocation(line: 153, column: 2, scope: !899, inlinedAt: !902)
!913 = !DILocation(line: 128, column: 75, scope: !906, inlinedAt: !912)
!914 = !DILocation(line: 130, column: 8, scope: !906, inlinedAt: !912)
!915 = !DILocation(line: 130, column: 13, scope: !906, inlinedAt: !912)
!916 = !DILocation(line: 131, column: 8, scope: !906, inlinedAt: !912)
!917 = !DILocation(line: 131, column: 13, scope: !906, inlinedAt: !912)
!918 = !DILocation(line: 73, column: 53, scope: !780, inlinedAt: !919)
!919 = distinct !DILocation(line: 154, column: 2, scope: !899, inlinedAt: !902)
!920 = !DILocation(line: 75, column: 13, scope: !780, inlinedAt: !919)
!921 = !DILocation(line: 76, column: 13, scope: !780, inlinedAt: !919)
!922 = !DILocation(line: 708, column: 15, scope: !845, inlinedAt: !848)
!923 = !DILocation(line: 718, column: 12, scope: !924, inlinedAt: !848)
!924 = distinct !DILexicalBlock(scope: !845, file: !182, line: 718, column: 7)
!925 = !DILocation(line: 718, column: 7, scope: !845, inlinedAt: !848)
!926 = !DILocation(line: 129, column: 25, scope: !831, inlinedAt: !927)
!927 = distinct !DILocation(line: 78, column: 10, scope: !836, inlinedAt: !928)
!928 = distinct !DILocation(line: 85, column: 10, scope: !929, inlinedAt: !930)
!929 = distinct !DISubprogram(name: "nk_fiber_current", scope: !182, file: !182, line: 83, type: !865, scopeLine: 84, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !181, retainedNodes: !828)
!930 = distinct !DILocation(line: 719, column: 9, scope: !931, inlinedAt: !848)
!931 = distinct !DILexicalBlock(scope: !932, file: !182, line: 719, column: 9)
!932 = distinct !DILexicalBlock(scope: !924, file: !182, line: 718, column: 21)
!933 = !DILocation(line: 129, column: 12, scope: !831, inlinedAt: !927)
!934 = !DILocation(line: 78, column: 21, scope: !836, inlinedAt: !928)
!935 = !DILocation(line: 85, column: 30, scope: !929, inlinedAt: !930)
!936 = !DILocation(line: 129, column: 25, scope: !831, inlinedAt: !937)
!937 = distinct !DILocation(line: 78, column: 10, scope: !836, inlinedAt: !938)
!938 = distinct !DILocation(line: 92, column: 10, scope: !939, inlinedAt: !940)
!939 = distinct !DISubprogram(name: "_nk_idle_fiber", scope: !182, file: !182, line: 90, type: !865, scopeLine: 91, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !181, retainedNodes: !828)
!940 = distinct !DILocation(line: 719, column: 31, scope: !931, inlinedAt: !848)
!941 = !DILocation(line: 129, column: 12, scope: !831, inlinedAt: !937)
!942 = !DILocation(line: 78, column: 21, scope: !836, inlinedAt: !938)
!943 = !DILocation(line: 92, column: 30, scope: !939, inlinedAt: !940)
!944 = !DILocation(line: 719, column: 28, scope: !931, inlinedAt: !848)
!945 = !DILocation(line: 719, column: 9, scope: !932, inlinedAt: !848)
!946 = !DILocation(line: 129, column: 25, scope: !831, inlinedAt: !947)
!947 = distinct !DILocation(line: 78, column: 10, scope: !836, inlinedAt: !948)
!948 = distinct !DILocation(line: 92, column: 10, scope: !939, inlinedAt: !949)
!949 = distinct !DILocation(line: 723, column: 16, scope: !950, inlinedAt: !848)
!950 = distinct !DILexicalBlock(scope: !931, file: !182, line: 722, column: 12)
!951 = !DILocation(line: 129, column: 12, scope: !831, inlinedAt: !947)
!952 = !DILocation(line: 78, column: 21, scope: !836, inlinedAt: !948)
!953 = !DILocation(line: 92, column: 30, scope: !939, inlinedAt: !949)
!954 = !DILocation(line: 725, column: 3, scope: !932, inlinedAt: !848)
!955 = !DILocation(line: 0, scope: !845, inlinedAt: !848)
!956 = !DILocation(line: 727, column: 10, scope: !845, inlinedAt: !848)
!957 = !DILocation(line: 727, column: 3, scope: !845, inlinedAt: !848)
!958 = !DILocation(line: 322, column: 3, scope: !809)
!959 = !DILocation(line: 323, column: 1, scope: !809)
!960 = distinct !DISubprogram(name: "handle_fibers8", scope: !3, file: !3, line: 526, type: !141, scopeLine: 527, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !961)
!961 = !{!962, !963}
!962 = !DILocalVariable(name: "buf", arg: 1, scope: !960, file: !3, line: 526, type: !137)
!963 = !DILocalVariable(name: "priv", arg: 2, scope: !960, file: !3, line: 526, type: !33)
!964 = !DILocation(line: 526, column: 24, scope: !960)
!965 = !DILocation(line: 526, column: 36, scope: !960)
!966 = !DILocation(line: 442, column: 3, scope: !967, inlinedAt: !970)
!967 = distinct !DISubprogram(name: "test_fiber_routine", scope: !3, file: !3, line: 440, type: !561, scopeLine: 441, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !968)
!968 = !{!969}
!969 = !DILocalVariable(name: "f_orig", scope: !967, file: !3, line: 442, type: !24)
!970 = distinct !DILocation(line: 528, column: 3, scope: !960)
!971 = !DILocation(line: 258, column: 26, scope: !567, inlinedAt: !972)
!972 = distinct !DILocation(line: 443, column: 8, scope: !967, inlinedAt: !970)
!973 = !DILocation(line: 258, column: 26, scope: !568, inlinedAt: !972)
!974 = !DILocation(line: 443, column: 26, scope: !967, inlinedAt: !970)
!975 = !DILocation(line: 443, column: 6, scope: !967, inlinedAt: !970)
!976 = !DILocation(line: 444, column: 3, scope: !967, inlinedAt: !970)
!977 = !DILocation(line: 442, column: 15, scope: !967, inlinedAt: !970)
!978 = !DILocation(line: 693, column: 35, scope: !583, inlinedAt: !979)
!979 = distinct !DILocation(line: 445, column: 3, scope: !967, inlinedAt: !970)
!980 = !DILocation(line: 693, column: 46, scope: !583, inlinedAt: !979)
!981 = !DILocation(line: 693, column: 60, scope: !583, inlinedAt: !979)
!982 = !DILocation(line: 693, column: 84, scope: !583, inlinedAt: !979)
!983 = !DILocation(line: 693, column: 104, scope: !583, inlinedAt: !979)
!984 = !DILocation(line: 693, column: 134, scope: !583, inlinedAt: !979)
!985 = !DILocation(line: 602, column: 36, scope: !601, inlinedAt: !986)
!986 = distinct !DILocation(line: 695, column: 3, scope: !583, inlinedAt: !979)
!987 = !DILocation(line: 602, column: 47, scope: !601, inlinedAt: !986)
!988 = !DILocation(line: 602, column: 61, scope: !601, inlinedAt: !986)
!989 = !DILocation(line: 602, column: 85, scope: !601, inlinedAt: !986)
!990 = !DILocation(line: 602, column: 110, scope: !601, inlinedAt: !986)
!991 = !DILocation(line: 605, column: 15, scope: !601, inlinedAt: !986)
!992 = !DILocation(line: 608, column: 19, scope: !601, inlinedAt: !986)
!993 = !DILocation(line: 611, column: 11, scope: !612, inlinedAt: !986)
!994 = !DILocation(line: 614, column: 8, scope: !625, inlinedAt: !986)
!995 = !DILocation(line: 614, column: 7, scope: !601, inlinedAt: !986)
!996 = !DILocation(line: 620, column: 3, scope: !601, inlinedAt: !986)
!997 = !DILocation(line: 623, column: 10, scope: !601, inlinedAt: !986)
!998 = !DILocation(line: 623, column: 19, scope: !601, inlinedAt: !986)
!999 = !DILocation(line: 625, column: 10, scope: !601, inlinedAt: !986)
!1000 = !DILocation(line: 625, column: 21, scope: !601, inlinedAt: !986)
!1001 = !DILocation(line: 628, column: 26, scope: !614, inlinedAt: !986)
!1002 = !DILocation(line: 628, column: 10, scope: !601, inlinedAt: !986)
!1003 = !DILocation(line: 628, column: 16, scope: !601, inlinedAt: !986)
!1004 = !DILocation(line: 631, column: 8, scope: !636, inlinedAt: !986)
!1005 = !DILocation(line: 631, column: 7, scope: !601, inlinedAt: !986)
!1006 = !DILocation(line: 634, column: 5, scope: !639, inlinedAt: !986)
!1007 = !DILocation(line: 635, column: 5, scope: !639, inlinedAt: !986)
!1008 = !DILocation(line: 639, column: 10, scope: !601, inlinedAt: !986)
!1009 = !DILocation(line: 639, column: 14, scope: !601, inlinedAt: !986)
!1010 = !DILocation(line: 640, column: 10, scope: !601, inlinedAt: !986)
!1011 = !DILocation(line: 640, column: 16, scope: !601, inlinedAt: !986)
!1012 = !DILocation(line: 641, column: 10, scope: !601, inlinedAt: !986)
!1013 = !DILocation(line: 641, column: 17, scope: !601, inlinedAt: !986)
!1014 = !DILocation(line: 274, column: 33, scope: !648, inlinedAt: !1015)
!1015 = distinct !DILocation(line: 644, column: 3, scope: !601, inlinedAt: !986)
!1016 = !DILocation(line: 276, column: 37, scope: !648, inlinedAt: !1015)
!1017 = !DILocation(line: 276, column: 6, scope: !648, inlinedAt: !1015)
!1018 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !1019)
!1019 = distinct !DILocation(line: 277, column: 3, scope: !648, inlinedAt: !1015)
!1020 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !1019)
!1021 = !DILocation(line: 276, column: 32, scope: !648, inlinedAt: !1015)
!1022 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !1019)
!1023 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !1019)
!1024 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !1019)
!1025 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !1026)
!1026 = distinct !DILocation(line: 278, column: 3, scope: !648, inlinedAt: !1015)
!1027 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !1026)
!1028 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !1026)
!1029 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !1026)
!1030 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !1026)
!1031 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !1032)
!1032 = distinct !DILocation(line: 279, column: 3, scope: !648, inlinedAt: !1015)
!1033 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !1032)
!1034 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !1032)
!1035 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !1032)
!1036 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !1032)
!1037 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !1038)
!1038 = distinct !DILocation(line: 280, column: 3, scope: !648, inlinedAt: !1015)
!1039 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !1038)
!1040 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !1038)
!1041 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !1038)
!1042 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !1038)
!1043 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !1044)
!1044 = distinct !DILocation(line: 281, column: 3, scope: !648, inlinedAt: !1015)
!1045 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !1044)
!1046 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !1044)
!1047 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !1044)
!1048 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !1044)
!1049 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !1050)
!1050 = distinct !DILocation(line: 282, column: 3, scope: !648, inlinedAt: !1015)
!1051 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !1050)
!1052 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !1050)
!1053 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !1050)
!1054 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !1050)
!1055 = !DILocation(line: 283, column: 18, scope: !648, inlinedAt: !1015)
!1056 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !1057)
!1057 = distinct !DILocation(line: 283, column: 3, scope: !648, inlinedAt: !1015)
!1058 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !1057)
!1059 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !1057)
!1060 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !1057)
!1061 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !1057)
!1062 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !1063)
!1063 = distinct !DILocation(line: 284, column: 3, scope: !648, inlinedAt: !1015)
!1064 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !1063)
!1065 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !1063)
!1066 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !1063)
!1067 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !1063)
!1068 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !1069)
!1069 = distinct !DILocation(line: 285, column: 3, scope: !648, inlinedAt: !1015)
!1070 = !DILocation(line: 113, column: 43, scope: !657, inlinedAt: !1069)
!1071 = !DILocation(line: 115, column: 12, scope: !657, inlinedAt: !1069)
!1072 = !DILocation(line: 116, column: 6, scope: !657, inlinedAt: !1069)
!1073 = !DILocation(line: 116, column: 26, scope: !657, inlinedAt: !1069)
!1074 = !DILocation(line: 113, column: 31, scope: !657, inlinedAt: !1075)
!1075 = distinct !DILocation(line: 286, column: 3, scope: !648, inlinedAt: !1015)
