; ModuleID = 'src/test/fibers_link.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.nk_virtual_console = type opaque
%struct.shell_cmd_impl = type { i8*, i8*, i32 (i8*, i8*)* }
%struct.naut_info = type { %struct.sys_info, %struct.cmdline_state*, %struct.nk_test_harness* }
%struct.sys_info = type { [256 x %struct.cpu*], [16 x %struct.ioapic*], i32, i32, i64, %struct.nk_barrier*, %struct.nk_mem_info, i32, i8, %struct.pci_info*, %struct.hpet_dev*, %struct.multiboot_info*, %struct.nk_int_info, %struct.nk_locality_info, %struct.pmc_info*, %struct.nk_link_info*, %struct.nk_prog_info* }
%struct.cpu = type { %struct.nk_thread*, i16, i16, i64, i64, %struct.nk_fiber_percpu_state*, i32, i32, i8, i8, i32, i32, i8, %struct.apic_dev*, %struct.sys_info*, i32, %struct.nk_sched_percpu_state*, %struct.nk_queue*, %struct.nk_xcall, i64, %struct.nk_topo_params*, %struct.nk_cpu_coords*, %struct.numa_domain*, %struct.nk_queue_entry, %struct.nk_rand_info* }
%struct.nk_thread = type { i64, i8*, i16, i16, i64, i64, i32, %struct.nk_thread*, %struct.list_head, %struct.list_head, i64, %struct.nk_wait_queue*, i32, %struct.nk_timer*, i32, i32, i32, i32, i8, i8**, i8*, i8*, void (i8*, i8**)*, %struct.nk_sched_thread_state*, %struct.nk_virtual_console*, [32 x i8], [256 x i8*], [32 x i8], [4096 x i8] }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "vc", scope: !2, file: !3, line: 43, type: !47, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 8.0.0 (tags/RELEASE_800/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !23, globals: !129, nameTableKind: None)
!3 = !DIFile(filename: "src/test/fibers.c", directory: "/home/sgi9754/nautilus-cs446")
!4 = !{!5, !15}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "include/nautilus/fiber.h", directory: "/home/sgi9754/nautilus-cs446")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "INIT", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "READY", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "YIELD", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "WAIT", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "EXIT", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "RUN", value: 5, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 166, baseType: !7, size: 32, elements: !17)
!16 = !DIFile(filename: "include/nautilus/thread.h", directory: "/home/sgi9754/nautilus-cs446")
!17 = !{!18, !19, !20, !21, !22}
!18 = !DIEnumerator(name: "NK_THR_INIT", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "NK_THR_RUNNING", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "NK_THR_WAITING", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "NK_THR_SUSPENDED", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "NK_THR_EXITED", value: 4, isUnsigned: true)
!23 = !{!24, !29, !72, !86}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_fiber_t", file: !6, line: 104, baseType: !26)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_fiber", file: !6, line: 70, size: 1216, elements: !27)
!27 = !{!28, !32, !34, !37, !39, !40, !44, !46, !49, !51, !58, !59, !60, !61, !67, !68, !69}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "rsp", scope: !26, file: !6, line: 71, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !30, line: 50, baseType: !31)
!30 = !DIFile(filename: "include/nautilus/naut_types.h", directory: "/home/sgi9754/nautilus-cs446")
!31 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !26, file: !6, line: 72, baseType: !33, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_state_offset", scope: !26, file: !6, line: 73, baseType: !35, size: 16, offset: 128)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !30, line: 58, baseType: !36)
!36 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !26, file: !6, line: 75, baseType: !38, size: 64, offset: 192)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_stack_size_t", file: !6, line: 43, baseType: !29)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !26, file: !6, line: 76, baseType: !31, size: 64, offset: 256)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !26, file: !6, line: 78, baseType: !41, size: 32, offset: 320)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !42, line: 39, baseType: !43)
!42 = !DIFile(filename: "include/nautilus/spinlock.h", directory: "/home/sgi9754/nautilus-cs446")
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !30, line: 54, baseType: !7)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "f_status", scope: !26, file: !6, line: 79, baseType: !45, size: 32, offset: 352)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_fiber_status", file: !6, line: 66, baseType: !5)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "vc", scope: !26, file: !6, line: 82, baseType: !47, size: 64, offset: 384)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_virtual_console", file: !6, line: 82, flags: DIFlagFwdDecl)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "is_idle", scope: !26, file: !6, line: 83, baseType: !50, size: 32, offset: 448)
!50 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "wait_queue", scope: !26, file: !6, line: 91, baseType: !52, size: 128, offset: 512)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !53, line: 64, size: 128, elements: !54)
!53 = !DIFile(filename: "include/nautilus/list.h", directory: "/home/sgi9754/nautilus-cs446")
!54 = !{!55, !57}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !52, file: !53, line: 65, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !52, file: !53, line: 65, baseType: !56, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "wait_node", scope: !26, file: !6, line: 92, baseType: !52, size: 128, offset: 640)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "num_wait", scope: !26, file: !6, line: 93, baseType: !50, size: 32, offset: 768)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "sched_node", scope: !26, file: !6, line: 97, baseType: !52, size: 128, offset: 832)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !26, file: !6, line: 99, baseType: !62, size: 64, offset: 960)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_fiber_fun_t", file: !6, line: 56, baseType: !63)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !33, !66}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !26, file: !6, line: 100, baseType: !33, size: 64, offset: 1024)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !26, file: !6, line: 101, baseType: !66, size: 64, offset: 1088)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "is_done", scope: !26, file: !6, line: 103, baseType: !70, size: 8, offset: 1152)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !30, line: 61, baseType: !71)
!71 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_thread_t", file: !16, line: 233, baseType: !74)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_thread", file: !16, line: 178, size: 51200, elements: !75)
!75 = !{!76, !77, !78, !79, !82, !83, !84, !85, !87, !88, !89, !90, !94, !95, !98, !100, !101, !102, !103, !104, !105, !106, !107, !109, !113, !114, !119, !125}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "rsp", scope: !74, file: !16, line: 179, baseType: !29, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !74, file: !16, line: 180, baseType: !33, size: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_state_offset", scope: !74, file: !16, line: 181, baseType: !35, size: 16, offset: 128)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "cache_part_state", scope: !74, file: !16, line: 183, baseType: !80, size: 16, offset: 144)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_cache_part_thread_state_t", file: !81, line: 32, baseType: !35)
!81 = !DIFile(filename: "include/nautilus/cachepart.h", directory: "/home/sgi9754/nautilus-cs446")
!82 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !74, file: !16, line: 185, baseType: !38, size: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !74, file: !16, line: 186, baseType: !31, size: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !74, file: !16, line: 188, baseType: !50, size: 32, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !74, file: !16, line: 191, baseType: !86, size: 64, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !74, file: !16, line: 192, baseType: !52, size: 128, offset: 448)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "child_node", scope: !74, file: !16, line: 193, baseType: !52, size: 128, offset: 576)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !74, file: !16, line: 194, baseType: !31, size: 64, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !74, file: !16, line: 196, baseType: !91, size: 64, offset: 768)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_wait_queue_t", file: !16, line: 175, baseType: !93)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_wait_queue", file: !16, line: 175, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "num_wait", scope: !74, file: !16, line: 198, baseType: !50, size: 32, offset: 832)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !74, file: !16, line: 201, baseType: !96, size: 64, offset: 896)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_timer", file: !16, line: 201, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !74, file: !16, line: 204, baseType: !99, size: 32, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_thread_status_t", file: !16, line: 172, baseType: !15)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "bound_cpu", scope: !74, file: !16, line: 206, baseType: !50, size: 32, offset: 992)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "placement_cpu", scope: !74, file: !16, line: 207, baseType: !50, size: 32, offset: 1024)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "current_cpu", scope: !74, file: !16, line: 208, baseType: !50, size: 32, offset: 1056)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "is_idle", scope: !74, file: !16, line: 210, baseType: !70, size: 8, offset: 1088)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "output_loc", scope: !74, file: !16, line: 212, baseType: !66, size: 64, offset: 1152)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !74, file: !16, line: 213, baseType: !33, size: 64, offset: 1216)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !74, file: !16, line: 214, baseType: !33, size: 64, offset: 1280)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !74, file: !16, line: 215, baseType: !108, size: 64, offset: 1344)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_thread_fun_t", file: !16, line: 61, baseType: !63)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "sched_state", scope: !74, file: !16, line: 217, baseType: !110, size: 64, offset: 1408)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_sched_thread_state", file: !112, line: 99, flags: DIFlagFwdDecl)
!112 = !DIFile(filename: "include/nautilus/scheduler.h", directory: "/home/sgi9754/nautilus-cs446")
!113 = !DIDerivedType(tag: DW_TAG_member, name: "vc", scope: !74, file: !16, line: 219, baseType: !47, size: 64, offset: 1472)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !74, file: !16, line: 225, baseType: !115, size: 256, offset: 1536)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !116, size: 256, elements: !117)
!116 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!117 = !{!118}
!118 = !DISubrange(count: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !74, file: !16, line: 227, baseType: !120, size: 16384, offset: 1792)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !121, size: 16384, elements: !123)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!123 = !{!124}
!124 = !DISubrange(count: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_state", scope: !74, file: !16, line: 229, baseType: !126, size: 32768, align: 512, offset: 18432)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 32768, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 4096)
!129 = !{!130, !143, !145, !147, !149, !151, !153, !155, !157, !159, !0, !161, !163, !165, !167, !169, !171, !173, !175, !177, !179}
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl", scope: !2, file: !3, line: 612, type: !132, isLocal: true, isDefinition: true, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "shell_cmd_impl", file: !134, line: 43, size: 192, elements: !135)
!134 = !DIFile(filename: "include/nautilus/shell.h", directory: "/home/sgi9754/nautilus-cs446")
!135 = !{!136, !138, !139}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !133, file: !134, line: 44, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "help_str", scope: !133, file: !134, line: 45, baseType: !137, size: 64, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !133, file: !134, line: 46, baseType: !140, size: 64, offset: 128)
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !141, size: 64)
!141 = !DISubroutineType(types: !142)
!142 = !{!50, !137, !33}
!143 = !DIGlobalVariableExpression(var: !144, expr: !DIExpression())
!144 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl2", scope: !2, file: !3, line: 613, type: !132, isLocal: true, isDefinition: true, align: 64)
!145 = !DIGlobalVariableExpression(var: !146, expr: !DIExpression())
!146 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl3", scope: !2, file: !3, line: 614, type: !132, isLocal: true, isDefinition: true, align: 64)
!147 = !DIGlobalVariableExpression(var: !148, expr: !DIExpression())
!148 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl4", scope: !2, file: !3, line: 615, type: !132, isLocal: true, isDefinition: true, align: 64)
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl5", scope: !2, file: !3, line: 616, type: !132, isLocal: true, isDefinition: true, align: 64)
!151 = !DIGlobalVariableExpression(var: !152, expr: !DIExpression())
!152 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl6", scope: !2, file: !3, line: 617, type: !132, isLocal: true, isDefinition: true, align: 64)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl7", scope: !2, file: !3, line: 618, type: !132, isLocal: true, isDefinition: true, align: 64)
!155 = !DIGlobalVariableExpression(var: !156, expr: !DIExpression())
!156 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl8", scope: !2, file: !3, line: 619, type: !132, isLocal: true, isDefinition: true, align: 64)
!157 = !DIGlobalVariableExpression(var: !158, expr: !DIExpression())
!158 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl9", scope: !2, file: !3, line: 620, type: !132, isLocal: true, isDefinition: true, align: 64)
!159 = !DIGlobalVariableExpression(var: !160, expr: !DIExpression())
!160 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl10", scope: !2, file: !3, line: 621, type: !132, isLocal: true, isDefinition: true, align: 64)
!161 = !DIGlobalVariableExpression(var: !162, expr: !DIExpression())
!162 = distinct !DIGlobalVariable(name: "fibers_impl", scope: !2, file: !3, line: 549, type: !133, isLocal: true, isDefinition: true)
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "fibers_impl2", scope: !2, file: !3, line: 555, type: !133, isLocal: true, isDefinition: true)
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "fibers_impl3", scope: !2, file: !3, line: 561, type: !133, isLocal: true, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "fibers_impl4", scope: !2, file: !3, line: 567, type: !133, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "fibers_impl5", scope: !2, file: !3, line: 573, type: !133, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "fibers_impl6", scope: !2, file: !3, line: 579, type: !133, isLocal: true, isDefinition: true)
!173 = !DIGlobalVariableExpression(var: !174, expr: !DIExpression())
!174 = distinct !DIGlobalVariable(name: "fibers_impl7", scope: !2, file: !3, line: 585, type: !133, isLocal: true, isDefinition: true)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "fibers_impl8", scope: !2, file: !3, line: 591, type: !133, isLocal: true, isDefinition: true)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "fibers_impl9", scope: !2, file: !3, line: 597, type: !133, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "fibers_impl10", scope: !2, file: !3, line: 603, type: !133, isLocal: true, isDefinition: true)
!181 = distinct !DICompileUnit(language: DW_LANG_C99, file: !182, producer: "clang version 8.0.0 (tags/RELEASE_800/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !183, retainedTypes: !294, nameTableKind: None)
!182 = !DIFile(filename: "src/nautilus/fiber.c", directory: "/home/sgi9754/nautilus-cs446")
!183 = !{!184, !15, !5, !263, !270, !277, !283, !289}
!184 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !186, file: !185, line: 40, baseType: !7, size: 32, elements: !259)
!185 = !DIFile(filename: "include/nautilus/timer.h", directory: "/home/sgi9754/nautilus-cs446")
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_timer", file: !185, line: 38, size: 960, elements: !187)
!187 = !{!188, !189, !191, !192, !193, !251, !252, !256, !257, !258}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !186, file: !185, line: 39, baseType: !115, size: 256)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !186, file: !185, line: 42, baseType: !190, size: 32, offset: 256)
!190 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !184)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !186, file: !185, line: 43, baseType: !29, size: 64, offset: 320)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "time_ns", scope: !186, file: !185, line: 44, baseType: !29, size: 64, offset: 384)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !186, file: !185, line: 45, baseType: !194, size: 64, offset: 448)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_wait_queue_t", file: !185, line: 33, baseType: !196)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_wait_queue", file: !197, line: 85, size: 197248, elements: !198)
!197 = !DIFile(filename: "include/nautilus/waitqueue.h", directory: "/home/sgi9754/nautilus-cs446")
!198 = !{!199, !200, !201, !207, !208, !209}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !196, file: !197, line: 86, baseType: !115, size: 256)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !196, file: !197, line: 87, baseType: !41, size: 32, offset: 256)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !196, file: !197, line: 88, baseType: !202, size: 128, offset: 320)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !53, line: 64, size: 128, elements: !203)
!203 = !{!204, !206}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !202, file: !53, line: 65, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !202, file: !53, line: 65, baseType: !205, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "num_wait", scope: !196, file: !197, line: 89, baseType: !29, size: 64, offset: 448)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !196, file: !197, line: 90, baseType: !202, size: 128, offset: 512)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !196, file: !197, line: 91, baseType: !210, size: 196608, offset: 640)
!210 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 196608, elements: !249)
!211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_wait_queue_entry", file: !197, line: 70, size: 192, elements: !212)
!212 = !{!213, !214}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !211, file: !197, line: 71, baseType: !202, size: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !211, file: !197, line: 72, baseType: !215, size: 64, offset: 128)
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_thread", file: !16, line: 178, size: 51200, elements: !217)
!217 = !{!218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !232, !233, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "rsp", scope: !216, file: !16, line: 179, baseType: !29, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !216, file: !16, line: 180, baseType: !33, size: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_state_offset", scope: !216, file: !16, line: 181, baseType: !35, size: 16, offset: 128)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "cache_part_state", scope: !216, file: !16, line: 183, baseType: !80, size: 16, offset: 144)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !216, file: !16, line: 185, baseType: !38, size: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !216, file: !16, line: 186, baseType: !31, size: 64, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !216, file: !16, line: 188, baseType: !50, size: 32, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !216, file: !16, line: 191, baseType: !215, size: 64, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !216, file: !16, line: 192, baseType: !202, size: 128, offset: 448)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "child_node", scope: !216, file: !16, line: 193, baseType: !202, size: 128, offset: 576)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !216, file: !16, line: 194, baseType: !31, size: 64, offset: 704)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !216, file: !16, line: 196, baseType: !230, size: 64, offset: 768)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_wait_queue_t", file: !16, line: 175, baseType: !196)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "num_wait", scope: !216, file: !16, line: 198, baseType: !50, size: 32, offset: 832)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !216, file: !16, line: 201, baseType: !234, size: 64, offset: 896)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !216, file: !16, line: 204, baseType: !99, size: 32, offset: 960)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "bound_cpu", scope: !216, file: !16, line: 206, baseType: !50, size: 32, offset: 992)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "placement_cpu", scope: !216, file: !16, line: 207, baseType: !50, size: 32, offset: 1024)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "current_cpu", scope: !216, file: !16, line: 208, baseType: !50, size: 32, offset: 1056)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "is_idle", scope: !216, file: !16, line: 210, baseType: !70, size: 8, offset: 1088)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "output_loc", scope: !216, file: !16, line: 212, baseType: !66, size: 64, offset: 1152)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !216, file: !16, line: 213, baseType: !33, size: 64, offset: 1216)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !216, file: !16, line: 214, baseType: !33, size: 64, offset: 1280)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !216, file: !16, line: 215, baseType: !108, size: 64, offset: 1344)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "sched_state", scope: !216, file: !16, line: 217, baseType: !110, size: 64, offset: 1408)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "vc", scope: !216, file: !16, line: 219, baseType: !47, size: 64, offset: 1472)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !216, file: !16, line: 225, baseType: !115, size: 256, offset: 1536)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !216, file: !16, line: 227, baseType: !120, size: 16384, offset: 1792)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_state", scope: !216, file: !16, line: 229, baseType: !126, size: 32768, align: 512, offset: 18432)
!249 = !{!250}
!250 = !DISubrange(count: 1024)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !186, file: !185, line: 46, baseType: !43, size: 32, offset: 512)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !186, file: !185, line: 47, baseType: !253, size: 64, offset: 576)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !33}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !186, file: !185, line: 48, baseType: !33, size: 64, offset: 640)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !186, file: !185, line: 49, baseType: !202, size: 128, offset: 704)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "active_node", scope: !186, file: !185, line: 50, baseType: !202, size: 128, offset: 832)
!259 = !{!260, !261, !262}
!260 = !DIEnumerator(name: "NK_TIMER_INACTIVE", value: 0, isUnsigned: true)
!261 = !DIEnumerator(name: "NK_TIMER_ACTIVE", value: 1, isUnsigned: true)
!262 = !DIEnumerator(name: "NK_TIMER_SIGNALLED", value: 2, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !264, line: 225, baseType: !7, size: 32, elements: !265)
!264 = !DIFile(filename: "include/dev/apic.h", directory: "/home/sgi9754/nautilus-cs446")
!265 = !{!266, !267, !268, !269}
!266 = !DIEnumerator(name: "APIC_INVALID", value: 0, isUnsigned: true)
!267 = !DIEnumerator(name: "APIC_DISABLED", value: 1, isUnsigned: true)
!268 = !DIEnumerator(name: "APIC_XAPIC", value: 2, isUnsigned: true)
!269 = !DIEnumerator(name: "APIC_X2APIC", value: 3, isUnsigned: true)
!270 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !271, line: 41, baseType: !7, size: 32, elements: !272)
!271 = !DIFile(filename: "include/nautilus/irq.h", directory: "/home/sgi9754/nautilus-cs446")
!272 = !{!273, !274, !275, !276}
!273 = !DIEnumerator(name: "INT_TRIG_BUS", value: 0, isUnsigned: true)
!274 = !DIEnumerator(name: "INT_TRIG_EDGE", value: 1, isUnsigned: true)
!275 = !DIEnumerator(name: "INT_TRIG_RSVD", value: 2, isUnsigned: true)
!276 = !DIEnumerator(name: "INT_TRIG_LEVEL", value: 3, isUnsigned: true)
!277 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !271, line: 40, baseType: !7, size: 32, elements: !278)
!278 = !{!279, !280, !281, !282}
!279 = !DIEnumerator(name: "INT_POL_BUS", value: 0, isUnsigned: true)
!280 = !DIEnumerator(name: "INT_POL_ACTHI", value: 1, isUnsigned: true)
!281 = !DIEnumerator(name: "INT_POL_RSVD", value: 2, isUnsigned: true)
!282 = !DIEnumerator(name: "INT_POL_ACTLO", value: 3, isUnsigned: true)
!283 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !271, line: 39, baseType: !7, size: 32, elements: !284)
!284 = !{!285, !286, !287, !288}
!285 = !DIEnumerator(name: "INT_TYPE_INT", value: 0, isUnsigned: true)
!286 = !DIEnumerator(name: "INT_TYPE_NMI", value: 1, isUnsigned: true)
!287 = !DIEnumerator(name: "INT_TYPE_SMI", value: 2, isUnsigned: true)
!288 = !DIEnumerator(name: "INT_TYPE_EXT", value: 3, isUnsigned: true)
!289 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !112, line: 66, baseType: !7, size: 32, elements: !290)
!290 = !{!291, !292, !293}
!291 = !DIEnumerator(name: "APERIODIC", value: 0, isUnsigned: true)
!292 = !DIEnumerator(name: "SPORADIC", value: 1, isUnsigned: true)
!293 = !DIEnumerator(name: "PERIODIC", value: 2, isUnsigned: true)
!294 = !{!295, !296, !137, !317, !29, !318, !345, !33, !66, !324, !50, !533, !334, !547, !339, !215}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_fiber_t", file: !6, line: 104, baseType: !298)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_fiber", file: !6, line: 70, size: 1216, elements: !299)
!299 = !{!300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "rsp", scope: !298, file: !6, line: 71, baseType: !29, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !298, file: !6, line: 72, baseType: !33, size: 64, offset: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_state_offset", scope: !298, file: !6, line: 73, baseType: !35, size: 16, offset: 128)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !298, file: !6, line: 75, baseType: !38, size: 64, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !298, file: !6, line: 76, baseType: !31, size: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !298, file: !6, line: 78, baseType: !41, size: 32, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "f_status", scope: !298, file: !6, line: 79, baseType: !45, size: 32, offset: 352)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "vc", scope: !298, file: !6, line: 82, baseType: !47, size: 64, offset: 384)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "is_idle", scope: !298, file: !6, line: 83, baseType: !50, size: 32, offset: 448)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "wait_queue", scope: !298, file: !6, line: 91, baseType: !202, size: 128, offset: 512)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "wait_node", scope: !298, file: !6, line: 92, baseType: !202, size: 128, offset: 640)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "num_wait", scope: !298, file: !6, line: 93, baseType: !50, size: 32, offset: 768)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "sched_node", scope: !298, file: !6, line: 97, baseType: !202, size: 128, offset: 832)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !298, file: !6, line: 99, baseType: !62, size: 64, offset: 960)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !298, file: !6, line: 100, baseType: !33, size: 64, offset: 1024)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !298, file: !6, line: 101, baseType: !66, size: 64, offset: 1088)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "is_done", scope: !298, file: !6, line: 103, baseType: !70, size: 8, offset: 1152)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !30, line: 45, baseType: !31)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_info", file: !320, line: 183, size: 59840, elements: !321)
!320 = !DIFile(filename: "include/nautilus/nautilus.h", directory: "/home/sgi9754/nautilus-cs446")
!321 = !{!322, !439, !475, !476, !477, !478, !494, !505, !506, !507, !510, !513, !516, !528, !538, !541, !544}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "cpus", scope: !319, file: !320, line: 185, baseType: !323, size: 16384)
!323 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 16384, elements: !123)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpu", file: !326, line: 74, size: 1600, elements: !327)
!326 = !DIFile(filename: "include/nautilus/smp.h", directory: "/home/sgi9754/nautilus-cs446")
!327 = !{!328, !329, !330, !331, !332, !333, !344, !346, !347, !348, !349, !350, !351, !353, !375, !376, !377, !380, !388, !401, !402, !409, !416, !425, !430}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "cur_thread", scope: !325, file: !326, line: 75, baseType: !215, size: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_nesting_level", scope: !325, file: !326, line: 78, baseType: !35, size: 16, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_disable_level", scope: !325, file: !326, line: 81, baseType: !35, size: 16, offset: 80)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_count", scope: !325, file: !326, line: 85, baseType: !29, size: 64, offset: 128)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "exception_count", scope: !325, file: !326, line: 86, baseType: !29, size: 64, offset: 192)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "f_state", scope: !325, file: !326, line: 88, baseType: !334, size: 64, offset: 256)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_fiber_percpu_state", file: !182, line: 60, size: 384, elements: !336)
!336 = !{!337, !338, !341, !342, !343}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !335, file: !182, line: 61, baseType: !41, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "fiber_thread", scope: !335, file: !182, line: 62, baseType: !339, size: 64, offset: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_thread_t", file: !16, line: 233, baseType: !216)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "curr_fiber", scope: !335, file: !182, line: 63, baseType: !296, size: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "idle_fiber", scope: !335, file: !182, line: 64, baseType: !296, size: 64, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "f_sched_queue", scope: !335, file: !182, line: 65, baseType: !202, size: 128, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !325, file: !326, line: 89, baseType: !345, size: 32, offset: 320)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpu_id_t", file: !326, line: 58, baseType: !43)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "lapic_id", scope: !325, file: !326, line: 90, baseType: !43, size: 32, offset: 352)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !325, file: !326, line: 91, baseType: !70, size: 8, offset: 384)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "is_bsp", scope: !325, file: !326, line: 92, baseType: !70, size: 8, offset: 392)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_sig", scope: !325, file: !326, line: 93, baseType: !43, size: 32, offset: 416)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "feat_flags", scope: !325, file: !326, line: 94, baseType: !43, size: 32, offset: 448)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "booted", scope: !325, file: !326, line: 96, baseType: !352, size: 8, offset: 480)
!352 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !70)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "apic", scope: !325, file: !326, line: 98, baseType: !354, size: 64, offset: 512)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apic_dev", file: !264, line: 227, size: 768, elements: !356)
!356 = !{!357, !359, !361, !362, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !355, file: !264, line: 228, baseType: !358, size: 32)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "apic_mode_t", file: !264, line: 225, baseType: !263)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !355, file: !264, line: 229, baseType: !360, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "ulong_t", file: !30, line: 43, baseType: !31)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !355, file: !264, line: 230, baseType: !70, size: 8, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !355, file: !264, line: 231, baseType: !363, size: 32, offset: 160)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_t", file: !30, line: 37, baseType: !7)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "spur_int_cnt", scope: !355, file: !264, line: 232, baseType: !29, size: 64, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "err_int_cnt", scope: !355, file: !264, line: 233, baseType: !29, size: 64, offset: 256)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "bus_freq_hz", scope: !355, file: !264, line: 234, baseType: !29, size: 64, offset: 320)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "ps_per_tick", scope: !355, file: !264, line: 235, baseType: !29, size: 64, offset: 384)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "cycles_per_us", scope: !355, file: !264, line: 236, baseType: !29, size: 64, offset: 448)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "cycles_per_tick", scope: !355, file: !264, line: 237, baseType: !29, size: 64, offset: 512)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !355, file: !264, line: 238, baseType: !70, size: 8, offset: 576)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "current_ticks", scope: !355, file: !264, line: 239, baseType: !43, size: 32, offset: 608)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "timer_count", scope: !355, file: !264, line: 240, baseType: !29, size: 64, offset: 640)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "in_timer_interrupt", scope: !355, file: !264, line: 241, baseType: !50, size: 32, offset: 704)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "in_kick_interrupt", scope: !355, file: !264, line: 242, baseType: !50, size: 32, offset: 736)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "system", scope: !325, file: !326, line: 100, baseType: !318, size: 64, offset: 576)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !325, file: !326, line: 102, baseType: !41, size: 32, offset: 640)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "sched_state", scope: !325, file: !326, line: 104, baseType: !378, size: 64, offset: 704)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_sched_percpu_state", file: !326, line: 104, flags: DIFlagFwdDecl)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "xcall_q", scope: !325, file: !326, line: 106, baseType: !381, size: 64, offset: 768)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_queue_t", file: !383, line: 42, baseType: !384)
!383 = !DIFile(filename: "include/nautilus/queue.h", directory: "/home/sgi9754/nautilus-cs446")
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_queue", file: !383, line: 33, size: 192, elements: !385)
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !384, file: !383, line: 34, baseType: !202, size: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !384, file: !383, line: 35, baseType: !41, size: 32, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "xcall_nowait_info", scope: !325, file: !326, line: 107, baseType: !389, size: 320, offset: 832)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_xcall", file: !326, line: 61, size: 320, elements: !390)
!390 = !{!391, !396, !397, !399, !400}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "xcall_node", scope: !389, file: !326, line: 62, baseType: !392, size: 128)
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_queue_entry_t", file: !383, line: 43, baseType: !393)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_queue_entry", file: !383, line: 38, size: 128, elements: !394)
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !393, file: !383, line: 39, baseType: !202, size: 128)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !389, file: !326, line: 63, baseType: !33, size: 64, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !389, file: !326, line: 64, baseType: !398, size: 64, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_xcall_func_t", file: !326, line: 57, baseType: !253)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "xcall_done", scope: !389, file: !326, line: 65, baseType: !70, size: 8, offset: 256)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "has_waiter", scope: !389, file: !326, line: 66, baseType: !70, size: 8, offset: 264)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_khz", scope: !325, file: !326, line: 109, baseType: !360, size: 64, offset: 1152)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "tp", scope: !325, file: !326, line: 112, baseType: !403, size: 64, offset: 1216)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_topo_params", file: !405, line: 94, size: 64, elements: !406)
!405 = !DIFile(filename: "include/nautilus/numa.h", directory: "/home/sgi9754/nautilus-cs446")
!406 = !{!407, !408}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "smt_bits", scope: !404, file: !405, line: 95, baseType: !43, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "core_bits", scope: !404, file: !405, line: 96, baseType: !43, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "coord", scope: !325, file: !326, line: 113, baseType: !410, size: 64, offset: 1280)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_cpu_coords", file: !405, line: 99, size: 96, elements: !412)
!412 = !{!413, !414, !415}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "smt_id", scope: !411, file: !405, line: 100, baseType: !43, size: 32)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "core_id", scope: !411, file: !405, line: 101, baseType: !43, size: 32, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_id", scope: !411, file: !405, line: 102, baseType: !43, size: 32, offset: 64)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !325, file: !326, line: 114, baseType: !417, size: 64, offset: 1344)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "numa_domain", file: !405, line: 34, size: 448, elements: !419)
!419 = !{!420, !421, !422, !423, !424}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !418, file: !405, line: 35, baseType: !43, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "addr_space_size", scope: !418, file: !405, line: 36, baseType: !29, size: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !418, file: !405, line: 37, baseType: !43, size: 32, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "regions", scope: !418, file: !405, line: 39, baseType: !202, size: 128, offset: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !418, file: !405, line: 42, baseType: !202, size: 128, offset: 320)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "kmem", scope: !325, file: !326, line: 116, baseType: !426, size: 128, offset: 1408)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kmem_data", file: !427, line: 84, size: 128, elements: !428)
!427 = !DIFile(filename: "include/nautilus/mm.h", directory: "/home/sgi9754/nautilus-cs446")
!428 = !{!429}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "ordered_regions", scope: !426, file: !427, line: 85, baseType: !202, size: 128)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "rand", scope: !325, file: !326, line: 119, baseType: !431, size: 64, offset: 1536)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_rand_info", file: !433, line: 33, size: 256, elements: !434)
!433 = !DIFile(filename: "include/nautilus/random.h", directory: "/home/sgi9754/nautilus-cs446")
!434 = !{!435, !436, !437, !438}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !432, file: !433, line: 34, baseType: !41, size: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !432, file: !433, line: 35, baseType: !29, size: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !432, file: !433, line: 36, baseType: !29, size: 64, offset: 128)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !432, file: !433, line: 37, baseType: !29, size: 64, offset: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ioapics", scope: !319, file: !320, line: 186, baseType: !440, size: 1024, offset: 16384)
!440 = !DICompositeType(tag: DW_TAG_array_type, baseType: !441, size: 1024, elements: !473)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ioapic", file: !443, line: 113, size: 320, elements: !444)
!443 = !DIFile(filename: "include/dev/ioapic.h", directory: "/home/sgi9754/nautilus-cs446")
!444 = !{!445, !446, !447, !448, !450, !451, !472}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !442, file: !443, line: 114, baseType: !70, size: 8)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !442, file: !443, line: 115, baseType: !70, size: 8, offset: 8)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "usable", scope: !442, file: !443, line: 116, baseType: !70, size: 8, offset: 16)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !442, file: !443, line: 117, baseType: !449, size: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_t", file: !30, line: 64, baseType: !360)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "num_entries", scope: !442, file: !443, line: 119, baseType: !70, size: 8, offset: 128)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !442, file: !443, line: 120, baseType: !452, size: 64, offset: 192)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iored_entry", file: !443, line: 101, size: 192, elements: !454)
!454 = !{!455, !456, !471}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !453, file: !443, line: 103, baseType: !70, size: 8)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "boot_info", scope: !453, file: !443, line: 106, baseType: !457, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_int_entry", file: !271, line: 43, size: 256, elements: !459)
!459 = !{!460, !462, !464, !466, !467, !468, !469, !470}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "trig_mode", scope: !458, file: !271, line: 44, baseType: !461, size: 32)
!461 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_trig_t", file: !271, line: 41, baseType: !270)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "polarity", scope: !458, file: !271, line: 45, baseType: !463, size: 32, offset: 32)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_pol_t", file: !271, line: 40, baseType: !277)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !458, file: !271, line: 46, baseType: !465, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_type_t", file: !271, line: 39, baseType: !283)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "src_bus_id", scope: !458, file: !271, line: 47, baseType: !70, size: 8, offset: 96)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "src_bus_irq", scope: !458, file: !271, line: 48, baseType: !70, size: 8, offset: 104)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ioapic_intin", scope: !458, file: !271, line: 49, baseType: !70, size: 8, offset: 112)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ioapic_id", scope: !458, file: !271, line: 50, baseType: !70, size: 8, offset: 120)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "elm", scope: !458, file: !271, line: 52, baseType: !202, size: 128, offset: 128)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "actual_irq", scope: !453, file: !443, line: 109, baseType: !70, size: 8, offset: 128)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "first_hrt_entry", scope: !442, file: !443, line: 122, baseType: !7, size: 32, offset: 256)
!473 = !{!474}
!474 = !DISubrange(count: 16)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "num_cpus", scope: !319, file: !320, line: 188, baseType: !43, size: 32, offset: 17408)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "num_ioapics", scope: !319, file: !320, line: 189, baseType: !43, size: 32, offset: 17440)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !319, file: !320, line: 191, baseType: !29, size: 64, offset: 17472)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "core_barrier", scope: !319, file: !320, line: 194, baseType: !479, size: 64, offset: 17536)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_barrier_t", file: !481, line: 34, baseType: !482)
!481 = !DIFile(filename: "include/nautilus/barrier.h", directory: "/home/sgi9754/nautilus-cs446")
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_barrier", file: !481, line: 36, size: 1024, align: 512, elements: !483)
!483 = !{!484, !485, !486, !487, !488, !492}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !482, file: !481, line: 37, baseType: !41, size: 32)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "remaining", scope: !482, file: !481, line: 39, baseType: !7, size: 32, offset: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "init_count", scope: !482, file: !481, line: 40, baseType: !7, size: 32, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !482, file: !481, line: 42, baseType: !70, size: 8, offset: 96)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !482, file: !481, line: 44, baseType: !489, size: 416, offset: 104)
!489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 416, elements: !490)
!490 = !{!491}
!491 = !DISubrange(count: 52)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !482, file: !481, line: 47, baseType: !493, size: 32, offset: 520)
!493 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !319, file: !320, line: 196, baseType: !495, size: 448, offset: 17600)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_mem_info", file: !496, line: 83, size: 448, elements: !497)
!496 = !DIFile(filename: "include/nautilus/paging.h", directory: "/home/sgi9754/nautilus-cs446")
!497 = !{!498, !500, !501, !502, !503, !504}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "page_map", scope: !495, file: !496, line: 84, baseType: !499, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "pm_start", scope: !495, file: !496, line: 85, baseType: !449, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "pm_end", scope: !495, file: !496, line: 86, baseType: !449, size: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "phys_mem_avail", scope: !495, file: !496, line: 87, baseType: !360, size: 64, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "npages", scope: !495, file: !496, line: 88, baseType: !360, size: 64, offset: 256)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "mem_zone_list", scope: !495, file: !496, line: 90, baseType: !202, size: 128, offset: 320)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_id", scope: !319, file: !320, line: 198, baseType: !43, size: 32, offset: 18048)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "pic_mode_enabled", scope: !319, file: !320, line: 200, baseType: !70, size: 8, offset: 18080)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "pci", scope: !319, file: !320, line: 202, baseType: !508, size: 64, offset: 18112)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "pci_info", file: !320, line: 202, flags: DIFlagFwdDecl)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "hpet", scope: !319, file: !320, line: 203, baseType: !511, size: 64, offset: 18176)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "hpet_dev", file: !320, line: 178, flags: DIFlagFwdDecl)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "mb_info", scope: !319, file: !320, line: 205, baseType: !514, size: 64, offset: 18240)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "multiboot_info", file: !320, line: 205, flags: DIFlagFwdDecl)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "int_info", scope: !319, file: !320, line: 207, baseType: !517, size: 33024, offset: 18304)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_int_info", file: !320, line: 171, size: 33024, elements: !518)
!518 = !{!519, !520, !521}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "int_list", scope: !517, file: !320, line: 172, baseType: !202, size: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "bus_list", scope: !517, file: !320, line: 173, baseType: !202, size: 128, offset: 128)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "irq_map", scope: !517, file: !320, line: 175, baseType: !522, size: 32768, offset: 256)
!522 = !DICompositeType(tag: DW_TAG_array_type, baseType: !523, size: 32768, elements: !123)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "irq_mapping", file: !320, line: 164, size: 128, elements: !524)
!524 = !{!525, !526, !527}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "ioapic", scope: !523, file: !320, line: 165, baseType: !441, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !523, file: !320, line: 166, baseType: !70, size: 8, offset: 64)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "assigned", scope: !523, file: !320, line: 167, baseType: !70, size: 8, offset: 72)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "locality_info", scope: !319, file: !320, line: 209, baseType: !529, size: 8320, offset: 51328)
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_locality_info", file: !405, line: 75, size: 8320, elements: !530)
!530 = !{!531, !532, !534}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "num_domains", scope: !529, file: !405, line: 76, baseType: !43, size: 32)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "numa_matrix", scope: !529, file: !405, line: 77, baseType: !533, size: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "domains", scope: !529, file: !405, line: 79, baseType: !535, size: 8192, offset: 128)
!535 = !DICompositeType(tag: DW_TAG_array_type, baseType: !417, size: 8192, elements: !536)
!536 = !{!537}
!537 = !DISubrange(count: 128)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "pmc_info", scope: !319, file: !320, line: 211, baseType: !539, size: 64, offset: 59648)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "pmc_info", file: !320, line: 180, flags: DIFlagFwdDecl)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "linker_info", scope: !319, file: !320, line: 213, baseType: !542, size: 64, offset: 59712)
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_link_info", file: !320, line: 181, flags: DIFlagFwdDecl)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "prog_info", scope: !319, file: !320, line: 215, baseType: !545, size: 64, offset: 59776)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_prog_info", file: !320, line: 182, flags: DIFlagFwdDecl)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!548 = !{!"clang version 8.0.0 (tags/RELEASE_800/final)"}
!549 = !{i32 2, !"Dwarf Version", i32 4}
!550 = !{i32 2, !"Debug Info Version", i32 3}
!551 = !{i32 1, !"wchar_size", i32 4}
!552 = !{i32 1, !"Code Model", i32 4}
!553 = distinct !DISubprogram(name: "handle_fibers9", scope: !3, file: !3, line: 533, type: !141, scopeLine: 534, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !554)
!554 = !{!555, !556}
!555 = !DILocalVariable(name: "buf", arg: 1, scope: !553, file: !3, line: 533, type: !137)
!556 = !DILocalVariable(name: "priv", arg: 2, scope: !553, file: !3, line: 533, type: !33)
!557 = !DILocation(line: 533, column: 24, scope: !553)
!558 = !DILocation(line: 533, column: 36, scope: !553)
!559 = !DILocation(line: 451, column: 3, scope: !560, inlinedAt: !565)
!560 = distinct !DISubprogram(name: "test_fiber_routine_2", scope: !3, file: !3, line: 449, type: !561, scopeLine: 450, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !563)
!561 = !DISubroutineType(types: !562)
!562 = !{!50}
!563 = !{!564}
!564 = !DILocalVariable(name: "f_orig", scope: !560, file: !3, line: 451, type: !24)
!565 = distinct !DILocation(line: 535, column: 3, scope: !553)
!566 = !DILocation(line: 258, column: 26, scope: !567, inlinedAt: !575)
!567 = distinct !DILexicalBlock(scope: !568, file: !16, line: 258, column: 26)
!568 = distinct !DILexicalBlock(scope: !569, file: !16, line: 258, column: 26)
!569 = distinct !DISubprogram(name: "get_cur_thread", scope: !16, file: !16, line: 256, type: !570, scopeLine: 257, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !572)
!570 = !DISubroutineType(types: !571)
!571 = !{!72}
!572 = !{!573, !574}
!573 = !DILocalVariable(name: "__r", scope: !568, file: !16, line: 258, type: !86)
!574 = !DILocalVariable(name: "__r", scope: !567, file: !16, line: 258, type: !86)
!575 = distinct !DILocation(line: 452, column: 8, scope: !560, inlinedAt: !565)
!576 = !{i32 -2147275531}
!577 = !DILocation(line: 258, column: 26, scope: !568, inlinedAt: !575)
!578 = !DILocation(line: 452, column: 26, scope: !560, inlinedAt: !565)
!579 = !DILocation(line: 452, column: 6, scope: !560, inlinedAt: !565)
!580 = !DILocation(line: 453, column: 3, scope: !560, inlinedAt: !565)
!581 = !DILocation(line: 451, column: 15, scope: !560, inlinedAt: !565)
!582 = !DILocation(line: 454, column: 3, scope: !560, inlinedAt: !565)
!583 = !DILocation(line: 456, column: 1, scope: !560, inlinedAt: !565)
!584 = !DILocation(line: 536, column: 3, scope: !553)
!585 = distinct !DISubprogram(name: "fiber_routine3", scope: !3, file: !3, line: 310, type: !64, scopeLine: 311, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !586)
!586 = !{!587, !588, !589, !590, !591}
!587 = !DILocalVariable(name: "i", arg: 1, scope: !585, file: !3, line: 310, type: !33)
!588 = !DILocalVariable(name: "o", arg: 2, scope: !585, file: !3, line: 310, type: !66)
!589 = !DILocalVariable(name: "a", scope: !585, file: !3, line: 313, type: !50)
!590 = !DILocalVariable(name: "f_new", scope: !585, file: !3, line: 314, type: !24)
!591 = !DILocalVariable(name: "curr", scope: !592, file: !3, line: 318, type: !24)
!592 = distinct !DILexicalBlock(scope: !585, file: !3, line: 315, column: 15)
!593 = !DILocation(line: 310, column: 27, scope: !585)
!594 = !DILocation(line: 310, column: 37, scope: !585)
!595 = !DILocation(line: 312, column: 19, scope: !585)
!596 = !DILocation(line: 312, column: 3, scope: !585)
!597 = !DILocation(line: 313, column: 7, scope: !585)
!598 = !DILocation(line: 316, column: 13, scope: !592)
!599 = !DILocation(line: 314, column: 15, scope: !585)
!600 = !DILocation(line: 318, column: 17, scope: !592)
!601 = !DILocation(line: 319, column: 5, scope: !592)
!602 = !DILocation(line: 322, column: 3, scope: !585)
!603 = !DILocation(line: 323, column: 1, scope: !585)
!604 = distinct !DISubprogram(name: "handle_fibers8", scope: !3, file: !3, line: 526, type: !141, scopeLine: 527, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !605)
!605 = !{!606, !607}
!606 = !DILocalVariable(name: "buf", arg: 1, scope: !604, file: !3, line: 526, type: !137)
!607 = !DILocalVariable(name: "priv", arg: 2, scope: !604, file: !3, line: 526, type: !33)
!608 = !DILocation(line: 526, column: 24, scope: !604)
!609 = !DILocation(line: 526, column: 36, scope: !604)
!610 = !DILocation(line: 442, column: 3, scope: !611, inlinedAt: !614)
!611 = distinct !DISubprogram(name: "test_fiber_routine", scope: !3, file: !3, line: 440, type: !561, scopeLine: 441, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !612)
!612 = !{!613}
!613 = !DILocalVariable(name: "f_orig", scope: !611, file: !3, line: 442, type: !24)
!614 = distinct !DILocation(line: 528, column: 3, scope: !604)
!615 = !DILocation(line: 258, column: 26, scope: !567, inlinedAt: !616)
!616 = distinct !DILocation(line: 443, column: 8, scope: !611, inlinedAt: !614)
!617 = !DILocation(line: 258, column: 26, scope: !568, inlinedAt: !616)
!618 = !DILocation(line: 443, column: 26, scope: !611, inlinedAt: !614)
!619 = !DILocation(line: 443, column: 6, scope: !611, inlinedAt: !614)
!620 = !DILocation(line: 444, column: 3, scope: !611, inlinedAt: !614)
!621 = !DILocation(line: 442, column: 15, scope: !611, inlinedAt: !614)
!622 = !DILocation(line: 445, column: 3, scope: !611, inlinedAt: !614)
!623 = !DILocation(line: 447, column: 1, scope: !611, inlinedAt: !614)
!624 = !DILocation(line: 529, column: 3, scope: !604)
!625 = distinct !DISubprogram(name: "fiber_routine1", scope: !3, file: !3, line: 290, type: !64, scopeLine: 291, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !626)
!626 = !{!627, !628, !629, !630, !631, !633}
!627 = !DILocalVariable(name: "i", arg: 1, scope: !625, file: !3, line: 290, type: !33)
!628 = !DILocalVariable(name: "o", arg: 2, scope: !625, file: !3, line: 290, type: !66)
!629 = !DILocalVariable(name: "a", scope: !625, file: !3, line: 293, type: !50)
!630 = !DILocalVariable(name: "f_new", scope: !625, file: !3, line: 294, type: !24)
!631 = !DILocalVariable(name: "curr", scope: !632, file: !3, line: 298, type: !24)
!632 = distinct !DILexicalBlock(scope: !625, file: !3, line: 295, column: 15)
!633 = !DILocalVariable(name: "new", scope: !634, file: !3, line: 300, type: !24)
!634 = distinct !DILexicalBlock(scope: !635, file: !3, line: 299, column: 14)
!635 = distinct !DILexicalBlock(scope: !632, file: !3, line: 299, column: 8)
!636 = !DILocation(line: 290, column: 27, scope: !625)
!637 = !DILocation(line: 290, column: 37, scope: !625)
!638 = !DILocation(line: 292, column: 19, scope: !625)
!639 = !DILocation(line: 292, column: 3, scope: !625)
!640 = !DILocation(line: 293, column: 7, scope: !625)
!641 = !DILocation(line: 296, column: 13, scope: !632)
!642 = !DILocation(line: 294, column: 15, scope: !625)
!643 = !DILocation(line: 298, column: 17, scope: !632)
!644 = !DILocation(line: 299, column: 8, scope: !635)
!645 = !DILocation(line: 299, column: 8, scope: !632)
!646 = !DILocation(line: 300, column: 7, scope: !634)
!647 = !DILocation(line: 300, column: 19, scope: !634)
!648 = !DILocation(line: 301, column: 7, scope: !634)
!649 = !DILocation(line: 303, column: 5, scope: !635)
!650 = !DILocation(line: 304, column: 5, scope: !632)
!651 = !DILocation(line: 307, column: 3, scope: !625)
!652 = !DILocation(line: 308, column: 1, scope: !625)
!653 = distinct !DISubprogram(name: "fiber_routine2", scope: !3, file: !3, line: 282, type: !64, scopeLine: 283, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !654)
!654 = !{!655, !656}
!655 = !DILocalVariable(name: "i", arg: 1, scope: !653, file: !3, line: 282, type: !33)
!656 = !DILocalVariable(name: "o", arg: 2, scope: !653, file: !3, line: 282, type: !66)
!657 = !DILocation(line: 282, column: 27, scope: !653)
!658 = !DILocation(line: 282, column: 37, scope: !653)
!659 = !DILocation(line: 284, column: 19, scope: !653)
!660 = !DILocation(line: 284, column: 3, scope: !653)
!661 = !DILocation(line: 286, column: 3, scope: !653)
!662 = !DILocation(line: 287, column: 1, scope: !653)
!663 = distinct !DISubprogram(name: "handle_fibers7", scope: !3, file: !3, line: 519, type: !141, scopeLine: 520, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !664)
!664 = !{!665, !666}
!665 = !DILocalVariable(name: "buf", arg: 1, scope: !663, file: !3, line: 519, type: !137)
!666 = !DILocalVariable(name: "priv", arg: 2, scope: !663, file: !3, line: 519, type: !33)
!667 = !DILocation(line: 519, column: 24, scope: !663)
!668 = !DILocation(line: 519, column: 36, scope: !663)
!669 = !DILocation(line: 433, column: 3, scope: !670, inlinedAt: !673)
!670 = distinct !DISubprogram(name: "test_fiber_fork_join", scope: !3, file: !3, line: 431, type: !561, scopeLine: 432, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !671)
!671 = !{!672}
!672 = !DILocalVariable(name: "f_orig", scope: !670, file: !3, line: 433, type: !24)
!673 = distinct !DILocation(line: 521, column: 3, scope: !663)
!674 = !DILocation(line: 258, column: 26, scope: !567, inlinedAt: !675)
!675 = distinct !DILocation(line: 434, column: 8, scope: !670, inlinedAt: !673)
!676 = !DILocation(line: 258, column: 26, scope: !568, inlinedAt: !675)
!677 = !DILocation(line: 434, column: 26, scope: !670, inlinedAt: !673)
!678 = !DILocation(line: 434, column: 6, scope: !670, inlinedAt: !673)
!679 = !DILocation(line: 435, column: 3, scope: !670, inlinedAt: !673)
!680 = !DILocation(line: 433, column: 15, scope: !670, inlinedAt: !673)
!681 = !DILocation(line: 436, column: 3, scope: !670, inlinedAt: !673)
!682 = !DILocation(line: 438, column: 1, scope: !670, inlinedAt: !673)
!683 = !DILocation(line: 522, column: 3, scope: !663)
!684 = distinct !DISubprogram(name: "fiber_fork_join", scope: !3, file: !3, line: 263, type: !64, scopeLine: 264, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !685)
!685 = !{!686, !687, !688, !689, !690}
!686 = !DILocalVariable(name: "i", arg: 1, scope: !684, file: !3, line: 263, type: !33)
!687 = !DILocalVariable(name: "o", arg: 2, scope: !684, file: !3, line: 263, type: !66)
!688 = !DILocalVariable(name: "a", scope: !684, file: !3, line: 266, type: !50)
!689 = !DILocalVariable(name: "f_new", scope: !684, file: !3, line: 267, type: !24)
!690 = !DILocalVariable(name: "f_curr", scope: !684, file: !3, line: 274, type: !24)
!691 = !DILocation(line: 263, column: 28, scope: !684)
!692 = !DILocation(line: 263, column: 38, scope: !684)
!693 = !DILocation(line: 265, column: 19, scope: !684)
!694 = !DILocation(line: 265, column: 3, scope: !684)
!695 = !DILocation(line: 266, column: 7, scope: !684)
!696 = !DILocation(line: 268, column: 11, scope: !684)
!697 = !DILocation(line: 267, column: 15, scope: !684)
!698 = !DILocation(line: 269, column: 6, scope: !699)
!699 = distinct !DILexicalBlock(scope: !684, file: !3, line: 269, column: 6)
!700 = !DILocation(line: 269, column: 6, scope: !684)
!701 = !DILocation(line: 270, column: 5, scope: !702)
!702 = distinct !DILexicalBlock(scope: !699, file: !3, line: 269, column: 12)
!703 = !DILocation(line: 271, column: 3, scope: !702)
!704 = !DILocation(line: 274, column: 15, scope: !684)
!705 = !DILocation(line: 276, column: 5, scope: !706)
!706 = distinct !DILexicalBlock(scope: !684, file: !3, line: 275, column: 15)
!707 = !DILocation(line: 277, column: 5, scope: !706)
!708 = !DILocation(line: 279, column: 3, scope: !684)
!709 = !DILocation(line: 280, column: 1, scope: !684)
!710 = distinct !DISubprogram(name: "handle_fibers6", scope: !3, file: !3, line: 512, type: !141, scopeLine: 513, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !711)
!711 = !{!712, !713}
!712 = !DILocalVariable(name: "buf", arg: 1, scope: !710, file: !3, line: 512, type: !137)
!713 = !DILocalVariable(name: "priv", arg: 2, scope: !710, file: !3, line: 512, type: !33)
!714 = !DILocation(line: 512, column: 24, scope: !710)
!715 = !DILocation(line: 512, column: 36, scope: !710)
!716 = !DILocation(line: 424, column: 3, scope: !717, inlinedAt: !720)
!717 = distinct !DISubprogram(name: "test_fiber_fork", scope: !3, file: !3, line: 422, type: !561, scopeLine: 423, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !718)
!718 = !{!719}
!719 = !DILocalVariable(name: "f_orig", scope: !717, file: !3, line: 424, type: !24)
!720 = distinct !DILocation(line: 514, column: 3, scope: !710)
!721 = !DILocation(line: 258, column: 26, scope: !567, inlinedAt: !722)
!722 = distinct !DILocation(line: 425, column: 8, scope: !717, inlinedAt: !720)
!723 = !DILocation(line: 258, column: 26, scope: !568, inlinedAt: !722)
!724 = !DILocation(line: 425, column: 26, scope: !717, inlinedAt: !720)
!725 = !DILocation(line: 425, column: 6, scope: !717, inlinedAt: !720)
!726 = !DILocation(line: 426, column: 3, scope: !717, inlinedAt: !720)
!727 = !DILocation(line: 424, column: 15, scope: !717, inlinedAt: !720)
!728 = !DILocation(line: 427, column: 3, scope: !717, inlinedAt: !720)
!729 = !DILocation(line: 429, column: 1, scope: !717, inlinedAt: !720)
!730 = !DILocation(line: 515, column: 3, scope: !710)
!731 = distinct !DISubprogram(name: "fiber_fork", scope: !3, file: !3, line: 249, type: !64, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !732)
!732 = !{!733, !734, !735, !736}
!733 = !DILocalVariable(name: "i", arg: 1, scope: !731, file: !3, line: 249, type: !33)
!734 = !DILocalVariable(name: "o", arg: 2, scope: !731, file: !3, line: 249, type: !66)
!735 = !DILocalVariable(name: "a", scope: !731, file: !3, line: 252, type: !50)
!736 = !DILocalVariable(name: "f_new", scope: !731, file: !3, line: 253, type: !24)
!737 = !DILocation(line: 249, column: 23, scope: !731)
!738 = !DILocation(line: 249, column: 33, scope: !731)
!739 = !DILocation(line: 251, column: 19, scope: !731)
!740 = !DILocation(line: 251, column: 3, scope: !731)
!741 = !DILocation(line: 252, column: 7, scope: !731)
!742 = !DILocation(line: 254, column: 11, scope: !731)
!743 = !DILocation(line: 253, column: 15, scope: !731)
!744 = !DILocation(line: 257, column: 5, scope: !745)
!745 = distinct !DILexicalBlock(scope: !731, file: !3, line: 255, column: 15)
!746 = !DILocation(line: 258, column: 5, scope: !745)
!747 = !DILocation(line: 260, column: 3, scope: !731)
!748 = !DILocation(line: 261, column: 1, scope: !731)
!749 = distinct !DISubprogram(name: "handle_fibers5", scope: !3, file: !3, line: 505, type: !141, scopeLine: 506, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !750)
!750 = !{!751, !752}
!751 = !DILocalVariable(name: "buf", arg: 1, scope: !749, file: !3, line: 505, type: !137)
!752 = !DILocalVariable(name: "priv", arg: 2, scope: !749, file: !3, line: 505, type: !33)
!753 = !DILocation(line: 505, column: 24, scope: !749)
!754 = !DILocation(line: 505, column: 36, scope: !749)
!755 = !DILocation(line: 415, column: 3, scope: !756, inlinedAt: !759)
!756 = distinct !DISubprogram(name: "test_fiber_join", scope: !3, file: !3, line: 413, type: !561, scopeLine: 414, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !757)
!757 = !{!758}
!758 = !DILocalVariable(name: "f_outer_join", scope: !756, file: !3, line: 415, type: !24)
!759 = distinct !DILocation(line: 507, column: 3, scope: !749)
!760 = !DILocation(line: 258, column: 26, scope: !567, inlinedAt: !761)
!761 = distinct !DILocation(line: 416, column: 8, scope: !756, inlinedAt: !759)
!762 = !DILocation(line: 258, column: 26, scope: !568, inlinedAt: !761)
!763 = !DILocation(line: 416, column: 26, scope: !756, inlinedAt: !759)
!764 = !DILocation(line: 416, column: 6, scope: !756, inlinedAt: !759)
!765 = !DILocation(line: 417, column: 3, scope: !756, inlinedAt: !759)
!766 = !DILocation(line: 415, column: 15, scope: !756, inlinedAt: !759)
!767 = !DILocation(line: 418, column: 3, scope: !756, inlinedAt: !759)
!768 = !DILocation(line: 420, column: 1, scope: !756, inlinedAt: !759)
!769 = !DILocation(line: 508, column: 3, scope: !749)
!770 = distinct !DISubprogram(name: "fiber_outer_join", scope: !3, file: !3, line: 103, type: !64, scopeLine: 104, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !771)
!771 = !{!772, !773, !774, !775}
!772 = !DILocalVariable(name: "i", arg: 1, scope: !770, file: !3, line: 103, type: !33)
!773 = !DILocalVariable(name: "o", arg: 2, scope: !770, file: !3, line: 103, type: !66)
!774 = !DILocalVariable(name: "a", scope: !770, file: !3, line: 106, type: !50)
!775 = !DILocalVariable(name: "f_inner_join", scope: !776, file: !3, line: 109, type: !24)
!776 = distinct !DILexicalBlock(scope: !770, file: !3, line: 107, column: 15)
!777 = !DILocation(line: 103, column: 29, scope: !770)
!778 = !DILocation(line: 103, column: 39, scope: !770)
!779 = !DILocation(line: 105, column: 19, scope: !770)
!780 = !DILocation(line: 105, column: 3, scope: !770)
!781 = !DILocation(line: 106, column: 7, scope: !770)
!782 = !DILocation(line: 108, column: 5, scope: !776)
!783 = !DILocation(line: 109, column: 5, scope: !776)
!784 = !DILocation(line: 109, column: 17, scope: !776)
!785 = !DILocation(line: 110, column: 5, scope: !776)
!786 = !DILocation(line: 111, column: 19, scope: !776)
!787 = !DILocation(line: 111, column: 5, scope: !776)
!788 = !DILocation(line: 112, column: 5, scope: !776)
!789 = !DILocation(line: 113, column: 3, scope: !770)
!790 = !DILocation(line: 114, column: 3, scope: !770)
!791 = !DILocation(line: 115, column: 1, scope: !770)
!792 = distinct !DISubprogram(name: "fiber_inner_join", scope: !3, file: !3, line: 92, type: !64, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !793)
!793 = !{!794, !795, !796}
!794 = !DILocalVariable(name: "i", arg: 1, scope: !792, file: !3, line: 92, type: !33)
!795 = !DILocalVariable(name: "o", arg: 2, scope: !792, file: !3, line: 92, type: !66)
!796 = !DILocalVariable(name: "a", scope: !792, file: !3, line: 95, type: !50)
!797 = !DILocation(line: 92, column: 29, scope: !792)
!798 = !DILocation(line: 92, column: 39, scope: !792)
!799 = !DILocation(line: 94, column: 19, scope: !792)
!800 = !DILocation(line: 94, column: 3, scope: !792)
!801 = !DILocation(line: 95, column: 7, scope: !792)
!802 = !DILocation(line: 97, column: 5, scope: !803)
!803 = distinct !DILexicalBlock(scope: !792, file: !3, line: 96, column: 16)
!804 = !DILocation(line: 98, column: 5, scope: !803)
!805 = !DILocation(line: 100, column: 3, scope: !792)
!806 = !DILocation(line: 101, column: 1, scope: !792)
!807 = distinct !DISubprogram(name: "handle_fibers4", scope: !3, file: !3, line: 497, type: !141, scopeLine: 498, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !808)
!808 = !{!809, !810}
!809 = !DILocalVariable(name: "buf", arg: 1, scope: !807, file: !3, line: 497, type: !137)
!810 = !DILocalVariable(name: "priv", arg: 2, scope: !807, file: !3, line: 497, type: !33)
!811 = !DILocation(line: 497, column: 24, scope: !807)
!812 = !DILocation(line: 497, column: 36, scope: !807)
!813 = !DILocation(line: 499, column: 3, scope: !807)
!814 = !DILocation(line: 501, column: 3, scope: !807)
!815 = distinct !DISubprogram(name: "test_yield_to", scope: !3, file: !3, line: 389, type: !561, scopeLine: 390, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !816)
!816 = !{!817, !818, !819, !820}
!817 = !DILocalVariable(name: "f_first", scope: !815, file: !3, line: 391, type: !24)
!818 = !DILocalVariable(name: "f_second", scope: !815, file: !3, line: 392, type: !24)
!819 = !DILocalVariable(name: "f_third", scope: !815, file: !3, line: 393, type: !24)
!820 = !DILocalVariable(name: "f_fourth", scope: !815, file: !3, line: 394, type: !24)
!821 = !DILocation(line: 391, column: 3, scope: !815)
!822 = !DILocation(line: 392, column: 3, scope: !815)
!823 = !DILocation(line: 393, column: 3, scope: !815)
!824 = !DILocation(line: 394, column: 3, scope: !815)
!825 = !DILocation(line: 258, column: 26, scope: !567, inlinedAt: !826)
!826 = distinct !DILocation(line: 395, column: 8, scope: !815)
!827 = !DILocation(line: 258, column: 26, scope: !568, inlinedAt: !826)
!828 = !DILocation(line: 395, column: 26, scope: !815)
!829 = !DILocation(line: 395, column: 6, scope: !815)
!830 = !DILocation(line: 396, column: 3, scope: !815)
!831 = !DILocation(line: 394, column: 15, scope: !815)
!832 = !DILocation(line: 397, column: 3, scope: !815)
!833 = !DILocation(line: 391, column: 15, scope: !815)
!834 = !DILocation(line: 398, column: 3, scope: !815)
!835 = !DILocation(line: 393, column: 15, scope: !815)
!836 = !DILocation(line: 399, column: 3, scope: !815)
!837 = !DILocation(line: 392, column: 15, scope: !815)
!838 = !DILocation(line: 400, column: 3, scope: !815)
!839 = !DILocation(line: 402, column: 20, scope: !815)
!840 = !DILocation(line: 402, column: 3, scope: !815)
!841 = !DILocation(line: 402, column: 12, scope: !815)
!842 = !DILocation(line: 402, column: 18, scope: !815)
!843 = !DILocation(line: 403, column: 21, scope: !815)
!844 = !DILocation(line: 403, column: 3, scope: !815)
!845 = !DILocation(line: 403, column: 13, scope: !815)
!846 = !DILocation(line: 403, column: 19, scope: !815)
!847 = !DILocation(line: 404, column: 20, scope: !815)
!848 = !DILocation(line: 404, column: 3, scope: !815)
!849 = !DILocation(line: 404, column: 12, scope: !815)
!850 = !DILocation(line: 404, column: 18, scope: !815)
!851 = !DILocation(line: 405, column: 21, scope: !815)
!852 = !DILocation(line: 405, column: 3, scope: !815)
!853 = !DILocation(line: 405, column: 13, scope: !815)
!854 = !DILocation(line: 405, column: 19, scope: !815)
!855 = !DILocation(line: 406, column: 3, scope: !815)
!856 = !DILocation(line: 407, column: 16, scope: !815)
!857 = !DILocation(line: 407, column: 3, scope: !815)
!858 = !DILocation(line: 408, column: 16, scope: !815)
!859 = !DILocation(line: 408, column: 3, scope: !815)
!860 = !DILocation(line: 409, column: 16, scope: !815)
!861 = !DILocation(line: 409, column: 3, scope: !815)
!862 = !DILocation(line: 411, column: 1, scope: !815)
!863 = !DILocation(line: 410, column: 3, scope: !815)
!864 = distinct !DISubprogram(name: "fiber_fourth", scope: !3, file: !3, line: 236, type: !64, scopeLine: 237, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !865)
!865 = !{!866, !867, !868, !869}
!866 = !DILocalVariable(name: "i", arg: 1, scope: !864, file: !3, line: 236, type: !33)
!867 = !DILocalVariable(name: "o", arg: 2, scope: !864, file: !3, line: 236, type: !66)
!868 = !DILocalVariable(name: "a", scope: !864, file: !3, line: 239, type: !50)
!869 = !DILocalVariable(name: "f_to", scope: !864, file: !3, line: 241, type: !24)
!870 = !DILocation(line: 236, column: 25, scope: !864)
!871 = !DILocation(line: 236, column: 35, scope: !864)
!872 = !DILocation(line: 238, column: 19, scope: !864)
!873 = !DILocation(line: 238, column: 3, scope: !864)
!874 = !DILocation(line: 239, column: 7, scope: !864)
!875 = !DILocation(line: 241, column: 22, scope: !864)
!876 = !DILocation(line: 241, column: 15, scope: !864)
!877 = !DILocation(line: 243, column: 5, scope: !878)
!878 = distinct !DILexicalBlock(scope: !864, file: !3, line: 242, column: 15)
!879 = !DILocation(line: 244, column: 5, scope: !878)
!880 = !DILocation(line: 246, column: 3, scope: !864)
!881 = !DILocation(line: 247, column: 1, scope: !864)
!882 = distinct !DISubprogram(name: "fiber_first", scope: !3, file: !3, line: 198, type: !64, scopeLine: 199, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !883)
!883 = !{!884, !885, !886, !887}
!884 = !DILocalVariable(name: "i", arg: 1, scope: !882, file: !3, line: 198, type: !33)
!885 = !DILocalVariable(name: "o", arg: 2, scope: !882, file: !3, line: 198, type: !66)
!886 = !DILocalVariable(name: "a", scope: !882, file: !3, line: 201, type: !50)
!887 = !DILocalVariable(name: "f_to", scope: !882, file: !3, line: 202, type: !24)
!888 = !DILocation(line: 198, column: 24, scope: !882)
!889 = !DILocation(line: 198, column: 34, scope: !882)
!890 = !DILocation(line: 200, column: 19, scope: !882)
!891 = !DILocation(line: 200, column: 3, scope: !882)
!892 = !DILocation(line: 201, column: 7, scope: !882)
!893 = !DILocation(line: 202, column: 22, scope: !882)
!894 = !DILocation(line: 202, column: 15, scope: !882)
!895 = !DILocation(line: 204, column: 5, scope: !896)
!896 = distinct !DILexicalBlock(scope: !882, file: !3, line: 203, column: 15)
!897 = !DILocation(line: 205, column: 5, scope: !896)
!898 = !DILocation(line: 207, column: 3, scope: !882)
!899 = !DILocation(line: 208, column: 1, scope: !882)
!900 = distinct !DISubprogram(name: "fiber_third", scope: !3, file: !3, line: 223, type: !64, scopeLine: 224, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !901)
!901 = !{!902, !903, !904, !905}
!902 = !DILocalVariable(name: "i", arg: 1, scope: !900, file: !3, line: 223, type: !33)
!903 = !DILocalVariable(name: "o", arg: 2, scope: !900, file: !3, line: 223, type: !66)
!904 = !DILocalVariable(name: "a", scope: !900, file: !3, line: 226, type: !50)
!905 = !DILocalVariable(name: "f_to", scope: !900, file: !3, line: 228, type: !24)
!906 = !DILocation(line: 223, column: 24, scope: !900)
!907 = !DILocation(line: 223, column: 34, scope: !900)
!908 = !DILocation(line: 225, column: 19, scope: !900)
!909 = !DILocation(line: 225, column: 3, scope: !900)
!910 = !DILocation(line: 226, column: 7, scope: !900)
!911 = !DILocation(line: 228, column: 22, scope: !900)
!912 = !DILocation(line: 228, column: 15, scope: !900)
!913 = !DILocation(line: 230, column: 5, scope: !914)
!914 = distinct !DILexicalBlock(scope: !900, file: !3, line: 229, column: 15)
!915 = !DILocation(line: 231, column: 5, scope: !914)
!916 = !DILocation(line: 233, column: 3, scope: !900)
!917 = !DILocation(line: 234, column: 1, scope: !900)
!918 = distinct !DISubprogram(name: "fiber_second", scope: !3, file: !3, line: 211, type: !64, scopeLine: 212, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !919)
!919 = !{!920, !921, !922, !923}
!920 = !DILocalVariable(name: "i", arg: 1, scope: !918, file: !3, line: 211, type: !33)
!921 = !DILocalVariable(name: "o", arg: 2, scope: !918, file: !3, line: 211, type: !66)
!922 = !DILocalVariable(name: "a", scope: !918, file: !3, line: 214, type: !50)
!923 = !DILocalVariable(name: "f_to", scope: !918, file: !3, line: 215, type: !24)
!924 = !DILocation(line: 211, column: 25, scope: !918)
!925 = !DILocation(line: 211, column: 35, scope: !918)
!926 = !DILocation(line: 213, column: 19, scope: !918)
!927 = !DILocation(line: 213, column: 3, scope: !918)
!928 = !DILocation(line: 214, column: 7, scope: !918)
!929 = !DILocation(line: 215, column: 22, scope: !918)
!930 = !DILocation(line: 215, column: 15, scope: !918)
!931 = !DILocation(line: 217, column: 5, scope: !932)
!932 = distinct !DILexicalBlock(scope: !918, file: !3, line: 216, column: 15)
!933 = !DILocation(line: 218, column: 5, scope: !932)
!934 = !DILocation(line: 220, column: 3, scope: !918)
!935 = !DILocation(line: 221, column: 1, scope: !918)
!936 = distinct !DISubprogram(name: "handle_fibers3", scope: !3, file: !3, line: 489, type: !141, scopeLine: 490, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !937)
!937 = !{!938, !939}
!938 = !DILocalVariable(name: "buf", arg: 1, scope: !936, file: !3, line: 489, type: !137)
!939 = !DILocalVariable(name: "priv", arg: 2, scope: !936, file: !3, line: 489, type: !33)
!940 = !DILocation(line: 489, column: 24, scope: !936)
!941 = !DILocation(line: 489, column: 36, scope: !936)
!942 = !DILocation(line: 358, column: 3, scope: !943, inlinedAt: !947)
!943 = distinct !DISubprogram(name: "test_fibers_counter", scope: !3, file: !3, line: 357, type: !561, scopeLine: 357, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !944)
!944 = !{!945, !946}
!945 = !DILocalVariable(name: "even", scope: !943, file: !3, line: 358, type: !24)
!946 = !DILocalVariable(name: "odd", scope: !943, file: !3, line: 359, type: !24)
!947 = distinct !DILocation(line: 491, column: 3, scope: !936)
!948 = !DILocation(line: 359, column: 3, scope: !943, inlinedAt: !947)
!949 = !DILocation(line: 258, column: 26, scope: !567, inlinedAt: !950)
!950 = distinct !DILocation(line: 360, column: 8, scope: !943, inlinedAt: !947)
!951 = !DILocation(line: 258, column: 26, scope: !568, inlinedAt: !950)
!952 = !DILocation(line: 360, column: 26, scope: !943, inlinedAt: !947)
!953 = !DILocation(line: 360, column: 6, scope: !943, inlinedAt: !947)
!954 = !DILocation(line: 358, column: 15, scope: !943, inlinedAt: !947)
!955 = !DILocation(line: 361, column: 3, scope: !943, inlinedAt: !947)
!956 = !DILocation(line: 359, column: 15, scope: !943, inlinedAt: !947)
!957 = !DILocation(line: 362, column: 3, scope: !943, inlinedAt: !947)
!958 = !DILocation(line: 365, column: 1, scope: !943, inlinedAt: !947)
!959 = !DILocation(line: 493, column: 3, scope: !936)
!960 = distinct !DISubprogram(name: "print_even", scope: !3, file: !3, line: 172, type: !64, scopeLine: 172, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !961)
!961 = !{!962, !963, !964}
!962 = !DILocalVariable(name: "i", arg: 1, scope: !960, file: !3, line: 172, type: !33)
!963 = !DILocalVariable(name: "o", arg: 2, scope: !960, file: !3, line: 172, type: !66)
!964 = !DILocalVariable(name: "i", scope: !965, file: !3, line: 174, type: !50)
!965 = distinct !DILexicalBlock(scope: !960, file: !3, line: 174, column: 3)
!966 = !DILocation(line: 172, column: 23, scope: !960)
!967 = !DILocation(line: 172, column: 33, scope: !960)
!968 = !DILocation(line: 173, column: 19, scope: !960)
!969 = !DILocation(line: 173, column: 3, scope: !960)
!970 = !DILocation(line: 174, column: 12, scope: !965)
!971 = !DILocation(line: 176, column: 7, scope: !972)
!972 = distinct !DILexicalBlock(scope: !973, file: !3, line: 175, column: 22)
!973 = distinct !DILexicalBlock(scope: !974, file: !3, line: 175, column: 9)
!974 = distinct !DILexicalBlock(scope: !975, file: !3, line: 174, column: 31)
!975 = distinct !DILexicalBlock(scope: !965, file: !3, line: 174, column: 3)
!976 = !DILocation(line: 177, column: 7, scope: !972)
!977 = !DILocation(line: 180, column: 3, scope: !960)
!978 = !DILocation(line: 182, column: 3, scope: !960)
!979 = distinct !DISubprogram(name: "print_odd", scope: !3, file: !3, line: 185, type: !64, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !980)
!980 = !{!981, !982, !983}
!981 = !DILocalVariable(name: "i", arg: 1, scope: !979, file: !3, line: 185, type: !33)
!982 = !DILocalVariable(name: "o", arg: 2, scope: !979, file: !3, line: 185, type: !66)
!983 = !DILocalVariable(name: "i", scope: !984, file: !3, line: 187, type: !50)
!984 = distinct !DILexicalBlock(scope: !979, file: !3, line: 187, column: 3)
!985 = !DILocation(line: 185, column: 22, scope: !979)
!986 = !DILocation(line: 185, column: 32, scope: !979)
!987 = !DILocation(line: 186, column: 19, scope: !979)
!988 = !DILocation(line: 186, column: 3, scope: !979)
!989 = !DILocation(line: 187, column: 12, scope: !984)
!990 = !DILocation(line: 189, column: 7, scope: !991)
!991 = distinct !DILexicalBlock(scope: !992, file: !3, line: 188, column: 22)
!992 = distinct !DILexicalBlock(scope: !993, file: !3, line: 188, column: 9)
!993 = distinct !DILexicalBlock(scope: !994, file: !3, line: 187, column: 31)
!994 = distinct !DILexicalBlock(scope: !984, file: !3, line: 187, column: 3)
!995 = !DILocation(line: 190, column: 7, scope: !991)
!996 = !DILocation(line: 193, column: 3, scope: !979)
!997 = !DILocation(line: 195, column: 3, scope: !979)
!998 = distinct !DISubprogram(name: "handle_fibers2", scope: !3, file: !3, line: 481, type: !141, scopeLine: 482, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !999)
!999 = !{!1000, !1001}
!1000 = !DILocalVariable(name: "buf", arg: 1, scope: !998, file: !3, line: 481, type: !137)
!1001 = !DILocalVariable(name: "priv", arg: 2, scope: !998, file: !3, line: 481, type: !33)
!1002 = !DILocation(line: 481, column: 24, scope: !998)
!1003 = !DILocation(line: 481, column: 36, scope: !998)
!1004 = !DILocation(line: 369, column: 3, scope: !1005, inlinedAt: !1008)
!1005 = distinct !DISubprogram(name: "test_nested_fibers", scope: !3, file: !3, line: 367, type: !561, scopeLine: 368, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1006)
!1006 = !{!1007}
!1007 = !DILocalVariable(name: "f_outer", scope: !1005, file: !3, line: 369, type: !24)
!1008 = distinct !DILocation(line: 483, column: 3, scope: !998)
!1009 = !DILocation(line: 258, column: 26, scope: !567, inlinedAt: !1010)
!1010 = distinct !DILocation(line: 370, column: 8, scope: !1005, inlinedAt: !1008)
!1011 = !DILocation(line: 258, column: 26, scope: !568, inlinedAt: !1010)
!1012 = !DILocation(line: 370, column: 26, scope: !1005, inlinedAt: !1008)
!1013 = !DILocation(line: 370, column: 6, scope: !1005, inlinedAt: !1008)
!1014 = !DILocation(line: 371, column: 3, scope: !1005, inlinedAt: !1008)
!1015 = !DILocation(line: 369, column: 15, scope: !1005, inlinedAt: !1008)
!1016 = !DILocation(line: 372, column: 3, scope: !1005, inlinedAt: !1008)
!1017 = !DILocation(line: 374, column: 1, scope: !1005, inlinedAt: !1008)
!1018 = !DILocation(line: 485, column: 3, scope: !998)
!1019 = distinct !DISubprogram(name: "fiber_outer", scope: !3, file: !3, line: 79, type: !64, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1020)
!1020 = !{!1021, !1022, !1023, !1024}
!1021 = !DILocalVariable(name: "i", arg: 1, scope: !1019, file: !3, line: 79, type: !33)
!1022 = !DILocalVariable(name: "o", arg: 2, scope: !1019, file: !3, line: 79, type: !66)
!1023 = !DILocalVariable(name: "a", scope: !1019, file: !3, line: 82, type: !50)
!1024 = !DILocalVariable(name: "f_inner", scope: !1025, file: !3, line: 85, type: !24)
!1025 = distinct !DILexicalBlock(scope: !1019, file: !3, line: 83, column: 15)
!1026 = !DILocation(line: 79, column: 24, scope: !1019)
!1027 = !DILocation(line: 79, column: 34, scope: !1019)
!1028 = !DILocation(line: 81, column: 19, scope: !1019)
!1029 = !DILocation(line: 81, column: 3, scope: !1019)
!1030 = !DILocation(line: 82, column: 7, scope: !1019)
!1031 = !DILocation(line: 84, column: 5, scope: !1025)
!1032 = !DILocation(line: 85, column: 5, scope: !1025)
!1033 = !DILocation(line: 85, column: 17, scope: !1025)
!1034 = !DILocation(line: 86, column: 5, scope: !1025)
!1035 = !DILocation(line: 87, column: 5, scope: !1025)
!1036 = !DILocation(line: 88, column: 3, scope: !1019)
!1037 = !DILocation(line: 89, column: 3, scope: !1019)
!1038 = !DILocation(line: 90, column: 1, scope: !1019)
!1039 = distinct !DISubprogram(name: "fiber_inner", scope: !3, file: !3, line: 68, type: !64, scopeLine: 69, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1040)
!1040 = !{!1041, !1042, !1043}
!1041 = !DILocalVariable(name: "i", arg: 1, scope: !1039, file: !3, line: 68, type: !33)
!1042 = !DILocalVariable(name: "o", arg: 2, scope: !1039, file: !3, line: 68, type: !66)
!1043 = !DILocalVariable(name: "a", scope: !1039, file: !3, line: 71, type: !50)
!1044 = !DILocation(line: 68, column: 24, scope: !1039)
!1045 = !DILocation(line: 68, column: 34, scope: !1039)
!1046 = !DILocation(line: 70, column: 19, scope: !1039)
!1047 = !DILocation(line: 70, column: 3, scope: !1039)
!1048 = !DILocation(line: 71, column: 7, scope: !1039)
!1049 = !DILocation(line: 73, column: 5, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1039, file: !3, line: 72, column: 16)
!1051 = !DILocation(line: 74, column: 5, scope: !1050)
!1052 = !DILocation(line: 76, column: 3, scope: !1039)
!1053 = !DILocation(line: 77, column: 1, scope: !1039)
!1054 = distinct !DISubprogram(name: "handle_fibers10", scope: !3, file: !3, line: 540, type: !141, scopeLine: 541, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1055)
!1055 = !{!1056, !1057}
!1056 = !DILocalVariable(name: "buf", arg: 1, scope: !1054, file: !3, line: 540, type: !137)
!1057 = !DILocalVariable(name: "priv", arg: 2, scope: !1054, file: !3, line: 540, type: !33)
!1058 = !DILocation(line: 540, column: 25, scope: !1054)
!1059 = !DILocation(line: 540, column: 37, scope: !1054)
!1060 = !DILocation(line: 459, column: 3, scope: !1061, inlinedAt: !1065)
!1061 = distinct !DISubprogram(name: "test_fiber_timing", scope: !3, file: !3, line: 458, type: !561, scopeLine: 458, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1062)
!1062 = !{!1063, !1064}
!1063 = !DILocalVariable(name: "first", scope: !1061, file: !3, line: 459, type: !24)
!1064 = !DILocalVariable(name: "second", scope: !1061, file: !3, line: 460, type: !24)
!1065 = distinct !DILocation(line: 542, column: 3, scope: !1054)
!1066 = !DILocation(line: 460, column: 3, scope: !1061, inlinedAt: !1065)
!1067 = !DILocation(line: 258, column: 26, scope: !567, inlinedAt: !1068)
!1068 = distinct !DILocation(line: 461, column: 8, scope: !1061, inlinedAt: !1065)
!1069 = !DILocation(line: 258, column: 26, scope: !568, inlinedAt: !1068)
!1070 = !DILocation(line: 461, column: 26, scope: !1061, inlinedAt: !1065)
!1071 = !DILocation(line: 461, column: 6, scope: !1061, inlinedAt: !1065)
!1072 = !DILocation(line: 459, column: 15, scope: !1061, inlinedAt: !1065)
!1073 = !DILocation(line: 463, column: 3, scope: !1061, inlinedAt: !1065)
!1074 = !DILocation(line: 460, column: 15, scope: !1061, inlinedAt: !1065)
!1075 = !DILocation(line: 464, column: 3, scope: !1061, inlinedAt: !1065)
!1076 = !DILocation(line: 467, column: 1, scope: !1061, inlinedAt: !1065)
!1077 = !DILocation(line: 543, column: 3, scope: !1054)
!1078 = distinct !DISubprogram(name: "first_timer", scope: !3, file: !3, line: 326, type: !64, scopeLine: 327, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1079)
!1079 = !{!1080, !1081, !1082, !1083, !1084}
!1080 = !DILocalVariable(name: "i", arg: 1, scope: !1078, file: !3, line: 326, type: !33)
!1081 = !DILocalVariable(name: "o", arg: 2, scope: !1078, file: !3, line: 326, type: !66)
!1082 = !DILocalVariable(name: "a", scope: !1078, file: !3, line: 329, type: !50)
!1083 = !DILocalVariable(name: "start", scope: !1078, file: !3, line: 330, type: !29)
!1084 = !DILocalVariable(name: "end", scope: !1078, file: !3, line: 331, type: !29)
!1085 = !DILocation(line: 326, column: 24, scope: !1078)
!1086 = !DILocation(line: 326, column: 34, scope: !1078)
!1087 = !DILocation(line: 328, column: 19, scope: !1078)
!1088 = !DILocation(line: 328, column: 3, scope: !1078)
!1089 = !DILocation(line: 329, column: 7, scope: !1078)
!1090 = !DILocation(line: 330, column: 12, scope: !1078)
!1091 = !DILocation(line: 331, column: 12, scope: !1078)
!1092 = !DILocation(line: 332, column: 3, scope: !1078)
!1093 = !DILocation(line: 333, column: 11, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1095, file: !3, line: 333, column: 9)
!1095 = distinct !DILexicalBlock(scope: !1078, file: !3, line: 332, column: 15)
!1096 = !DILocation(line: 333, column: 9, scope: !1095)
!1097 = !DILocation(line: 268, column: 5, scope: !1098, inlinedAt: !1105)
!1098 = distinct !DISubprogram(name: "rdtsc", scope: !1099, file: !1099, line: 265, type: !1100, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1102)
!1099 = !DIFile(filename: "include/nautilus/cpu.h", directory: "/home/sgi9754/nautilus-cs446")
!1100 = !DISubroutineType(types: !1101)
!1101 = !{!29}
!1102 = !{!1103, !1104}
!1103 = !DILocalVariable(name: "lo", scope: !1098, file: !1099, line: 267, type: !43)
