; ModuleID = 'src/test/instrument_link.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.shell_cmd_impl = type { i8*, i8*, i32 (i8*, i8*)* }
%struct.nk_virtual_console = type opaque
%struct.naut_info = type { %struct.sys_info, %struct.cmdline_state*, %struct.nk_test_harness* }
%struct.sys_info = type { [256 x %struct.cpu*], [16 x %struct.ioapic*], i32, i32, i64, %struct.nk_barrier*, %struct.nk_mem_info, i32, i8, %struct.pci_info*, %struct.hpet_dev*, %struct.multiboot_info*, %struct.nk_int_info, %struct.nk_locality_info, %struct.pmc_info*, %struct.nk_link_info*, %struct.nk_prog_info* }
%struct.cpu = type { %struct.nk_thread*, i16, i16, i64, i64, %struct.nk_fiber_percpu_state*, i32, i32, i8, i8, i32, i32, i8, %struct.apic_dev*, %struct.sys_info*, i32, %struct.nk_sched_percpu_state*, %struct.nk_queue*, %struct.nk_xcall, i64, %struct.nk_topo_params*, %struct.nk_cpu_coords*, %struct.numa_domain*, %struct.nk_queue_entry, %struct.nk_rand_info* }
%struct.nk_thread = type { i64, i8*, i16, i16, i64, i64, i32, %struct.nk_thread*, %struct.list_head, %struct.list_head, i64, %struct.nk_wait_queue*, i32, %struct.nk_timer*, i32, i32, i32, i32, i8, i8**, i8*, i8*, void (i8*, i8**)*, %struct.nk_sched_thread_state*, %struct.nk_virtual_console*, [32 x i8], [256 x i8*], [32 x i8], [4096 x i8] }
%struct.list_head = type { %struct.list_head*, %struct.list_head* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl1", scope: !2, file: !3, line: 156, type: !108, isLocal: true, isDefinition: true, align: 64)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 8.0.0 (tags/RELEASE_800/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !23, globals: !105, nameTableKind: None)
!3 = !DIFile(filename: "src/test/instrument.c", directory: "/home/sgi9754/nautilus-cs446")
!4 = !{!5, !15}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 58, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "include/nautilus/fiber.h", directory: "/home/sgi9754/nautilus-cs446")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14}
!9 = !DIEnumerator(name: "INIT", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "READY", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "YIELD", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "WAIT", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "EXIT", value: 4, isUnsigned: true)
!14 = !DIEnumerator(name: "RUN", value: 5, isUnsigned: true)
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 166, baseType: !7, size: 32, elements: !17)
!16 = !DIFile(filename: "include/nautilus/thread.h", directory: "/home/sgi9754/nautilus-cs446")
!17 = !{!18, !19, !20, !21, !22}
!18 = !DIEnumerator(name: "NK_THR_INIT", value: 0, isUnsigned: true)
!19 = !DIEnumerator(name: "NK_THR_RUNNING", value: 1, isUnsigned: true)
!20 = !DIEnumerator(name: "NK_THR_WAITING", value: 2, isUnsigned: true)
!21 = !DIEnumerator(name: "NK_THR_SUSPENDED", value: 3, isUnsigned: true)
!22 = !DIEnumerator(name: "NK_THR_EXITED", value: 4, isUnsigned: true)
!23 = !{!24, !28, !31, !32, !50}
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !26, line: 50, baseType: !27)
!26 = !DIFile(filename: "include/nautilus/naut_types.h", directory: "/home/sgi9754/nautilus-cs446")
!27 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !26, line: 61, baseType: !30)
!30 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_thread_t", file: !16, line: 233, baseType: !34)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_thread", file: !16, line: 178, size: 51200, elements: !35)
!35 = !{!36, !37, !38, !41, !44, !46, !47, !49, !51, !58, !59, !60, !64, !65, !68, !70, !71, !72, !73, !74, !76, !77, !78, !83, !87, !90, !95, !101}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "rsp", scope: !34, file: !16, line: 179, baseType: !25, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !34, file: !16, line: 180, baseType: !31, size: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_state_offset", scope: !34, file: !16, line: 181, baseType: !39, size: 16, offset: 128)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !26, line: 58, baseType: !40)
!40 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "cache_part_state", scope: !34, file: !16, line: 183, baseType: !42, size: 16, offset: 144)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_cache_part_thread_state_t", file: !43, line: 32, baseType: !39)
!43 = !DIFile(filename: "include/nautilus/cachepart.h", directory: "/home/sgi9754/nautilus-cs446")
!44 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !34, file: !16, line: 185, baseType: !45, size: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_stack_size_t", file: !6, line: 43, baseType: !25)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !34, file: !16, line: 186, baseType: !27, size: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !34, file: !16, line: 188, baseType: !48, size: 32, offset: 320)
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !34, file: !16, line: 191, baseType: !50, size: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !34, file: !16, line: 192, baseType: !52, size: 128, offset: 448)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !53, line: 64, size: 128, elements: !54)
!53 = !DIFile(filename: "include/nautilus/list.h", directory: "/home/sgi9754/nautilus-cs446")
!54 = !{!55, !57}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !52, file: !53, line: 65, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !52, file: !53, line: 65, baseType: !56, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "child_node", scope: !34, file: !16, line: 193, baseType: !52, size: 128, offset: 576)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !34, file: !16, line: 194, baseType: !27, size: 64, offset: 704)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !34, file: !16, line: 196, baseType: !61, size: 64, offset: 768)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_wait_queue_t", file: !16, line: 175, baseType: !63)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_wait_queue", file: !16, line: 175, flags: DIFlagFwdDecl)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "num_wait", scope: !34, file: !16, line: 198, baseType: !48, size: 32, offset: 832)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !34, file: !16, line: 201, baseType: !66, size: 64, offset: 896)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_timer", file: !16, line: 201, flags: DIFlagFwdDecl)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !34, file: !16, line: 204, baseType: !69, size: 32, offset: 960)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_thread_status_t", file: !16, line: 172, baseType: !15)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "bound_cpu", scope: !34, file: !16, line: 206, baseType: !48, size: 32, offset: 992)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "placement_cpu", scope: !34, file: !16, line: 207, baseType: !48, size: 32, offset: 1024)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "current_cpu", scope: !34, file: !16, line: 208, baseType: !48, size: 32, offset: 1056)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "is_idle", scope: !34, file: !16, line: 210, baseType: !29, size: 8, offset: 1088)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "output_loc", scope: !34, file: !16, line: 212, baseType: !75, size: 64, offset: 1152)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !34, file: !16, line: 213, baseType: !31, size: 64, offset: 1216)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !34, file: !16, line: 214, baseType: !31, size: 64, offset: 1280)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !34, file: !16, line: 215, baseType: !79, size: 64, offset: 1344)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_thread_fun_t", file: !16, line: 61, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !31, !75}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "sched_state", scope: !34, file: !16, line: 217, baseType: !84, size: 64, offset: 1408)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_sched_thread_state", file: !86, line: 99, flags: DIFlagFwdDecl)
!86 = !DIFile(filename: "include/nautilus/scheduler.h", directory: "/home/sgi9754/nautilus-cs446")
!87 = !DIDerivedType(tag: DW_TAG_member, name: "vc", scope: !34, file: !16, line: 219, baseType: !88, size: 64, offset: 1472)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_virtual_console", file: !6, line: 82, flags: DIFlagFwdDecl)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !34, file: !16, line: 225, baseType: !91, size: 256, offset: 1536)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !92, size: 256, elements: !93)
!92 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!93 = !{!94}
!94 = !DISubrange(count: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !34, file: !16, line: 227, baseType: !96, size: 16384, offset: 1792)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !97, size: 16384, elements: !99)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!99 = !{!100}
!100 = !DISubrange(count: 256)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_state", scope: !34, file: !16, line: 229, baseType: !102, size: 32768, align: 512, offset: 18432)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 32768, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 4096)
!105 = !{!0, !106, !119, !121}
!106 = !DIGlobalVariableExpression(var: !107, expr: !DIExpression())
!107 = distinct !DIGlobalVariable(name: "_nk_cmd_fibers_impl2", scope: !2, file: !3, line: 157, type: !108, isLocal: true, isDefinition: true, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "shell_cmd_impl", file: !110, line: 43, size: 192, elements: !111)
!110 = !DIFile(filename: "include/nautilus/shell.h", directory: "/home/sgi9754/nautilus-cs446")
!111 = !{!112, !114, !115}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "cmd", scope: !109, file: !110, line: 44, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "help_str", scope: !109, file: !110, line: 45, baseType: !113, size: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !109, file: !110, line: 46, baseType: !116, size: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DISubroutineType(types: !118)
!118 = !{!48, !113, !31}
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "fibers_impl1", scope: !2, file: !3, line: 142, type: !109, isLocal: true, isDefinition: true)
!121 = !DIGlobalVariableExpression(var: !122, expr: !DIExpression())
!122 = distinct !DIGlobalVariable(name: "fibers_impl2", scope: !2, file: !3, line: 148, type: !109, isLocal: true, isDefinition: true)
!123 = distinct !DICompileUnit(language: DW_LANG_C99, file: !124, producer: "clang version 8.0.0 (tags/RELEASE_800/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !125, retainedTypes: !239, nameTableKind: None)
!124 = !DIFile(filename: "src/nautilus/fiber.c", directory: "/home/sgi9754/nautilus-cs446")
!125 = !{!126, !15, !5, !208, !215, !222, !228, !234}
!126 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !128, file: !127, line: 40, baseType: !7, size: 32, elements: !204)
!127 = !DIFile(filename: "include/nautilus/timer.h", directory: "/home/sgi9754/nautilus-cs446")
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_timer", file: !127, line: 38, size: 960, elements: !129)
!129 = !{!130, !131, !133, !134, !135, !196, !197, !201, !202, !203}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !127, line: 39, baseType: !91, size: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !128, file: !127, line: 42, baseType: !132, size: 32, offset: 256)
!132 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !126)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !128, file: !127, line: 43, baseType: !25, size: 64, offset: 320)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "time_ns", scope: !128, file: !127, line: 44, baseType: !25, size: 64, offset: 384)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !128, file: !127, line: 45, baseType: !136, size: 64, offset: 448)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_wait_queue_t", file: !127, line: 33, baseType: !138)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_wait_queue", file: !139, line: 85, size: 197248, elements: !140)
!139 = !DIFile(filename: "include/nautilus/waitqueue.h", directory: "/home/sgi9754/nautilus-cs446")
!140 = !{!141, !142, !146, !152, !153, !154}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !138, file: !139, line: 86, baseType: !91, size: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !138, file: !139, line: 87, baseType: !143, size: 32, offset: 256)
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "spinlock_t", file: !144, line: 39, baseType: !145)
!144 = !DIFile(filename: "include/nautilus/spinlock.h", directory: "/home/sgi9754/nautilus-cs446")
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !26, line: 54, baseType: !7)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !138, file: !139, line: 88, baseType: !147, size: 128, offset: 320)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "list_head", file: !53, line: 64, size: 128, elements: !148)
!148 = !{!149, !151}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !147, file: !53, line: 65, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !147, file: !53, line: 65, baseType: !150, size: 64, offset: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "num_wait", scope: !138, file: !139, line: 89, baseType: !25, size: 64, offset: 448)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !138, file: !139, line: 90, baseType: !147, size: 128, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !138, file: !139, line: 91, baseType: !155, size: 196608, offset: 640)
!155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 196608, elements: !194)
!156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_wait_queue_entry", file: !139, line: 70, size: 192, elements: !157)
!157 = !{!158, !159}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !156, file: !139, line: 71, baseType: !147, size: 128)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !156, file: !139, line: 72, baseType: !160, size: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_thread", file: !16, line: 178, size: 51200, elements: !162)
!162 = !{!163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !177, !178, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "rsp", scope: !161, file: !16, line: 179, baseType: !25, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !161, file: !16, line: 180, baseType: !31, size: 64, offset: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_state_offset", scope: !161, file: !16, line: 181, baseType: !39, size: 16, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "cache_part_state", scope: !161, file: !16, line: 183, baseType: !42, size: 16, offset: 144)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !161, file: !16, line: 185, baseType: !45, size: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "tid", scope: !161, file: !16, line: 186, baseType: !27, size: 64, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !161, file: !16, line: 188, baseType: !48, size: 32, offset: 320)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !161, file: !16, line: 191, baseType: !160, size: 64, offset: 384)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "children", scope: !161, file: !16, line: 192, baseType: !147, size: 128, offset: 448)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "child_node", scope: !161, file: !16, line: 193, baseType: !147, size: 128, offset: 576)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "refcount", scope: !161, file: !16, line: 194, baseType: !27, size: 64, offset: 704)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "waitq", scope: !161, file: !16, line: 196, baseType: !175, size: 64, offset: 768)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !176, size: 64)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_wait_queue_t", file: !16, line: 175, baseType: !138)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "num_wait", scope: !161, file: !16, line: 198, baseType: !48, size: 32, offset: 832)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "timer", scope: !161, file: !16, line: 201, baseType: !179, size: 64, offset: 896)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !161, file: !16, line: 204, baseType: !69, size: 32, offset: 960)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "bound_cpu", scope: !161, file: !16, line: 206, baseType: !48, size: 32, offset: 992)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "placement_cpu", scope: !161, file: !16, line: 207, baseType: !48, size: 32, offset: 1024)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "current_cpu", scope: !161, file: !16, line: 208, baseType: !48, size: 32, offset: 1056)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "is_idle", scope: !161, file: !16, line: 210, baseType: !29, size: 8, offset: 1088)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "output_loc", scope: !161, file: !16, line: 212, baseType: !75, size: 64, offset: 1152)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !161, file: !16, line: 213, baseType: !31, size: 64, offset: 1216)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !161, file: !16, line: 214, baseType: !31, size: 64, offset: 1280)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !161, file: !16, line: 215, baseType: !79, size: 64, offset: 1344)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "sched_state", scope: !161, file: !16, line: 217, baseType: !84, size: 64, offset: 1408)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "vc", scope: !161, file: !16, line: 219, baseType: !88, size: 64, offset: 1472)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !161, file: !16, line: 225, baseType: !91, size: 256, offset: 1536)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "tls", scope: !161, file: !16, line: 227, baseType: !96, size: 16384, offset: 1792)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_state", scope: !161, file: !16, line: 229, baseType: !102, size: 32768, align: 512, offset: 18432)
!194 = !{!195}
!195 = !DISubrange(count: 1024)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "cpu", scope: !128, file: !127, line: 46, baseType: !145, size: 32, offset: 512)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !128, file: !127, line: 47, baseType: !198, size: 64, offset: 576)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !31}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "priv", scope: !128, file: !127, line: 48, baseType: !31, size: 64, offset: 640)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !128, file: !127, line: 49, baseType: !147, size: 128, offset: 704)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "active_node", scope: !128, file: !127, line: 50, baseType: !147, size: 128, offset: 832)
!204 = !{!205, !206, !207}
!205 = !DIEnumerator(name: "NK_TIMER_INACTIVE", value: 0, isUnsigned: true)
!206 = !DIEnumerator(name: "NK_TIMER_ACTIVE", value: 1, isUnsigned: true)
!207 = !DIEnumerator(name: "NK_TIMER_SIGNALLED", value: 2, isUnsigned: true)
!208 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !209, line: 225, baseType: !7, size: 32, elements: !210)
!209 = !DIFile(filename: "include/dev/apic.h", directory: "/home/sgi9754/nautilus-cs446")
!210 = !{!211, !212, !213, !214}
!211 = !DIEnumerator(name: "APIC_INVALID", value: 0, isUnsigned: true)
!212 = !DIEnumerator(name: "APIC_DISABLED", value: 1, isUnsigned: true)
!213 = !DIEnumerator(name: "APIC_XAPIC", value: 2, isUnsigned: true)
!214 = !DIEnumerator(name: "APIC_X2APIC", value: 3, isUnsigned: true)
!215 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !216, line: 41, baseType: !7, size: 32, elements: !217)
!216 = !DIFile(filename: "include/nautilus/irq.h", directory: "/home/sgi9754/nautilus-cs446")
!217 = !{!218, !219, !220, !221}
!218 = !DIEnumerator(name: "INT_TRIG_BUS", value: 0, isUnsigned: true)
!219 = !DIEnumerator(name: "INT_TRIG_EDGE", value: 1, isUnsigned: true)
!220 = !DIEnumerator(name: "INT_TRIG_RSVD", value: 2, isUnsigned: true)
!221 = !DIEnumerator(name: "INT_TRIG_LEVEL", value: 3, isUnsigned: true)
!222 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !216, line: 40, baseType: !7, size: 32, elements: !223)
!223 = !{!224, !225, !226, !227}
!224 = !DIEnumerator(name: "INT_POL_BUS", value: 0, isUnsigned: true)
!225 = !DIEnumerator(name: "INT_POL_ACTHI", value: 1, isUnsigned: true)
!226 = !DIEnumerator(name: "INT_POL_RSVD", value: 2, isUnsigned: true)
!227 = !DIEnumerator(name: "INT_POL_ACTLO", value: 3, isUnsigned: true)
!228 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !216, line: 39, baseType: !7, size: 32, elements: !229)
!229 = !{!230, !231, !232, !233}
!230 = !DIEnumerator(name: "INT_TYPE_INT", value: 0, isUnsigned: true)
!231 = !DIEnumerator(name: "INT_TYPE_NMI", value: 1, isUnsigned: true)
!232 = !DIEnumerator(name: "INT_TYPE_SMI", value: 2, isUnsigned: true)
!233 = !DIEnumerator(name: "INT_TYPE_EXT", value: 3, isUnsigned: true)
!234 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !86, line: 66, baseType: !7, size: 32, elements: !235)
!235 = !{!236, !237, !238}
!236 = !DIEnumerator(name: "APERIODIC", value: 0, isUnsigned: true)
!237 = !DIEnumerator(name: "SPORADIC", value: 1, isUnsigned: true)
!238 = !DIEnumerator(name: "PERIODIC", value: 2, isUnsigned: true)
!239 = !{!24, !240, !113, !263, !25, !264, !291, !31, !75, !270, !48, !28, !280, !492, !285, !160}
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_fiber_t", file: !6, line: 104, baseType: !242)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_fiber", file: !6, line: 70, size: 1216, elements: !243)
!243 = !{!244, !245, !246, !247, !248, !249, !250, !252, !253, !254, !255, !256, !257, !258, !260, !261, !262}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "rsp", scope: !242, file: !6, line: 71, baseType: !25, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !242, file: !6, line: 72, baseType: !31, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_state_offset", scope: !242, file: !6, line: 73, baseType: !39, size: 16, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !242, file: !6, line: 75, baseType: !45, size: 64, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !242, file: !6, line: 76, baseType: !27, size: 64, offset: 256)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !242, file: !6, line: 78, baseType: !143, size: 32, offset: 320)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "f_status", scope: !242, file: !6, line: 79, baseType: !251, size: 32, offset: 352)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_fiber_status", file: !6, line: 66, baseType: !5)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "vc", scope: !242, file: !6, line: 82, baseType: !88, size: 64, offset: 384)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "is_idle", scope: !242, file: !6, line: 83, baseType: !48, size: 32, offset: 448)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "wait_queue", scope: !242, file: !6, line: 91, baseType: !147, size: 128, offset: 512)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "wait_node", scope: !242, file: !6, line: 92, baseType: !147, size: 128, offset: 640)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "num_wait", scope: !242, file: !6, line: 93, baseType: !48, size: 32, offset: 768)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "sched_node", scope: !242, file: !6, line: 97, baseType: !147, size: 128, offset: 832)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !242, file: !6, line: 99, baseType: !259, size: 64, offset: 960)
!259 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_fiber_fun_t", file: !6, line: 56, baseType: !80)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !242, file: !6, line: 100, baseType: !31, size: 64, offset: 1024)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !242, file: !6, line: 101, baseType: !75, size: 64, offset: 1088)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "is_done", scope: !242, file: !6, line: 103, baseType: !29, size: 8, offset: 1152)
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !26, line: 45, baseType: !27)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sys_info", file: !266, line: 183, size: 59840, elements: !267)
!266 = !DIFile(filename: "include/nautilus/nautilus.h", directory: "/home/sgi9754/nautilus-cs446")
!267 = !{!268, !385, !421, !422, !423, !424, !440, !451, !452, !453, !456, !459, !462, !474, !483, !486, !489}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "cpus", scope: !265, file: !266, line: 185, baseType: !269, size: 16384)
!269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 16384, elements: !99)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cpu", file: !272, line: 74, size: 1600, elements: !273)
!272 = !DIFile(filename: "include/nautilus/smp.h", directory: "/home/sgi9754/nautilus-cs446")
!273 = !{!274, !275, !276, !277, !278, !279, !290, !292, !293, !294, !295, !296, !297, !299, !321, !322, !323, !326, !334, !347, !348, !355, !362, !371, !376}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "cur_thread", scope: !271, file: !272, line: 75, baseType: !160, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_nesting_level", scope: !271, file: !272, line: 78, baseType: !39, size: 16, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "preempt_disable_level", scope: !271, file: !272, line: 81, baseType: !39, size: 16, offset: 80)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "interrupt_count", scope: !271, file: !272, line: 85, baseType: !25, size: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "exception_count", scope: !271, file: !272, line: 86, baseType: !25, size: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "f_state", scope: !271, file: !272, line: 88, baseType: !280, size: 64, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_fiber_percpu_state", file: !124, line: 60, size: 384, elements: !282)
!282 = !{!283, !284, !287, !288, !289}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !281, file: !124, line: 61, baseType: !143, size: 32)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "fiber_thread", scope: !281, file: !124, line: 62, baseType: !285, size: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_thread_t", file: !16, line: 233, baseType: !161)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "curr_fiber", scope: !281, file: !124, line: 63, baseType: !240, size: 64, offset: 128)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "idle_fiber", scope: !281, file: !124, line: 64, baseType: !240, size: 64, offset: 192)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "f_sched_queue", scope: !281, file: !124, line: 65, baseType: !147, size: 128, offset: 256)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !271, file: !272, line: 89, baseType: !291, size: 32, offset: 320)
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "cpu_id_t", file: !272, line: 58, baseType: !145)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "lapic_id", scope: !271, file: !272, line: 90, baseType: !145, size: 32, offset: 352)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !271, file: !272, line: 91, baseType: !29, size: 8, offset: 384)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "is_bsp", scope: !271, file: !272, line: 92, baseType: !29, size: 8, offset: 392)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_sig", scope: !271, file: !272, line: 93, baseType: !145, size: 32, offset: 416)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "feat_flags", scope: !271, file: !272, line: 94, baseType: !145, size: 32, offset: 448)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "booted", scope: !271, file: !272, line: 96, baseType: !298, size: 8, offset: 480)
!298 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !29)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "apic", scope: !271, file: !272, line: 98, baseType: !300, size: 64, offset: 512)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "apic_dev", file: !209, line: 227, size: 768, elements: !302)
!302 = !{!303, !305, !307, !308, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !301, file: !209, line: 228, baseType: !304, size: 32)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "apic_mode_t", file: !209, line: 225, baseType: !208)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "base_addr", scope: !301, file: !209, line: 229, baseType: !306, size: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "ulong_t", file: !26, line: 43, baseType: !27)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !301, file: !209, line: 230, baseType: !29, size: 8, offset: 128)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !301, file: !209, line: 231, baseType: !309, size: 32, offset: 160)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_t", file: !26, line: 37, baseType: !7)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "spur_int_cnt", scope: !301, file: !209, line: 232, baseType: !25, size: 64, offset: 192)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "err_int_cnt", scope: !301, file: !209, line: 233, baseType: !25, size: 64, offset: 256)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "bus_freq_hz", scope: !301, file: !209, line: 234, baseType: !25, size: 64, offset: 320)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ps_per_tick", scope: !301, file: !209, line: 235, baseType: !25, size: 64, offset: 384)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "cycles_per_us", scope: !301, file: !209, line: 236, baseType: !25, size: 64, offset: 448)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "cycles_per_tick", scope: !301, file: !209, line: 237, baseType: !25, size: 64, offset: 512)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "timer_set", scope: !301, file: !209, line: 238, baseType: !29, size: 8, offset: 576)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "current_ticks", scope: !301, file: !209, line: 239, baseType: !145, size: 32, offset: 608)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "timer_count", scope: !301, file: !209, line: 240, baseType: !25, size: 64, offset: 640)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "in_timer_interrupt", scope: !301, file: !209, line: 241, baseType: !48, size: 32, offset: 704)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "in_kick_interrupt", scope: !301, file: !209, line: 242, baseType: !48, size: 32, offset: 736)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "system", scope: !271, file: !272, line: 100, baseType: !264, size: 64, offset: 576)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !271, file: !272, line: 102, baseType: !143, size: 32, offset: 640)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "sched_state", scope: !271, file: !272, line: 104, baseType: !324, size: 64, offset: 704)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_sched_percpu_state", file: !272, line: 104, flags: DIFlagFwdDecl)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "xcall_q", scope: !271, file: !272, line: 106, baseType: !327, size: 64, offset: 768)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_queue_t", file: !329, line: 42, baseType: !330)
!329 = !DIFile(filename: "include/nautilus/queue.h", directory: "/home/sgi9754/nautilus-cs446")
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_queue", file: !329, line: 33, size: 192, elements: !331)
!331 = !{!332, !333}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !330, file: !329, line: 34, baseType: !147, size: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !330, file: !329, line: 35, baseType: !143, size: 32, offset: 128)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "xcall_nowait_info", scope: !271, file: !272, line: 107, baseType: !335, size: 320, offset: 832)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_xcall", file: !272, line: 61, size: 320, elements: !336)
!336 = !{!337, !342, !343, !345, !346}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "xcall_node", scope: !335, file: !272, line: 62, baseType: !338, size: 128)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_queue_entry_t", file: !329, line: 43, baseType: !339)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_queue_entry", file: !329, line: 38, size: 128, elements: !340)
!340 = !{!341}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !339, file: !329, line: 39, baseType: !147, size: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !335, file: !272, line: 63, baseType: !31, size: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !335, file: !272, line: 64, baseType: !344, size: 64, offset: 192)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_xcall_func_t", file: !272, line: 57, baseType: !198)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "xcall_done", scope: !335, file: !272, line: 65, baseType: !29, size: 8, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "has_waiter", scope: !335, file: !272, line: 66, baseType: !29, size: 8, offset: 264)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "cpu_khz", scope: !271, file: !272, line: 109, baseType: !306, size: 64, offset: 1152)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "tp", scope: !271, file: !272, line: 112, baseType: !349, size: 64, offset: 1216)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_topo_params", file: !351, line: 94, size: 64, elements: !352)
!351 = !DIFile(filename: "include/nautilus/numa.h", directory: "/home/sgi9754/nautilus-cs446")
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "smt_bits", scope: !350, file: !351, line: 95, baseType: !145, size: 32)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "core_bits", scope: !350, file: !351, line: 96, baseType: !145, size: 32, offset: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "coord", scope: !271, file: !272, line: 113, baseType: !356, size: 64, offset: 1280)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_cpu_coords", file: !351, line: 99, size: 96, elements: !358)
!358 = !{!359, !360, !361}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "smt_id", scope: !357, file: !351, line: 100, baseType: !145, size: 32)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "core_id", scope: !357, file: !351, line: 101, baseType: !145, size: 32, offset: 32)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_id", scope: !357, file: !351, line: 102, baseType: !145, size: 32, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "domain", scope: !271, file: !272, line: 114, baseType: !363, size: 64, offset: 1344)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "numa_domain", file: !351, line: 34, size: 448, elements: !365)
!365 = !{!366, !367, !368, !369, !370}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !364, file: !351, line: 35, baseType: !145, size: 32)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "addr_space_size", scope: !364, file: !351, line: 36, baseType: !25, size: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "num_regions", scope: !364, file: !351, line: 37, baseType: !145, size: 32, offset: 128)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "regions", scope: !364, file: !351, line: 39, baseType: !147, size: 128, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "adj_list", scope: !364, file: !351, line: 42, baseType: !147, size: 128, offset: 320)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "kmem", scope: !271, file: !272, line: 116, baseType: !372, size: 128, offset: 1408)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kmem_data", file: !373, line: 84, size: 128, elements: !374)
!373 = !DIFile(filename: "include/nautilus/mm.h", directory: "/home/sgi9754/nautilus-cs446")
!374 = !{!375}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ordered_regions", scope: !372, file: !373, line: 85, baseType: !147, size: 128)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "rand", scope: !271, file: !272, line: 119, baseType: !377, size: 64, offset: 1536)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_rand_info", file: !379, line: 33, size: 256, elements: !380)
!379 = !DIFile(filename: "include/nautilus/random.h", directory: "/home/sgi9754/nautilus-cs446")
!380 = !{!381, !382, !383, !384}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !378, file: !379, line: 34, baseType: !143, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "seed", scope: !378, file: !379, line: 35, baseType: !25, size: 64, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "xi", scope: !378, file: !379, line: 36, baseType: !25, size: 64, offset: 128)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !378, file: !379, line: 37, baseType: !25, size: 64, offset: 192)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ioapics", scope: !265, file: !266, line: 186, baseType: !386, size: 1024, offset: 16384)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 1024, elements: !419)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ioapic", file: !389, line: 113, size: 320, elements: !390)
!389 = !DIFile(filename: "include/dev/ioapic.h", directory: "/home/sgi9754/nautilus-cs446")
!390 = !{!391, !392, !393, !394, !396, !397, !418}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !388, file: !389, line: 114, baseType: !29, size: 8)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !388, file: !389, line: 115, baseType: !29, size: 8, offset: 8)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "usable", scope: !388, file: !389, line: 116, baseType: !29, size: 8, offset: 16)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !388, file: !389, line: 117, baseType: !395, size: 64, offset: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_t", file: !26, line: 64, baseType: !306)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "num_entries", scope: !388, file: !389, line: 119, baseType: !29, size: 8, offset: 128)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !388, file: !389, line: 120, baseType: !398, size: 64, offset: 192)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iored_entry", file: !389, line: 101, size: 192, elements: !400)
!400 = !{!401, !402, !417}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", scope: !399, file: !389, line: 103, baseType: !29, size: 8)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "boot_info", scope: !399, file: !389, line: 106, baseType: !403, size: 64, offset: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_int_entry", file: !216, line: 43, size: 256, elements: !405)
!405 = !{!406, !408, !410, !412, !413, !414, !415, !416}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "trig_mode", scope: !404, file: !216, line: 44, baseType: !407, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_trig_t", file: !216, line: 41, baseType: !215)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "polarity", scope: !404, file: !216, line: 45, baseType: !409, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_pol_t", file: !216, line: 40, baseType: !222)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !404, file: !216, line: 46, baseType: !411, size: 32, offset: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_type_t", file: !216, line: 39, baseType: !228)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "src_bus_id", scope: !404, file: !216, line: 47, baseType: !29, size: 8, offset: 96)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "src_bus_irq", scope: !404, file: !216, line: 48, baseType: !29, size: 8, offset: 104)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ioapic_intin", scope: !404, file: !216, line: 49, baseType: !29, size: 8, offset: 112)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ioapic_id", scope: !404, file: !216, line: 50, baseType: !29, size: 8, offset: 120)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "elm", scope: !404, file: !216, line: 52, baseType: !147, size: 128, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "actual_irq", scope: !399, file: !389, line: 109, baseType: !29, size: 8, offset: 128)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "first_hrt_entry", scope: !388, file: !389, line: 122, baseType: !7, size: 32, offset: 256)
!419 = !{!420}
!420 = !DISubrange(count: 16)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "num_cpus", scope: !265, file: !266, line: 188, baseType: !145, size: 32, offset: 17408)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "num_ioapics", scope: !265, file: !266, line: 189, baseType: !145, size: 32, offset: 17440)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !265, file: !266, line: 191, baseType: !25, size: 64, offset: 17472)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "core_barrier", scope: !265, file: !266, line: 194, baseType: !425, size: 64, offset: 17536)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_barrier_t", file: !427, line: 34, baseType: !428)
!427 = !DIFile(filename: "include/nautilus/barrier.h", directory: "/home/sgi9754/nautilus-cs446")
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_barrier", file: !427, line: 36, size: 1024, align: 512, elements: !429)
!429 = !{!430, !431, !432, !433, !434, !438}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !428, file: !427, line: 37, baseType: !143, size: 32)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "remaining", scope: !428, file: !427, line: 39, baseType: !7, size: 32, offset: 32)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "init_count", scope: !428, file: !427, line: 40, baseType: !7, size: 32, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !428, file: !427, line: 42, baseType: !29, size: 8, offset: 96)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !428, file: !427, line: 44, baseType: !435, size: 416, offset: 104)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !29, size: 416, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 52)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "notify", scope: !428, file: !427, line: 47, baseType: !439, size: 32, offset: 520)
!439 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !7)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !265, file: !266, line: 196, baseType: !441, size: 448, offset: 17600)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_mem_info", file: !442, line: 83, size: 448, elements: !443)
!442 = !DIFile(filename: "include/nautilus/paging.h", directory: "/home/sgi9754/nautilus-cs446")
!443 = !{!444, !446, !447, !448, !449, !450}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "page_map", scope: !441, file: !442, line: 84, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "pm_start", scope: !441, file: !442, line: 85, baseType: !395, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "pm_end", scope: !441, file: !442, line: 86, baseType: !395, size: 64, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "phys_mem_avail", scope: !441, file: !442, line: 87, baseType: !306, size: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "npages", scope: !441, file: !442, line: 88, baseType: !306, size: 64, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "mem_zone_list", scope: !441, file: !442, line: 90, baseType: !147, size: 128, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "bsp_id", scope: !265, file: !266, line: 198, baseType: !145, size: 32, offset: 18048)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "pic_mode_enabled", scope: !265, file: !266, line: 200, baseType: !29, size: 8, offset: 18080)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "pci", scope: !265, file: !266, line: 202, baseType: !454, size: 64, offset: 18112)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "pci_info", file: !266, line: 202, flags: DIFlagFwdDecl)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "hpet", scope: !265, file: !266, line: 203, baseType: !457, size: 64, offset: 18176)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "hpet_dev", file: !266, line: 178, flags: DIFlagFwdDecl)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "mb_info", scope: !265, file: !266, line: 205, baseType: !460, size: 64, offset: 18240)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = !DICompositeType(tag: DW_TAG_structure_type, name: "multiboot_info", file: !266, line: 205, flags: DIFlagFwdDecl)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "int_info", scope: !265, file: !266, line: 207, baseType: !463, size: 33024, offset: 18304)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_int_info", file: !266, line: 171, size: 33024, elements: !464)
!464 = !{!465, !466, !467}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "int_list", scope: !463, file: !266, line: 172, baseType: !147, size: 128)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "bus_list", scope: !463, file: !266, line: 173, baseType: !147, size: 128, offset: 128)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "irq_map", scope: !463, file: !266, line: 175, baseType: !468, size: 32768, offset: 256)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 32768, elements: !99)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "irq_mapping", file: !266, line: 164, size: 128, elements: !470)
!470 = !{!471, !472, !473}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "ioapic", scope: !469, file: !266, line: 165, baseType: !387, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !469, file: !266, line: 166, baseType: !29, size: 8, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "assigned", scope: !469, file: !266, line: 167, baseType: !29, size: 8, offset: 72)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "locality_info", scope: !265, file: !266, line: 209, baseType: !475, size: 8320, offset: 51328)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_locality_info", file: !351, line: 75, size: 8320, elements: !476)
!476 = !{!477, !478, !479}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "num_domains", scope: !475, file: !351, line: 76, baseType: !145, size: 32)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "numa_matrix", scope: !475, file: !351, line: 77, baseType: !28, size: 64, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "domains", scope: !475, file: !351, line: 79, baseType: !480, size: 8192, offset: 128)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !363, size: 8192, elements: !481)
!481 = !{!482}
!482 = !DISubrange(count: 128)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "pmc_info", scope: !265, file: !266, line: 211, baseType: !484, size: 64, offset: 59648)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "pmc_info", file: !266, line: 180, flags: DIFlagFwdDecl)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "linker_info", scope: !265, file: !266, line: 213, baseType: !487, size: 64, offset: 59712)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_link_info", file: !266, line: 181, flags: DIFlagFwdDecl)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "prog_info", scope: !265, file: !266, line: 215, baseType: !490, size: 64, offset: 59776)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "nk_prog_info", file: !266, line: 182, flags: DIFlagFwdDecl)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!493 = !{!"clang version 8.0.0 (tags/RELEASE_800/final)"}
!494 = !{i32 2, !"Dwarf Version", i32 4}
!495 = !{i32 2, !"Debug Info Version", i32 3}
!496 = !{i32 1, !"wchar_size", i32 4}
!497 = !{i32 1, !"Code Model", i32 4}
!498 = distinct !DISubprogram(name: "handle_fibers2", scope: !3, file: !3, line: 134, type: !117, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !499)
!499 = !{!500, !501}
!500 = !DILocalVariable(name: "buf", arg: 1, scope: !498, file: !3, line: 134, type: !113)
!501 = !DILocalVariable(name: "priv", arg: 2, scope: !498, file: !3, line: 134, type: !31)
!502 = !DILocation(line: 134, column: 23, scope: !498)
!503 = !DILocation(line: 134, column: 35, scope: !498)
!504 = !DILocation(line: 136, column: 3, scope: !498)
!505 = !DILocation(line: 137, column: 3, scope: !498)
!506 = distinct !DISubprogram(name: "test_simple_routine2", scope: !3, file: !3, line: 102, type: !507, scopeLine: 103, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !509)
!507 = !DISubroutineType(types: !508)
!508 = !{!48}
!509 = !{!510, !532, !533, !534, !535, !536, !538, !539}
!510 = !DILocalVariable(name: "simple1", scope: !506, file: !3, line: 104, type: !511)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "nk_fiber_t", file: !6, line: 104, baseType: !513)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nk_fiber", file: !6, line: 70, size: 1216, elements: !514)
!514 = !{!515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "rsp", scope: !513, file: !6, line: 71, baseType: !25, size: 64)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !513, file: !6, line: 72, baseType: !31, size: 64, offset: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "fpu_state_offset", scope: !513, file: !6, line: 73, baseType: !39, size: 16, offset: 128)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !513, file: !6, line: 75, baseType: !45, size: 64, offset: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "fid", scope: !513, file: !6, line: 76, baseType: !27, size: 64, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !513, file: !6, line: 78, baseType: !143, size: 32, offset: 320)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "f_status", scope: !513, file: !6, line: 79, baseType: !251, size: 32, offset: 352)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "vc", scope: !513, file: !6, line: 82, baseType: !88, size: 64, offset: 384)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "is_idle", scope: !513, file: !6, line: 83, baseType: !48, size: 32, offset: 448)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "wait_queue", scope: !513, file: !6, line: 91, baseType: !52, size: 128, offset: 512)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "wait_node", scope: !513, file: !6, line: 92, baseType: !52, size: 128, offset: 640)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "num_wait", scope: !513, file: !6, line: 93, baseType: !48, size: 32, offset: 768)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "sched_node", scope: !513, file: !6, line: 97, baseType: !52, size: 128, offset: 832)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "fun", scope: !513, file: !6, line: 99, baseType: !259, size: 64, offset: 960)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "input", scope: !513, file: !6, line: 100, baseType: !31, size: 64, offset: 1024)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "output", scope: !513, file: !6, line: 101, baseType: !75, size: 64, offset: 1088)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "is_done", scope: !513, file: !6, line: 103, baseType: !29, size: 8, offset: 1152)
!532 = !DILocalVariable(name: "simple2", scope: !506, file: !3, line: 105, type: !511)
!533 = !DILocalVariable(name: "t1", scope: !506, file: !3, line: 107, type: !25)
!534 = !DILocalVariable(name: "t2", scope: !506, file: !3, line: 108, type: !25)
!535 = !DILocalVariable(name: "f1_input", scope: !506, file: !3, line: 111, type: !24)
!536 = !DILocalVariable(name: "p", scope: !537, file: !3, line: 111, type: !31)
!537 = distinct !DILexicalBlock(scope: !506, file: !3, line: 111, column: 24)
!538 = !DILocalVariable(name: "f2_input", scope: !506, file: !3, line: 112, type: !24)
!539 = !DILocalVariable(name: "p", scope: !540, file: !3, line: 112, type: !31)
!540 = distinct !DILexicalBlock(scope: !506, file: !3, line: 112, column: 24)
!541 = !DILocation(line: 104, column: 3, scope: !506)
!542 = !DILocation(line: 105, column: 3, scope: !506)
!543 = !DILocation(line: 258, column: 26, scope: !544, inlinedAt: !552)
!544 = distinct !DILexicalBlock(scope: !545, file: !16, line: 258, column: 26)
!545 = distinct !DILexicalBlock(scope: !546, file: !16, line: 258, column: 26)
!546 = distinct !DISubprogram(name: "get_cur_thread", scope: !16, file: !16, line: 256, type: !547, scopeLine: 257, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !549)
!547 = !DISubroutineType(types: !548)
!548 = !{!32}
!549 = !{!550, !551}
!550 = !DILocalVariable(name: "__r", scope: !545, file: !16, line: 258, type: !50)
!551 = !DILocalVariable(name: "__r", scope: !544, file: !16, line: 258, type: !50)
!552 = distinct !DILocation(line: 106, column: 8, scope: !506)
!553 = !{i32 -2147285329}
!554 = !DILocation(line: 258, column: 26, scope: !545, inlinedAt: !552)
!555 = !DILocation(line: 106, column: 26, scope: !506)
!556 = !DILocation(line: 106, column: 6, scope: !506)
!557 = !DILocation(line: 107, column: 3, scope: !506)
!558 = !DILocation(line: 108, column: 3, scope: !506)
!559 = !DILocation(line: 109, column: 3, scope: !506)
!560 = !DILocation(line: 110, column: 3, scope: !506)
!561 = !DILocation(line: 111, column: 24, scope: !537)
!562 = !DILocation(line: 112, column: 24, scope: !540)
!563 = !DILocation(line: 113, column: 8, scope: !564)
!564 = distinct !DILexicalBlock(scope: !506, file: !3, line: 113, column: 7)
!565 = !DILocation(line: 113, column: 21, scope: !564)
!566 = !DILocation(line: 113, column: 17, scope: !564)
!567 = !DILocation(line: 114, column: 5, scope: !568)
!568 = distinct !DILexicalBlock(scope: !564, file: !3, line: 113, column: 31)
!569 = !DILocation(line: 115, column: 5, scope: !568)
!570 = !DILocation(line: 112, column: 24, scope: !506)
!571 = !DILocation(line: 112, column: 13, scope: !506)
!572 = !DILocation(line: 111, column: 24, scope: !506)
!573 = !DILocation(line: 111, column: 13, scope: !506)
!574 = !DILocation(line: 117, column: 15, scope: !506)
!575 = !DILocation(line: 107, column: 12, scope: !506)
!576 = !DILocation(line: 117, column: 18, scope: !506)
!577 = !DILocation(line: 117, column: 13, scope: !506)
!578 = !DILocation(line: 118, column: 15, scope: !506)
!579 = !DILocation(line: 108, column: 12, scope: !506)
!580 = !DILocation(line: 118, column: 18, scope: !506)
!581 = !DILocation(line: 118, column: 13, scope: !506)
!582 = !DILocation(line: 104, column: 15, scope: !506)
!583 = !DILocation(line: 119, column: 3, scope: !506)
!584 = !DILocation(line: 105, column: 15, scope: !506)
!585 = !DILocation(line: 120, column: 3, scope: !506)
!586 = !DILocation(line: 121, column: 3, scope: !506)
!587 = !DILocation(line: 0, scope: !506)
!588 = !DILocation(line: 122, column: 1, scope: !506)
!589 = distinct !DISubprogram(name: "routine_simple_1", scope: !3, file: !3, line: 57, type: !81, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !590)
!590 = !{!591, !592, !593, !594}
!591 = !DILocalVariable(name: "i", arg: 1, scope: !589, file: !3, line: 57, type: !31)
!592 = !DILocalVariable(name: "o", arg: 2, scope: !589, file: !3, line: 57, type: !75)
!593 = !DILocalVariable(name: "end", scope: !589, file: !3, line: 59, type: !24)
!594 = !DILocalVariable(name: "a", scope: !589, file: !3, line: 61, type: !7)
!595 = !DILocation(line: 57, column: 29, scope: !589)
!596 = !DILocation(line: 57, column: 39, scope: !589)
!597 = !DILocation(line: 59, column: 19, scope: !589)
!598 = !DILocation(line: 59, column: 13, scope: !589)
!599 = !DILocation(line: 60, column: 19, scope: !589)
!600 = !DILocation(line: 60, column: 3, scope: !589)
!601 = !DILocation(line: 61, column: 16, scope: !589)
!602 = !DILocation(line: 62, column: 13, scope: !589)
!603 = !DILocation(line: 62, column: 11, scope: !589)
!604 = !DILocation(line: 62, column: 3, scope: !589)
!605 = !DILocation(line: 63, column: 52, scope: !606)
!606 = distinct !DILexicalBlock(scope: !589, file: !3, line: 62, column: 18)
!607 = !DILocation(line: 63, column: 5, scope: !606)
!608 = !DILocation(line: 64, column: 5, scope: !606)
!609 = !DILocation(line: 62, column: 9, scope: !589)
!610 = distinct !{!610, !604, !611}
!611 = !DILocation(line: 65, column: 3, scope: !589)
!612 = !DILocation(line: 0, scope: !589)
!613 = !DILocation(line: 66, column: 3, scope: !589)
!614 = !DILocation(line: 67, column: 3, scope: !589)
!615 = !DILocation(line: 68, column: 1, scope: !589)
!616 = distinct !DISubprogram(name: "routine_simple_2", scope: !3, file: !3, line: 70, type: !81, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !617)
!617 = !{!618, !619, !620, !621}
!618 = !DILocalVariable(name: "i", arg: 1, scope: !616, file: !3, line: 70, type: !31)
!619 = !DILocalVariable(name: "o", arg: 2, scope: !616, file: !3, line: 70, type: !75)
!620 = !DILocalVariable(name: "end", scope: !616, file: !3, line: 72, type: !24)
!621 = !DILocalVariable(name: "a", scope: !616, file: !3, line: 74, type: !7)
!622 = !DILocation(line: 70, column: 29, scope: !616)
!623 = !DILocation(line: 70, column: 39, scope: !616)
!624 = !DILocation(line: 72, column: 19, scope: !616)
!625 = !DILocation(line: 72, column: 13, scope: !616)
!626 = !DILocation(line: 73, column: 19, scope: !616)
!627 = !DILocation(line: 73, column: 3, scope: !616)
!628 = !DILocation(line: 74, column: 16, scope: !616)
!629 = !DILocation(line: 76, column: 13, scope: !616)
!630 = !DILocation(line: 76, column: 11, scope: !616)
!631 = !DILocation(line: 76, column: 3, scope: !616)
!632 = !DILocation(line: 77, column: 52, scope: !633)
!633 = distinct !DILexicalBlock(scope: !616, file: !3, line: 76, column: 18)
!634 = !DILocation(line: 77, column: 5, scope: !633)
!635 = !DILocation(line: 78, column: 5, scope: !633)
!636 = !DILocation(line: 76, column: 9, scope: !616)
!637 = distinct !{!637, !631, !638}
!638 = !DILocation(line: 79, column: 3, scope: !616)
!639 = !DILocation(line: 0, scope: !616)
!640 = !DILocation(line: 80, column: 3, scope: !616)
!641 = !DILocation(line: 81, column: 3, scope: !616)
!642 = !DILocation(line: 82, column: 1, scope: !616)
!643 = distinct !DISubprogram(name: "handle_fibers1", scope: !3, file: !3, line: 127, type: !117, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !644)
!644 = !{!645, !646}
!645 = !DILocalVariable(name: "buf", arg: 1, scope: !643, file: !3, line: 127, type: !113)
!646 = !DILocalVariable(name: "priv", arg: 2, scope: !643, file: !3, line: 127, type: !31)
!647 = !DILocation(line: 127, column: 23, scope: !643)
!648 = !DILocation(line: 127, column: 35, scope: !643)
!649 = !DILocation(line: 88, column: 3, scope: !650, inlinedAt: !657)
!650 = distinct !DISubprogram(name: "test_simple_routine1", scope: !3, file: !3, line: 86, type: !507, scopeLine: 87, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !651)
!651 = !{!652, !653, !654, !655}
!652 = !DILocalVariable(name: "simple", scope: !650, file: !3, line: 88, type: !511)
!653 = !DILocalVariable(name: "t", scope: !650, file: !3, line: 90, type: !25)
!654 = !DILocalVariable(name: "f_input", scope: !650, file: !3, line: 92, type: !24)
!655 = !DILocalVariable(name: "p", scope: !656, file: !3, line: 92, type: !31)
!656 = distinct !DILexicalBlock(scope: !650, file: !3, line: 92, column: 23)
!657 = distinct !DILocation(line: 129, column: 3, scope: !643)
!658 = !DILocation(line: 258, column: 26, scope: !544, inlinedAt: !659)
!659 = distinct !DILocation(line: 89, column: 8, scope: !650, inlinedAt: !657)
!660 = !DILocation(line: 258, column: 26, scope: !545, inlinedAt: !659)
!661 = !DILocation(line: 89, column: 26, scope: !650, inlinedAt: !657)
!662 = !DILocation(line: 89, column: 6, scope: !650, inlinedAt: !657)
!663 = !DILocation(line: 90, column: 3, scope: !650, inlinedAt: !657)
!664 = !DILocation(line: 91, column: 3, scope: !650, inlinedAt: !657)
!665 = !DILocation(line: 92, column: 23, scope: !656, inlinedAt: !657)
!666 = !DILocation(line: 93, column: 8, scope: !667, inlinedAt: !657)
!667 = distinct !DILexicalBlock(scope: !650, file: !3, line: 93, column: 7)
!668 = !DILocation(line: 93, column: 7, scope: !650, inlinedAt: !657)
!669 = !DILocation(line: 94, column: 5, scope: !670, inlinedAt: !657)
!670 = distinct !DILexicalBlock(scope: !667, file: !3, line: 93, column: 17)
!671 = !DILocation(line: 95, column: 5, scope: !670, inlinedAt: !657)
!672 = !DILocation(line: 92, column: 23, scope: !650, inlinedAt: !657)
!673 = !DILocation(line: 92, column: 13, scope: !650, inlinedAt: !657)
!674 = !DILocation(line: 97, column: 14, scope: !650, inlinedAt: !657)
!675 = !DILocation(line: 90, column: 12, scope: !650, inlinedAt: !657)
!676 = !DILocation(line: 97, column: 16, scope: !650, inlinedAt: !657)
!677 = !DILocation(line: 97, column: 12, scope: !650, inlinedAt: !657)
!678 = !DILocation(line: 88, column: 15, scope: !650, inlinedAt: !657)
!679 = !DILocation(line: 98, column: 3, scope: !650, inlinedAt: !657)
!680 = !DILocation(line: 99, column: 3, scope: !650, inlinedAt: !657)
!681 = !DILocation(line: 100, column: 1, scope: !650, inlinedAt: !657)
!682 = !DILocation(line: 130, column: 3, scope: !643)
!683 = !DILocation(line: 88, column: 3, scope: !650)
!684 = !DILocation(line: 258, column: 26, scope: !544, inlinedAt: !685)
!685 = distinct !DILocation(line: 89, column: 8, scope: !650)
!686 = !DILocation(line: 258, column: 26, scope: !545, inlinedAt: !685)
!687 = !DILocation(line: 89, column: 26, scope: !650)
!688 = !DILocation(line: 89, column: 6, scope: !650)
!689 = !DILocation(line: 90, column: 3, scope: !650)
!690 = !DILocation(line: 91, column: 3, scope: !650)
!691 = !DILocation(line: 92, column: 23, scope: !656)
!692 = !DILocation(line: 93, column: 8, scope: !667)
!693 = !DILocation(line: 93, column: 7, scope: !650)
!694 = !DILocation(line: 94, column: 5, scope: !670)
!695 = !DILocation(line: 95, column: 5, scope: !670)
!696 = !DILocation(line: 92, column: 23, scope: !650)
!697 = !DILocation(line: 92, column: 13, scope: !650)
!698 = !DILocation(line: 97, column: 14, scope: !650)
!699 = !DILocation(line: 90, column: 12, scope: !650)
!700 = !DILocation(line: 97, column: 16, scope: !650)
!701 = !DILocation(line: 97, column: 12, scope: !650)
!702 = !DILocation(line: 88, column: 15, scope: !650)
!703 = !DILocation(line: 98, column: 3, scope: !650)
!704 = !DILocation(line: 99, column: 3, scope: !650)
!705 = !DILocation(line: 0, scope: !650)
!706 = !DILocation(line: 100, column: 1, scope: !650)
!707 = distinct !DISubprogram(name: "_get_fiber_state", scope: !124, file: !124, line: 76, type: !708, scopeLine: 77, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !123, retainedNodes: !712)
!708 = !DISubroutineType(types: !709)
!709 = !{!710}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "fiber_state", file: !124, line: 66, baseType: !281)
!712 = !{}
!713 = !DILocation(line: 129, column: 25, scope: !714, inlinedAt: !718)
!714 = distinct !DISubprogram(name: "get_cpu", scope: !715, file: !715, line: 127, type: !716, scopeLine: 128, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !123, retainedNodes: !712)
!715 = !DIFile(filename: "include/nautilus/percpu.h", directory: "/home/sgi9754/nautilus-cs446")
!716 = !DISubroutineType(types: !717)
!717 = !{!270}
!718 = distinct !DILocation(line: 78, column: 10, scope: !707)
!719 = !DILocation(line: 129, column: 12, scope: !714, inlinedAt: !718)
!720 = !DILocation(line: 78, column: 21, scope: !707)
!721 = !DILocation(line: 78, column: 3, scope: !707)
!722 = distinct !DISubprogram(name: "nk_fiber_current", scope: !124, file: !124, line: 83, type: !723, scopeLine: 84, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !123, retainedNodes: !712)
!723 = !DISubroutineType(types: !724)
!724 = !{!240}
!725 = !DILocation(line: 129, column: 25, scope: !714, inlinedAt: !726)
!726 = distinct !DILocation(line: 78, column: 10, scope: !707, inlinedAt: !727)
!727 = distinct !DILocation(line: 85, column: 10, scope: !722)
!728 = !DILocation(line: 129, column: 12, scope: !714, inlinedAt: !726)
!729 = !DILocation(line: 78, column: 21, scope: !707, inlinedAt: !727)
!730 = !DILocation(line: 85, column: 30, scope: !722)
!731 = !DILocation(line: 85, column: 3, scope: !722)
!732 = distinct !DISubprogram(name: "_nk_idle_fiber", scope: !124, file: !124, line: 90, type: !723, scopeLine: 91, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !123, retainedNodes: !712)
!733 = !DILocation(line: 129, column: 25, scope: !714, inlinedAt: !734)
!734 = distinct !DILocation(line: 78, column: 10, scope: !707, inlinedAt: !735)
!735 = distinct !DILocation(line: 92, column: 10, scope: !732)
!736 = !DILocation(line: 129, column: 12, scope: !714, inlinedAt: !734)
!737 = !DILocation(line: 78, column: 21, scope: !707, inlinedAt: !735)
!738 = !DILocation(line: 92, column: 30, scope: !732)
!739 = !DILocation(line: 92, column: 3, scope: !732)
!740 = distinct !DISubprogram(name: "_get_fiber_thread", scope: !124, file: !124, line: 96, type: !741, scopeLine: 97, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !123, retainedNodes: !712)
!741 = !DISubroutineType(types: !742)
!742 = !{!285}
!743 = !DILocation(line: 129, column: 25, scope: !714, inlinedAt: !744)
!744 = distinct !DILocation(line: 78, column: 10, scope: !707, inlinedAt: !745)
!745 = distinct !DILocation(line: 98, column: 10, scope: !740)
!746 = !DILocation(line: 129, column: 12, scope: !714, inlinedAt: !744)
!747 = !DILocation(line: 78, column: 21, scope: !707, inlinedAt: !745)
!748 = !DILocation(line: 98, column: 30, scope: !740)
!749 = !DILocation(line: 98, column: 3, scope: !740)
!750 = distinct !DISubprogram(name: "_get_sched_head", scope: !124, file: !124, line: 103, type: !751, scopeLine: 104, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !123, retainedNodes: !712)
!751 = !DISubroutineType(types: !752)
!752 = !{!150}
!753 = !DILocation(line: 129, column: 25, scope: !714, inlinedAt: !754)
!754 = distinct !DILocation(line: 78, column: 10, scope: !707, inlinedAt: !755)
!755 = distinct !DILocation(line: 105, column: 12, scope: !750)
!756 = !DILocation(line: 129, column: 12, scope: !714, inlinedAt: !754)
!757 = !DILocation(line: 78, column: 21, scope: !707, inlinedAt: !755)
!758 = !DILocation(line: 105, column: 32, scope: !750)
!759 = !DILocation(line: 105, column: 3, scope: !750)
!760 = distinct !DISubprogram(name: "_fiber_push", scope: !124, file: !124, line: 113, type: !761, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !123, retainedNodes: !763)
!761 = !DISubroutineType(types: !762)
!762 = !{null, !240, !25}
!763 = !{!764, !765}
!764 = !DILocalVariable(name: "f", arg: 1, scope: !760, file: !124, line: 113, type: !240)
!765 = !DILocalVariable(name: "x", arg: 2, scope: !760, file: !124, line: 113, type: !25)
!766 = !DILocation(line: 113, column: 31, scope: !760)
!767 = !DILocation(line: 113, column: 43, scope: !760)
!768 = !DILocation(line: 115, column: 8, scope: !760)
!769 = !DILocation(line: 115, column: 12, scope: !760)
!770 = !DILocation(line: 116, column: 6, scope: !760)
!771 = !DILocation(line: 116, column: 26, scope: !760)
!772 = !DILocation(line: 117, column: 1, scope: !760)
!773 = distinct !DISubprogram(name: "_rr_policy", scope: !124, file: !124, line: 119, type: !723, scopeLine: 120, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !123, retainedNodes: !774)
!774 = !{!775, !776, !777, !781}
!775 = !DILocalVariable(name: "fiber_sched_queue", scope: !773, file: !124, line: 122, type: !150)
!776 = !DILocalVariable(name: "fiber_to_schedule", scope: !773, file: !124, line: 125, type: !240)
!777 = !DILocalVariable(name: "first", scope: !778, file: !124, line: 128, type: !240)
!778 = distinct !DILexicalBlock(scope: !779, file: !124, line: 128, column: 25)
!779 = distinct !DILexicalBlock(scope: !780, file: !124, line: 126, column: 40)
!780 = distinct !DILexicalBlock(scope: !773, file: !124, line: 126, column: 7)
!781 = !DILocalVariable(name: "__mptr", scope: !782, file: !124, line: 128, type: !785)
!782 = distinct !DILexicalBlock(scope: !783, file: !124, line: 128, column: 25)
!783 = distinct !DILexicalBlock(scope: !784, file: !124, line: 128, column: 25)
!784 = distinct !DILexicalBlock(scope: !778, file: !124, line: 128, column: 25)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !147)
!787 = !DILocation(line: 129, column: 25, scope: !714, inlinedAt: !788)
!788 = distinct !DILocation(line: 78, column: 10, scope: !707, inlinedAt: !789)
!789 = distinct !DILocation(line: 105, column: 12, scope: !750, inlinedAt: !790)
!790 = distinct !DILocation(line: 122, column: 41, scope: !773)
!791 = !DILocation(line: 129, column: 12, scope: !714, inlinedAt: !788)
!792 = !DILocation(line: 78, column: 21, scope: !707, inlinedAt: !789)
!793 = !DILocation(line: 105, column: 32, scope: !750, inlinedAt: !790)
!794 = !DILocation(line: 122, column: 21, scope: !773)
!795 = !DILocation(line: 125, column: 15, scope: !773)
!796 = !DILocalVariable(name: "head", arg: 1, scope: !797, file: !53, line: 184, type: !785)
!797 = distinct !DISubprogram(name: "list_empty", scope: !53, file: !53, line: 184, type: !798, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !123, retainedNodes: !800)
!798 = !DISubroutineType(types: !799)
!799 = !{!48, !785}
!800 = !{!796}
!801 = !DILocation(line: 184, column: 54, scope: !797, inlinedAt: !802)
!802 = distinct !DILocation(line: 126, column: 9, scope: !780)
!803 = !DILocation(line: 186, column: 15, scope: !797, inlinedAt: !802)
!804 = !DILocation(line: 186, column: 20, scope: !797, inlinedAt: !802)
!805 = !DILocation(line: 126, column: 7, scope: !773)
!806 = !DILocation(line: 128, column: 25, scope: !778)
!807 = !DILocation(line: 131, column: 40, scope: !779)
!808 = !DILocalVariable(name: "entry", arg: 1, scope: !809, file: !53, line: 151, type: !150)
!809 = distinct !DISubprogram(name: "list_del_init", scope: !53, file: !53, line: 151, type: !810, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !123, retainedNodes: !812)
!810 = !DISubroutineType(types: !811)
!811 = !{null, !150}
!812 = !{!808}
!813 = !DILocation(line: 151, column: 52, scope: !809, inlinedAt: !814)
!814 = distinct !DILocation(line: 131, column: 5, scope: !779)
!815 = !DILocation(line: 153, column: 20, scope: !809, inlinedAt: !814)
!816 = !DILocation(line: 153, column: 33, scope: !809, inlinedAt: !814)
!817 = !DILocalVariable(name: "prev", arg: 1, scope: !818, file: !53, line: 128, type: !150)
!818 = distinct !DISubprogram(name: "__list_del", scope: !53, file: !53, line: 128, type: !819, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !123, retainedNodes: !821)
!819 = !DISubroutineType(types: !820)
!820 = !{null, !150, !150}
!821 = !{!817, !822}
!822 = !DILocalVariable(name: "next", arg: 2, scope: !818, file: !53, line: 128, type: !150)
!823 = !DILocation(line: 128, column: 50, scope: !818, inlinedAt: !824)
!824 = distinct !DILocation(line: 153, column: 2, scope: !809, inlinedAt: !814)
!825 = !DILocation(line: 128, column: 75, scope: !818, inlinedAt: !824)
!826 = !DILocation(line: 130, column: 8, scope: !818, inlinedAt: !824)
!827 = !DILocation(line: 130, column: 13, scope: !818, inlinedAt: !824)
!828 = !DILocation(line: 131, column: 8, scope: !818, inlinedAt: !824)
!829 = !DILocation(line: 131, column: 13, scope: !818, inlinedAt: !824)
!830 = !DILocalVariable(name: "list", arg: 1, scope: !831, file: !53, line: 73, type: !150)
!831 = distinct !DISubprogram(name: "INIT_LIST_HEAD", scope: !53, file: !53, line: 73, type: !810, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !123, retainedNodes: !832)
!832 = !{!830}
!833 = !DILocation(line: 73, column: 53, scope: !831, inlinedAt: !834)
!834 = distinct !DILocation(line: 154, column: 2, scope: !809, inlinedAt: !814)
!835 = !DILocation(line: 75, column: 13, scope: !831, inlinedAt: !834)
!836 = !DILocation(line: 76, column: 13, scope: !831, inlinedAt: !834)
!837 = !DILocation(line: 132, column: 3, scope: !779)
!838 = !DILocation(line: 0, scope: !773)
!839 = !DILocation(line: 139, column: 3, scope: !773)
!840 = distinct !DISubprogram(name: "_nk_fiber_exit", scope: !124, file: !124, line: 144, type: !841, scopeLine: 145, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !123, retainedNodes: !843)
!841 = !DISubroutineType(types: !842)
!842 = !{null, !240}
!843 = !{!844, !845, !846, !847, !848, !851}
!844 = !DILocalVariable(name: "f", arg: 1, scope: !840, file: !124, line: 144, type: !240)
!845 = !DILocalVariable(name: "next", scope: !840, file: !124, line: 149, type: !240)
!846 = !DILocalVariable(name: "temp", scope: !840, file: !124, line: 155, type: !240)
!847 = !DILocalVariable(name: "waitq", scope: !840, file: !124, line: 156, type: !150)
!848 = !DILocalVariable(name: "first", scope: !849, file: !124, line: 163, type: !240)
!849 = distinct !DILexicalBlock(scope: !850, file: !124, line: 163, column: 12)
!850 = distinct !DILexicalBlock(scope: !840, file: !124, line: 160, column: 25)
!851 = !DILocalVariable(name: "__mptr", scope: !852, file: !124, line: 163, type: !785)
!852 = distinct !DILexicalBlock(scope: !853, file: !124, line: 163, column: 12)
!853 = distinct !DILexicalBlock(scope: !854, file: !124, line: 163, column: 12)
!854 = distinct !DILexicalBlock(scope: !849, file: !124, line: 163, column: 12)
!855 = !DILocation(line: 144, column: 33, scope: !840)
!856 = !DILocation(line: 147, column: 6, scope: !840)
!857 = !DILocation(line: 147, column: 15, scope: !840)
!858 = !DILocation(line: 149, column: 15, scope: !840)
!859 = !DILocation(line: 156, column: 34, scope: !840)
!860 = !DILocation(line: 156, column: 21, scope: !840)
!861 = !DILocation(line: 160, column: 12, scope: !840)
!862 = !DILocation(line: 160, column: 21, scope: !840)
!863 = !DILocation(line: 160, column: 3, scope: !840)
!864 = !DILocation(line: 163, column: 12, scope: !849)
!865 = !DILocation(line: 163, column: 12, scope: !854)
!866 = !DILocation(line: 155, column: 15, scope: !840)
!867 = !DILocation(line: 164, column: 27, scope: !850)
!868 = !DILocation(line: 151, column: 52, scope: !809, inlinedAt: !869)
!869 = distinct !DILocation(line: 164, column: 5, scope: !850)
!870 = !DILocation(line: 153, column: 20, scope: !809, inlinedAt: !869)
!871 = !DILocation(line: 153, column: 33, scope: !809, inlinedAt: !869)
!872 = !DILocation(line: 128, column: 50, scope: !818, inlinedAt: !873)
!873 = distinct !DILocation(line: 153, column: 2, scope: !809, inlinedAt: !869)
!874 = !DILocation(line: 128, column: 75, scope: !818, inlinedAt: !873)
!875 = !DILocation(line: 130, column: 8, scope: !818, inlinedAt: !873)
!876 = !DILocation(line: 130, column: 13, scope: !818, inlinedAt: !873)
!877 = !DILocation(line: 131, column: 8, scope: !818, inlinedAt: !873)
!878 = !DILocation(line: 131, column: 13, scope: !818, inlinedAt: !873)
!879 = !DILocation(line: 73, column: 53, scope: !831, inlinedAt: !880)
!880 = distinct !DILocation(line: 154, column: 2, scope: !809, inlinedAt: !869)
!881 = !DILocation(line: 75, column: 13, scope: !831, inlinedAt: !880)
!882 = !DILocation(line: 76, column: 13, scope: !831, inlinedAt: !880)
!883 = !DILocation(line: 165, column: 16, scope: !850)
!884 = !DILocation(line: 168, column: 9, scope: !885)
!885 = distinct !DILexicalBlock(scope: !850, file: !124, line: 168, column: 9)
!886 = !DILocation(line: 168, column: 9, scope: !850)
!887 = !DILocalVariable(name: "f", arg: 1, scope: !888, file: !124, line: 663, type: !240)
!888 = distinct !DISubprogram(name: "nk_fiber_run", scope: !124, file: !124, line: 663, type: !889, scopeLine: 664, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !123, retainedNodes: !891)
!889 = !DISubroutineType(types: !890)
!890 = !{!48, !240, !29}
!891 = !{!887, !892, !893, !894}
!892 = !DILocalVariable(name: "random_cpu_flag", arg: 2, scope: !888, file: !124, line: 663, type: !29)
!893 = !DILocalVariable(name: "curr_thread", scope: !888, file: !124, line: 666, type: !285)
!894 = !DILocalVariable(name: "fiber_sched_queue", scope: !888, file: !124, line: 674, type: !150)
!895 = !DILocation(line: 663, column: 30, scope: !888, inlinedAt: !896)
!896 = distinct !DILocation(line: 171, column: 7, scope: !897)
!897 = distinct !DILexicalBlock(scope: !885, file: !124, line: 168, column: 14)
!898 = !DILocation(line: 663, column: 41, scope: !888, inlinedAt: !896)
!899 = !DILocation(line: 129, column: 25, scope: !714, inlinedAt: !900)
!900 = distinct !DILocation(line: 78, column: 10, scope: !707, inlinedAt: !901)
!901 = distinct !DILocation(line: 98, column: 10, scope: !740, inlinedAt: !902)
!902 = distinct !DILocation(line: 666, column: 30, scope: !888, inlinedAt: !896)
!903 = !DILocation(line: 666, column: 16, scope: !888, inlinedAt: !896)
!904 = !DILocation(line: 366, column: 29, scope: !905, inlinedAt: !912)
!905 = distinct !DILexicalBlock(scope: !906, file: !124, line: 366, column: 29)
!906 = distinct !DILexicalBlock(scope: !907, file: !124, line: 366, column: 29)
!907 = distinct !DISubprogram(name: "_nk_initial_placement", scope: !124, file: !124, line: 363, type: !507, scopeLine: 364, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !123, retainedNodes: !908)
!908 = !{!909, !910, !911}
!909 = !DILocalVariable(name: "sys", scope: !907, file: !124, line: 366, type: !264)
!910 = !DILocalVariable(name: "__r", scope: !906, file: !124, line: 366, type: !264)
!911 = !DILocalVariable(name: "__r", scope: !905, file: !124, line: 366, type: !264)
!912 = distinct !DILocation(line: 373, column: 20, scope: !913, inlinedAt: !921)
!913 = distinct !DISubprogram(name: "_get_random_fiber_thread", scope: !124, file: !124, line: 370, type: !741, scopeLine: 371, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !123, retainedNodes: !914)
!914 = !{!915, !916, !917, !919}
!915 = !DILocalVariable(name: "random_cpu", scope: !913, file: !124, line: 373, type: !48)
!916 = !DILocalVariable(name: "sys", scope: !913, file: !124, line: 374, type: !264)
!917 = !DILocalVariable(name: "__r", scope: !918, file: !124, line: 374, type: !264)
!918 = distinct !DILexicalBlock(scope: !913, file: !124, line: 374, column: 27)
!919 = !DILocalVariable(name: "__r", scope: !920, file: !124, line: 374, type: !264)
!920 = distinct !DILexicalBlock(scope: !918, file: !124, line: 374, column: 27)
!921 = distinct !DILocation(line: 670, column: 19, scope: !922, inlinedAt: !896)
!922 = distinct !DILexicalBlock(scope: !923, file: !124, line: 669, column: 23)
!923 = distinct !DILexicalBlock(scope: !888, file: !124, line: 669, column: 7)
!924 = !{i32 -2147185108}
!925 = !DILocation(line: 366, column: 29, scope: !906, inlinedAt: !912)
!926 = !DILocation(line: 366, column: 23, scope: !907, inlinedAt: !912)
!927 = !DILocation(line: 358, column: 5, scope: !928, inlinedAt: !933)
!928 = distinct !DISubprogram(name: "_get_random", scope: !124, file: !124, line: 356, type: !929, scopeLine: 357, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !123, retainedNodes: !931)
!929 = !DISubroutineType(types: !930)
!930 = !{!25}
!931 = !{!932}
!932 = !DILocalVariable(name: "t", scope: !928, file: !124, line: 358, type: !25)
!933 = distinct !DILocation(line: 367, column: 18, scope: !907, inlinedAt: !912)
!934 = !DILocation(line: 359, column: 5, scope: !928, inlinedAt: !933)
!935 = !DILocation(line: 360, column: 12, scope: !928, inlinedAt: !933)
!936 = !DILocation(line: 358, column: 14, scope: !928, inlinedAt: !933)
!937 = !DILocation(line: 361, column: 1, scope: !928, inlinedAt: !933)
!938 = !DILocation(line: 367, column: 39, scope: !907, inlinedAt: !912)
!939 = !DILocation(line: 367, column: 34, scope: !907, inlinedAt: !912)
!940 = !DILocation(line: 367, column: 32, scope: !907, inlinedAt: !912)
!941 = !DILocation(line: 374, column: 27, scope: !920, inlinedAt: !921)
!942 = !{i32 -2147182107}
!943 = !DILocation(line: 374, column: 27, scope: !918, inlinedAt: !921)
!944 = !DILocation(line: 374, column: 21, scope: !913, inlinedAt: !921)
!945 = !DILocation(line: 375, column: 10, scope: !913, inlinedAt: !921)
!946 = !DILocation(line: 0, scope: !888, inlinedAt: !896)
!947 = !DILocation(line: 129, column: 25, scope: !714, inlinedAt: !948)
!948 = distinct !DILocation(line: 78, column: 10, scope: !707, inlinedAt: !949)
!949 = distinct !DILocation(line: 105, column: 12, scope: !750, inlinedAt: !950)
!950 = distinct !DILocation(line: 674, column: 41, scope: !888, inlinedAt: !896)
!951 = !DILocation(line: 129, column: 12, scope: !714, inlinedAt: !948)
!952 = !DILocation(line: 78, column: 21, scope: !707, inlinedAt: !949)
!953 = !DILocation(line: 105, column: 32, scope: !750, inlinedAt: !950)
!954 = !DILocation(line: 674, column: 21, scope: !888, inlinedAt: !896)
!955 = !DILocation(line: 678, column: 6, scope: !888, inlinedAt: !896)
!956 = !DILocation(line: 678, column: 15, scope: !888, inlinedAt: !896)
!957 = !DILocation(line: 679, column: 22, scope: !888, inlinedAt: !896)
!958 = !DILocalVariable(name: "nelm", arg: 1, scope: !959, file: !53, line: 116, type: !150)
!959 = distinct !DISubprogram(name: "list_add_tail", scope: !53, file: !53, line: 116, type: !819, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !123, retainedNodes: !960)
!960 = !{!958, !961}
!961 = !DILocalVariable(name: "head", arg: 2, scope: !959, file: !53, line: 116, type: !150)
!962 = !DILocation(line: 116, column: 52, scope: !959, inlinedAt: !963)
!963 = distinct !DILocation(line: 679, column: 3, scope: !888, inlinedAt: !896)
!964 = !DILocation(line: 116, column: 76, scope: !959, inlinedAt: !963)
!965 = !DILocation(line: 118, column: 25, scope: !959, inlinedAt: !963)
!966 = !DILocalVariable(name: "nelm", arg: 1, scope: !967, file: !53, line: 85, type: !150)
!967 = distinct !DISubprogram(name: "__list_add", scope: !53, file: !53, line: 85, type: !968, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !123, retainedNodes: !970)
!968 = !DISubroutineType(types: !969)
!969 = !{null, !150, !150, !150}
!970 = !{!966, !971, !972}
!971 = !DILocalVariable(name: "prev", arg: 2, scope: !967, file: !53, line: 86, type: !150)
!972 = !DILocalVariable(name: "next", arg: 3, scope: !967, file: !53, line: 87, type: !150)
!973 = !DILocation(line: 85, column: 49, scope: !967, inlinedAt: !974)
!974 = distinct !DILocation(line: 118, column: 2, scope: !959, inlinedAt: !963)
!975 = !DILocation(line: 86, column: 28, scope: !967, inlinedAt: !974)
!976 = !DILocation(line: 87, column: 28, scope: !967, inlinedAt: !974)
!977 = !DILocation(line: 89, column: 13, scope: !967, inlinedAt: !974)
!978 = !DILocation(line: 90, column: 8, scope: !967, inlinedAt: !974)
!979 = !DILocation(line: 90, column: 13, scope: !967, inlinedAt: !974)
!980 = !DILocation(line: 91, column: 8, scope: !967, inlinedAt: !974)
!981 = !DILocation(line: 91, column: 13, scope: !967, inlinedAt: !974)
!982 = !DILocation(line: 92, column: 8, scope: !967, inlinedAt: !974)
!983 = !DILocation(line: 92, column: 13, scope: !967, inlinedAt: !974)
!984 = !DILocation(line: 683, column: 20, scope: !985, inlinedAt: !896)
!985 = distinct !DILexicalBlock(scope: !888, file: !124, line: 683, column: 7)
!986 = !DILocation(line: 683, column: 7, scope: !985, inlinedAt: !896)
!987 = !DILocation(line: 683, column: 7, scope: !888, inlinedAt: !896)
!988 = !DILocation(line: 687, column: 5, scope: !989, inlinedAt: !896)
!989 = distinct !DILexicalBlock(scope: !985, file: !124, line: 683, column: 26)
!990 = !DILocation(line: 688, column: 3, scope: !989, inlinedAt: !896)
!991 = distinct !{!991, !863, !992}
!992 = !DILocation(line: 173, column: 3, scope: !840)
!993 = !DILocation(line: 175, column: 6, scope: !840)
!994 = !DILocation(line: 175, column: 14, scope: !840)
!995 = !DILocation(line: 129, column: 25, scope: !714, inlinedAt: !996)
!996 = distinct !DILocation(line: 78, column: 10, scope: !707, inlinedAt: !997)
!997 = distinct !DILocation(line: 105, column: 12, scope: !750, inlinedAt: !998)
!998 = distinct !DILocation(line: 122, column: 41, scope: !773, inlinedAt: !999)
!999 = distinct !DILocation(line: 179, column: 10, scope: !840)
!1000 = !DILocation(line: 129, column: 12, scope: !714, inlinedAt: !996)
!1001 = !DILocation(line: 78, column: 21, scope: !707, inlinedAt: !997)
!1002 = !DILocation(line: 105, column: 32, scope: !750, inlinedAt: !998)
!1003 = !DILocation(line: 122, column: 21, scope: !773, inlinedAt: !999)
!1004 = !DILocation(line: 125, column: 15, scope: !773, inlinedAt: !999)
!1005 = !DILocation(line: 184, column: 54, scope: !797, inlinedAt: !1006)
!1006 = distinct !DILocation(line: 126, column: 9, scope: !780, inlinedAt: !999)
!1007 = !DILocation(line: 186, column: 15, scope: !797, inlinedAt: !1006)
!1008 = !DILocation(line: 186, column: 20, scope: !797, inlinedAt: !1006)
!1009 = !DILocation(line: 126, column: 7, scope: !773, inlinedAt: !999)
!1010 = !DILocation(line: 128, column: 25, scope: !778, inlinedAt: !999)
!1011 = !DILocation(line: 131, column: 40, scope: !779, inlinedAt: !999)
!1012 = !DILocation(line: 151, column: 52, scope: !809, inlinedAt: !1013)
!1013 = distinct !DILocation(line: 131, column: 5, scope: !779, inlinedAt: !999)
!1014 = !DILocation(line: 153, column: 20, scope: !809, inlinedAt: !1013)
!1015 = !DILocation(line: 153, column: 33, scope: !809, inlinedAt: !1013)
!1016 = !DILocation(line: 128, column: 50, scope: !818, inlinedAt: !1017)
!1017 = distinct !DILocation(line: 153, column: 2, scope: !809, inlinedAt: !1013)
!1018 = !DILocation(line: 128, column: 75, scope: !818, inlinedAt: !1017)
!1019 = !DILocation(line: 130, column: 8, scope: !818, inlinedAt: !1017)
!1020 = !DILocation(line: 130, column: 13, scope: !818, inlinedAt: !1017)
!1021 = !DILocation(line: 131, column: 8, scope: !818, inlinedAt: !1017)
!1022 = !DILocation(line: 131, column: 13, scope: !818, inlinedAt: !1017)
!1023 = !DILocation(line: 73, column: 53, scope: !831, inlinedAt: !1024)
!1024 = distinct !DILocation(line: 154, column: 2, scope: !809, inlinedAt: !1013)
!1025 = !DILocation(line: 75, column: 13, scope: !831, inlinedAt: !1024)
!1026 = !DILocation(line: 76, column: 13, scope: !831, inlinedAt: !1024)
!1027 = !DILocation(line: 180, column: 8, scope: !1028)
!1028 = distinct !DILexicalBlock(scope: !840, file: !124, line: 180, column: 7)
!1029 = !DILocation(line: 180, column: 7, scope: !840)
!1030 = !DILocation(line: 129, column: 25, scope: !714, inlinedAt: !1031)
!1031 = distinct !DILocation(line: 78, column: 10, scope: !707, inlinedAt: !1032)
!1032 = distinct !DILocation(line: 92, column: 10, scope: !732, inlinedAt: !1033)
!1033 = distinct !DILocation(line: 181, column: 12, scope: !1034)
!1034 = distinct !DILexicalBlock(scope: !1028, file: !124, line: 180, column: 16)
!1035 = !DILocation(line: 129, column: 12, scope: !714, inlinedAt: !1031)
!1036 = !DILocation(line: 78, column: 21, scope: !707, inlinedAt: !1032)
!1037 = !DILocation(line: 92, column: 30, scope: !732, inlinedAt: !1033)
!1038 = !DILocation(line: 182, column: 3, scope: !1034)
!1039 = !DILocation(line: 0, scope: !840)
!1040 = !DILocation(line: 129, column: 25, scope: !714, inlinedAt: !1041)
!1041 = distinct !DILocation(line: 78, column: 10, scope: !707, inlinedAt: !1042)
!1042 = distinct !DILocation(line: 183, column: 3, scope: !840)
!1043 = !DILocation(line: 129, column: 12, scope: !714, inlinedAt: !1041)
!1044 = !DILocation(line: 78, column: 21, scope: !707, inlinedAt: !1042)
!1045 = !DILocation(line: 183, column: 23, scope: !840)
!1046 = !DILocation(line: 183, column: 34, scope: !840)
!1047 = !DILocation(line: 129, column: 25, scope: !714, inlinedAt: !1048)
!1048 = distinct !DILocation(line: 78, column: 10, scope: !707, inlinedAt: !1049)
!1049 = distinct !DILocation(line: 186, column: 19, scope: !840)
!1050 = !DILocation(line: 129, column: 12, scope: !714, inlinedAt: !1048)
!1051 = !DILocation(line: 78, column: 21, scope: !707, inlinedAt: !1049)
!1052 = !DILocation(line: 186, column: 39, scope: !840)
!1053 = !DILocation(line: 186, column: 51, scope: !840)
!1054 = !DILocation(line: 151, column: 52, scope: !809, inlinedAt: !1055)
!1055 = distinct !DILocation(line: 186, column: 3, scope: !840)
!1056 = !DILocation(line: 153, column: 20, scope: !809, inlinedAt: !1055)
!1057 = !DILocation(line: 153, column: 33, scope: !809, inlinedAt: !1055)
!1058 = !DILocation(line: 128, column: 50, scope: !818, inlinedAt: !1059)
!1059 = distinct !DILocation(line: 153, column: 2, scope: !809, inlinedAt: !1055)
!1060 = !DILocation(line: 128, column: 75, scope: !818, inlinedAt: !1059)
!1061 = !DILocation(line: 130, column: 8, scope: !818, inlinedAt: !1059)
!1062 = !DILocation(line: 130, column: 13, scope: !818, inlinedAt: !1059)
!1063 = !DILocation(line: 131, column: 8, scope: !818, inlinedAt: !1059)
!1064 = !DILocation(line: 131, column: 13, scope: !818, inlinedAt: !1059)
!1065 = !DILocation(line: 73, column: 53, scope: !831, inlinedAt: !1066)
!1066 = distinct !DILocation(line: 154, column: 2, scope: !809, inlinedAt: !1055)
!1067 = !DILocation(line: 75, column: 13, scope: !831, inlinedAt: !1066)
!1068 = !DILocation(line: 76, column: 13, scope: !831, inlinedAt: !1066)
!1069 = !DILocation(line: 189, column: 3, scope: !840)
!1070 = !DILocation(line: 190, column: 3, scope: !840)
!1071 = !DILocation(line: 193, column: 3, scope: !840)
!1072 = !DILocation(line: 196, column: 1, scope: !840)
!1073 = !DILocation(line: 663, column: 30, scope: !888)
!1074 = !DILocation(line: 663, column: 41, scope: !888)
!1075 = !DILocation(line: 129, column: 25, scope: !714, inlinedAt: !1076)
!1076 = distinct !DILocation(line: 78, column: 10, scope: !707, inlinedAt: !1077)
!1077 = distinct !DILocation(line: 98, column: 10, scope: !740, inlinedAt: !1078)
!1078 = distinct !DILocation(line: 666, column: 30, scope: !888)
!1079 = !DILocation(line: 129, column: 12, scope: !714, inlinedAt: !1076)
!1080 = !DILocation(line: 666, column: 16, scope: !888)
!1081 = !DILocation(line: 669, column: 7, scope: !923)
!1082 = !DILocation(line: 669, column: 7, scope: !888)
!1083 = !DILocation(line: 366, column: 29, scope: !905, inlinedAt: !1084)
!1084 = distinct !DILocation(line: 373, column: 20, scope: !913, inlinedAt: !1085)
!1085 = distinct !DILocation(line: 670, column: 19, scope: !922)
!1086 = !DILocation(line: 366, column: 29, scope: !906, inlinedAt: !1084)
!1087 = !DILocation(line: 366, column: 23, scope: !907, inlinedAt: !1084)
!1088 = !DILocation(line: 358, column: 5, scope: !928, inlinedAt: !1089)
!1089 = distinct !DILocation(line: 367, column: 18, scope: !907, inlinedAt: !1084)
!1090 = !DILocation(line: 359, column: 5, scope: !928, inlinedAt: !1089)
!1091 = !DILocation(line: 360, column: 12, scope: !928, inlinedAt: !1089)
!1092 = !DILocation(line: 358, column: 14, scope: !928, inlinedAt: !1089)
!1093 = !DILocation(line: 361, column: 1, scope: !928, inlinedAt: !1089)
!1094 = !DILocation(line: 367, column: 39, scope: !907, inlinedAt: !1084)
!1095 = !DILocation(line: 367, column: 34, scope: !907, inlinedAt: !1084)
!1096 = !DILocation(line: 367, column: 32, scope: !907, inlinedAt: !1084)
!1097 = !DILocation(line: 374, column: 27, scope: !920, inlinedAt: !1085)
!1098 = !DILocation(line: 374, column: 27, scope: !918, inlinedAt: !1085)
!1099 = !DILocation(line: 374, column: 21, scope: !913, inlinedAt: !1085)
!1100 = !DILocation(line: 375, column: 10, scope: !913, inlinedAt: !1085)
!1101 = !DILocation(line: 671, column: 3, scope: !922)
!1102 = !DILocation(line: 0, scope: !888)
!1103 = !DILocation(line: 129, column: 25, scope: !714, inlinedAt: !1104)
!1104 = distinct !DILocation(line: 78, column: 10, scope: !707, inlinedAt: !1105)
!1105 = distinct !DILocation(line: 105, column: 12, scope: !750, inlinedAt: !1106)
!1106 = distinct !DILocation(line: 674, column: 41, scope: !888)
!1107 = !DILocation(line: 129, column: 12, scope: !714, inlinedAt: !1104)
!1108 = !DILocation(line: 78, column: 21, scope: !707, inlinedAt: !1105)
!1109 = !DILocation(line: 105, column: 32, scope: !750, inlinedAt: !1106)
!1110 = !DILocation(line: 674, column: 21, scope: !888)
!1111 = !DILocation(line: 678, column: 6, scope: !888)
!1112 = !DILocation(line: 678, column: 15, scope: !888)
!1113 = !DILocation(line: 679, column: 22, scope: !888)
!1114 = !DILocation(line: 116, column: 52, scope: !959, inlinedAt: !1115)
!1115 = distinct !DILocation(line: 679, column: 3, scope: !888)
!1116 = !DILocation(line: 116, column: 76, scope: !959, inlinedAt: !1115)
!1117 = !DILocation(line: 118, column: 25, scope: !959, inlinedAt: !1115)
!1118 = !DILocation(line: 85, column: 49, scope: !967, inlinedAt: !1119)
!1119 = distinct !DILocation(line: 118, column: 2, scope: !959, inlinedAt: !1115)
!1120 = !DILocation(line: 86, column: 28, scope: !967, inlinedAt: !1119)
!1121 = !DILocation(line: 87, column: 28, scope: !967, inlinedAt: !1119)
!1122 = !DILocation(line: 89, column: 13, scope: !967, inlinedAt: !1119)
!1123 = !DILocation(line: 90, column: 8, scope: !967, inlinedAt: !1119)
!1124 = !DILocation(line: 90, column: 13, scope: !967, inlinedAt: !1119)
!1125 = !DILocation(line: 91, column: 8, scope: !967, inlinedAt: !1119)
!1126 = !DILocation(line: 91, column: 13, scope: !967, inlinedAt: !1119)
!1127 = !DILocation(line: 92, column: 8, scope: !967, inlinedAt: !1119)
!1128 = !DILocation(line: 92, column: 13, scope: !967, inlinedAt: !1119)
!1129 = !DILocation(line: 683, column: 20, scope: !985)
!1130 = !DILocation(line: 683, column: 7, scope: !985)
!1131 = !DILocation(line: 683, column: 7, scope: !888)
!1132 = !DILocation(line: 687, column: 5, scope: !989)
!1133 = !DILocation(line: 688, column: 3, scope: !989)
